[
  {
    "weekDay": "Monday",
    "type": "Rest Day",
    "image": "rest"
  },
  {
    "weekDay": "Tuesday",
    "type": "Easy Run",
    "image": "easy",
    "distance": 10,
    "time": 96,
    "description": "Calm distance of approx. 10 km to just keep feeling and volume in the training. Keep in mind that the end of the week will be tough, so a calm \"entertaining¨\" start to the week is good enough.",
    "details": [
      {
        "name": "Easy Run",
        "distance": 10,
        "timeMin": 55,
        "timeMax": 56
      },
      {
        "name": "Strength Training",
        "timeMin": 15,
        "timeMax": 30
      },
      {
        "name": "Stretching",
        "time": 10
      }
    ]
  },
  {
    "weekDay": "Wednesday",
    "type": "Rest Day",
    "image": "rest"
  },
  {
    "weekDay": "Thursday",
    "type": "Fast Run",
    "image": "fast",
    "distance": 12,
    "time": 85,
    "description": "Fast distance of 12 km. It can be a tough, really tough session, but with a focus on fluidity in running. If you feel more like threshold speed, choose it. Marathon speed can also be enough...Let the day's form decide and keep in mind that we save the last bit to pick out the body for the marathon.\n\nThose of you who are part of TSM Running can run the fast distance on the \"Milspåret\", either 5 or 10 km which is the official test run for TSM Running.",
    "details": [
      {
        "name": "Warm up",
        "distance": 3,
        "timeMin": 16,
        "timeMax": 17
      },
      {
        "name": "Dynamic Movement",
        "time": 5
      },
      {
        "name": "Coordination Run",
        "distanceInfo": "3 x 80m",
        "time": 5
      },
      {
        "name": "Fast Run",
        "distance": 7,
        "timeMin": 34,
        "timeMax": 36
      },
      {
        "name": "Cool Down",
        "distance": 2,
        "timeMin": 11,
        "timeMax": 12
      },
      {
        "name": "Stretching",
        "timeMin": 5,
        "timeMax": 10
      }
    ]
  },
  {
    "weekDay": "Friday",
    "type": "Rest Day",
    "image": "rest"
  },
  {
    "weekDay": "Saturday",
    "type": "Rest Day",
    "image": "rest"
  },
  {
    "weekDay": "Sunday",
    "type": "Long Run",
    "image": "long",
    "distance": 25,
    "time": 151,
    "description": "The program's and perhaps your last long run before the marathon, will be a 25 km run at mostly calm long run speed. During a section over about 4 km, you can increase your speed to well below your intended marathon race speed to get a final test and push your long-run motor!\n\nEnter your speed increase after about 60 minutes of running and try to run faster for about 22 minutes . Finish image at a speed of around 5.30 min/km.\n\nIf you are tired and your body is not responding; run calmly all the way through.\n\nAs always important drink, and energy and more fluids even afterwards for good and important recovery!\n\nRegarding if this is your last long session before the marathon, you can actually if you missed many long sessions, put in a short leisurely long session with a week to go before the race instead of specified training. (Then removes Sunday's schedule where it is in the program).",
    "details": [
      {
        "name": "Long Run",
        "style": "Progressive",
        "distance": 25,
        "timeMin": 138,
        "timeMax": 141
      },
      {
        "name": "Stretching",
        "timeMin": 5,
        "timeMax": 10
      }
    ]
  }
]
