[
  {
    "weekDay": "Monday",
    "type": "Rest Day",
    "image": "rest",
    "description": "A good week with a really tough finish. The goal is to squeeze in a 34 km round for the weekend.\n\n- Good for many mentally to take with you, but if you have done a good long session before, you absolutely do not stand and fall with Sunday's session, but if you are tired, it is completely ok to shorten. You can also skip Saturday's session if you want and feel it is necessary to work towards + 30k the next day.\n\nOther than that, we work with a little speed this week through Thursday's short hill and a marathon session as an introduction which you can shorten to 5-8 km if 10 km feels long just for the day."
  },
  {
    "weekDay": "Tuesday",
    "type": "Interval Run",
    "image": "interval",
    "distance": 9,
    "time": 69,
    "description": "Today we will run an interval ladder where we increase the speed the shorter the intervals become. First, we warm up as usual with a leisurely distance jog that takes you to your interval distance. Aim to get to a stretch/round where you can get in 3 minutes of interval speed running without too much hilling.\n\nAfter the warm-up calm run, you first do some mobility and then we put in the week's running training. Run your exercises as you like, and with a range of motion adapted to you and your habit of running training. Then round off the warm-up with two pulse-raising coordination runs and then 1-2 minutes of rest before starting the interval part.\n\nWe run an interval-setup a little adapted so that you could run this together with one/some running buddies, even if you are at different levels. Because then you/you can run \"forward/backward\" on the same distance as the interval steps we will run constantly repeat an interval length twice. (Forward + backward will make you always end up in the same place after every second interval regardless of level)\n\nRiding alone or with a friend, you can of course drive the session forward on a lap if it feels more stimulating than the forward/back layout.\n\nRegardless of the layout, the goal is that you work at a higher speed the shorter the interval time/distance. Keep in mind, however, that in the initial 3 minutes you take it \"just right\" so you find the right fit in the session.\n\nWe rest the same throughout the session of 1 minute standing/walking between each interval.\n\nThe layout of the interval steps will be: \n\nThe interval steps: 2 x 3 min – 2 x 2 min – 2 x 1 min followed by 2 x 2 min – 2 x 1 min\n\n12 + 6 minutes, a total of 18 minutes of interval time. (In time approx. 4 km)\n\nDirectional speeds:\n\n3 minutes: 4.39 min/km in time approx. 645m\n\n2 minutes: 4.25 min/km in time approx. 450m\n\n1 minute: 4.15 min/km in time approx. 235m \n\nAfter the interval part, you round off as usual with a downhill jog and stretch.",
    "details": [
      {
        "name": "Warm Up",
        "distance": 2,
        "time": 11
      },
      {
        "name": "Dynamic Movement",
        "time": 5
      },
      {
        "name": "Coordination Run",
        "distanceInfo": "1 x 80m",
        "time": 2
      },
      {
        "name": "Interval Run",
        "distance": 5,
        "time": 30
      },
      {
        "name": "Cool Down",
        "distance": 2,
        "time": 11
      },
      {
        "name": "Stretching",
        "timeMin": 5,
        "timeMax": 10
      }
    ]
  },
  {
    "weekDay": "Wednesday",
    "type": "Rest Day",
    "image": "rest"
  },
  {
    "weekDay": "Thursday",
    "type": "Hill Run",
    "image": "hill",
    "distance": 9,
    "time": 67,
    "description": "Warm up as usual with jogging, mobility and the running training exercises.\n\nThe hill should be a \"slightly steeper version\" but you should be able to run with good strides and be able to last around 20-25 seconds in the uphill and feel a little lactic acid in your legs on top\". Take a few (5-10) seconds of rest both at the turning point of your short hill and before starting the next hill. Focus on a good step with good drive. Work well with slightly faster arm movements and good knee assignments if it comes reasonably naturally to you. No completely unfamiliar movements now...\n\nImportant to unwind with a calm jog and stretch!",
    "details": [
      {
        "name": "Warm Up",
        "distance": 3,
        "timeMin": 16,
        "timeMax": 17
      },
      {
        "name": "Dynamic Movement",
        "time": 5
      },
      {
        "name": "Running Technique",
        "distanceInfo": "2 x 30m"
      },
      {
        "name": "Hill Run",
        "style": "Short hill",
        "distance": 3,
        "timeMin": 17,
        "timeMax": 18
      },
      {
        "name": "Cool Down",
        "distance": 3,
        "time": 17
      },
      {
        "name": "Stretching",
        "timeMin": 5,
        "timeMax": 10
      }
    ]
  },
  {
    "weekDay": "Friday",
    "type": "Easy Run",
    "image": "easy",
    "distance": 6,
    "time": 74,
    "description": "Easy extra run that really is extra. Of course gives good effect with tomorrow's run; but run no injury or overtraining limits now to get this run. Only for those of you who feel like you're soaking up all the training right now! Prioritize tomorrow...",
    "details": [
      {
        "name": "Easy Run",
        "distance": 6,
        "timeMin": 33,
        "timeMax": 34
      },
      {
        "name": "Strength Training",
        "timeMin": 15,
        "timeMax": 30
      },
      {
        "name": "Stretching",
        "timeMin": 5,
        "timeMax": 10
      }
    ]
  },
  {
    "weekDay": "Saturday",
    "type": "Rest Day",
    "image": "rest"
  },
  {
    "weekDay": "Sunday",
    "type": "Long Run",
    "image": "long",
    "distance": 35,
    "time": 213,
    "description": "The program's longest long session!\n\nReally long, and inevitably over 3 hours. YOUR CALM SPEED, and it's ok to slow down a notch more than you usually do to complete the distance!\n\nMake sure you load up with some extra carbohydrates the day before, and bring drinks with you on the run. (feel free to try the sports drink if you haven't done it before) Test your intended competition shoes, and see that they work with your feet all the way.\n\nIt is extremely important that you are careful after the session, with energy, drink and dry clothes so that you do not the situation we're in now will catch you with an unnecessary cold.\n\n-Make sure you get an hour's rest after the session, and don't have to do so much before the body has had time to recover a little at least!",
    "details": [
      {
        "name": "Long Run",
        "distance": 35,
        "timeMin": 198,
        "timeMax": 203
      },
      {
        "name": "Dynamic Stretch",
        "timeMin": 5,
        "timeMax": 10
      }
    ]
  }
]
