[
  {
    "name": "3.00 hours",
    "image": "race",
    "session": 139,
    "distance": 1750,
    "timeMin": 5,
    "timeMax": 10,
    "distancePerWeek": 67,
    "info": "adidas Stockholm Marathon - 3.00 hours\n\n26 weeks of training towards the final goal adidas Stockholm Marathon June 1st 2024.\n\nHere you will find some information about the \"fast\" three-hour program!\n\nYou should have a longer period of running training as a basis to be able to follow the 3 hour program without risk of damage. Because it is a tough program with a lot of running!\n\nThe coach believes that you should complete 10 km in around 40 minutes for the 3 hour goal to be realistic, but if you do a little over 40 minutes for 10 km at the start of the program and the running training was not structured earlier, there is a good opportunity to develop 10 km capacity down to 40 during the marathon training minutes and complete the 3.00 goal on the marathon!\n\nThe basic speed for leisurely distance running and long runs is 4.30-4.50 min/km, and it is good if your natural leisurely distance running speed is around this speed range if you want to be able to follow the program easily.\n\nYou can have a lower time goal than 3.00 and follow the program if you like to train hard and many sessions per week and then you adapt the speed to your capacity and remove a session when you feel it is necessary.\n\nIf you aim for clearly faster times than the program, you can use the set-up as a basis and then add a few more longer distance sessions and develop the volume slightly on the qualitative moments. A certain increase in speed on the qualitative moments can also be good, but the long run speed is good enough even at times clearly under 3 hours on the marathon.\n\nYou should have room to train at least three running sessions a week for the next six months.\n\nThe program pulses between 4-6 sessions per week and between 50-100 km per week and it is necessary for the vast majority of people who want to run for less than 3 hours that the running average per week is over 40-50 kms per week.\n\nYou can modify the program if you have other training than the one included in the program and meet the goal of 3 hours by following the program three basic sessions which are preferably on Tuesday, Thursday and Sunday supplemented with your \"personal training\".\n\nIf you have a good training base, you can jump in later in the program and use the last months' plan to sharpen your marathon form.",
    "endPoint": 300
  },
  {
    "name": "3.15 hours",
    "image": "specific",
    "session": 118,
    "distance": 1580,
    "timeMin": 4,
    "timeMax": 9,
    "distancePerWeek": 60,
    "info": "adidas Stockholm Marathon - 3.15 hours\n\nHere you will find the program for the adidas Stockholm Marathon 2024 with the goal of running the race in around 3 hours and 15 minutes.\n\nIn order to easily keep up with the speeds and distances of the 3.15 program, you should have practiced running before, and your body is used to regular training of at least 2-3 sessions a week already at the start of the program.\n\nFor the 3.15 goal to be realistic, coach Szalkai believes that you can handle a 10 km run where you run as hard as you can in 43 minutes or better. If you do a bit over 43 minutes for 10 km at the start of the program but haven't run that much, there is a good opportunity to develop 10 km capacity during the marathon training with the marathon training and then on the road you can absolutely reach the capacity that the 3.15 goal becomes realistic!\n\nThe basic speed for leisurely distance running and long runs is 4.50-5.20 min/km, and it is good if your natural leisurely distance running speed is around this speed range if you want to be able to follow the program easily.\n\nYou can have a slower time goal than 3.15 and follow the program, but then adjust the speed to your capacity and remove a session when you feel it is necessary.\n\nIf you aim for a slightly faster time than the program, you can use the plan as a basis and then add a few more longer distance sessions and develop the volume slightly.\n\nYou should have room to train at least three running sessions a week for the next six months.\n\nThe program pulses between 4-6 sessions per week and between 35-90 km per week and it is necessary for the vast majority of people who want under 3 hours and 15 minutes.\n\nYou can modify the program if you have other training than that included in the program and meet the goal 3.15 the goal by following the program three basic sessions which are preferably on Tuesday, Thursday and Sunday supplemented with your \"own training\".",
    "endPoint": 315
  },
  {
    "name": "3.30 hours",
    "image": "speed",
    "session": 111,
    "distance": 1412,
    "timeMin": 4,
    "timeMax": 8,
    "distancePerWeek": 54,
    "info": "adidas Stockholm Marathon - 3.30 hours\n\nHere you will find the program for the adidas Stockholm Marathon 2024 with the goal of running the race in around 3.5 hours.\n\nIn order for you to easily and safely (read without risk of start-up damage) be able to keep up with the 3.5 hour level, you should have a longer period of cardio training as a basis already at the start of the program\n\nYou should have practiced running at least once a week in recent years, but if you are used to running from earlier in your life, you can start your running training again with the program. But then start smoothly, preferably a week or so before the start of the program.\n\nYou should complete 10 km in around 45 minutes for the 3.30 hour goal to be realistic or under 47 minutes at the start of the program if you come from a period where you did not run much and know that you have development opportunities in 10 km. The program will develop you!!\n\nThe basic speed on leisurely distance running and leisurely long runs is 5.15-5.30 min/km and if your goal is 3.30 on the marathon, it is good if your natural running speed on a leisurely lap is around this speed range.\n\nYou can have a different time goal than 3.30 and follow the program, but then adapt the speed to your capacity and remove some sessions if your goal is slower than 3.30 on the marathon.\n\nThe program pulses between 3-5 sessions a week and the average km per week is 54 km, but you can/should modify the program if you have other training than that included in the program. In order to meet the target of 3.30 hours, you follow the program with three basic sessions, preferably on Tuesday, Thursday and Sunday, supplemented by your \"personal training\".\n\nIf you have a good training base, you can jump into the program later and use the last months' plan to sharpen your marathon form.",
    "endPoint": 330
  },
  {
    "name": "3.45 hours",
    "image": "tapering",
    "session": 104,
    "distance": 1230,
    "timeMin": 3.5,
    "timeMax": 7.5,
    "distancePerWeek": 47,
    "info": "adidas Stockholm Marathon - 3.45 hours\n\nHere you will find the program for the adidas Stockholm Marathon 2024 with the goal of running the race in around 3 hours and 45 minutes.\n\nIn order to stick to the 3.45 program without the risk of start-up damage, it is good if you are used to training some form of exercise at least 2 sessions a week at the start of the program.\n\nYou should have practiced running a few times a week for a few weeks before the start of the program.\n\nYou should complete 10 km in around 48-50 minutes for the 3.45 hour goal to be realistic, but if you do under 51-52 minutes at the start of the program, if you haven't trained that much running before, you can hook on the program and develop your 10 km capacity down under 50 minutes.\n\nThe basic speed for leisurely distance running and leisurely long runs is 5.30-5.50 min/km, and it is good if your natural running speed for a round is roughly within this range if you have 3.45 as your time goal\n\nYou can have a different time goal than 3.45 and follow the program, but then adapt the speed to your capacity and remove some sessions if your goal is slower than 3.45 on the marathon.\n\nThe program pulses between 3-5 sessions a week and the average km per week is 47 km.\n\nYou can modify the program if you have other training than the one included in the program and meet the goal of 3.45 hours by following the program three basic sessions which are preferably on Tuesday, Thursday and Sunday supplemented with your \"personal training\".\n\nIf you have a good training base, you can jump into the program later and use the last months' plan to sharpen your marathon form.",
    "endPoint": 345
  },
  {
    "name": "4.00 hours",
    "image": "hill",
    "session": 96,
    "distance": 1140,
    "timeMin": 3,
    "timeMax": 7.5,
    "distancePerWeek": 44,
    "info": "adidas Stockholm Marathon - 4.00 hours\n\nHere you will find the program for the adidas Stockholm Marathon 2024 with the goal of running the race in around 4 hours.\n\nIn order to keep up with the 4 hour program, coach Anders Szalkai thinks it is good if you have previously practiced running regularly with 2 sessions a week in the last few weeks before the start of the program.\n\nIf the 4.00 hour goal is to be realistic, it is good if you can do around 51-55 minutes on a fast 10 km run. During the course of the program, it is good if you can work 10 km time down to around 50-52 minutes if you want to meet the 4 hour goal. If you have a longer time goal than 4.00 then adjust the speed to your capacity, and then you can also remove some sessions sometimes when the body needs calmer than what the program indicates.\n\nThe program has a fairly tough base speed on easy distances and long runs and the speed range is between 5.40 min/km up to around 6.00 min/km. It is good but not necessary if your naturally calm running speed is in or close to this speed range.\n\nThe program pulses between 3-4 sessions a week.\n\nYou can modify the program if you have other training than that included in the program and meet the goal of 4.00 hours by following the program two basic sessions which are preferably on Thursday and Sunday supplemented with your \"personal training\" of at least 1 session a week (preferably two sessions).",
    "endPoint": 400
  },
  {
    "name": "4.15 hours",
    "image": "easy",
    "session": 93,
    "distance": 1050,
    "timeMin": 3,
    "timeMax": 7.5,
    "distancePerWeek": 40,
    "info": "adidas Stockholm Marathon - 4.15 hours\n\nHere you will find the program for the adidas Stockholm Marathon 2024 with the goal of running the race in around 4 hours and 15 minutes.\n\nIn order to be able to easily join the 4.15 program, it is good if you are already used to training at least 1-2 sessions a week and have a certain basic fitness. The foundation doesn't necessarily have to come from running training, but the program starts with running right away so it's good if you can immediately manage 5-6 km in around 30 minutes without getting completely exhausted.\n\nThe program has a fairly tough base speed at a leisurely distance, 6.00-6.10 min/km (marathon speed or a little slower) and around 6.20-6.25 min/km on the long runs.\n\nIt is good but not necessary if your naturally calm running speed is in or close to this speed range.\n\nIf the 4.15 hour goal is to be realistic, it is good if you can do around 56-58 minutes on a fast 10 km run when you start training.\n\nDuring the course of the program, it is good if you can work 10 km time down to around 54 minutes if you want to meet the 4.15 goal.\n\nIf you have a slower time target than 4.15 then adjust the speed to your capacity.\n\nThe program pulses between 3-4 sessions a week and the km average per week is around 40 km and it is good if you can get a km average a week of around 30 kms.\n\nYou can modify the program if you have other training than the one included in the program and meet the goal 4.15 the goal by following the program two basic sessions which are preferably on Thursday and Sunday supplemented with your \"personal training\" of at least 1 session a week (preferably two sessions).\n\nIf you have a good training base, you can jump into the program later and use the last months' plan to sharpen your marathon form and reach the goal.",
    "endPoint": 415
  },
  {
    "name": "4.30 hours",
    "image": "recovery",
    "session": 91,
    "distance": 980,
    "timeMin": 2.5,
    "timeMax": 7,
    "distancePerWeek": 37,
    "info": "adidas Stockholm Marathon - 4.30 hours\n\nHere you will find the program for the adidas Stockholm Marathon 2024 with the goal of running the race in around 4.5 hours.\n\nTo keep up with the 4.30 program, it is good if you have basic fitness from running or from some other form of exercise\n\nIt is good if you have run before, but not necessary if you already know that you can run shorter distances immediately.\n\nBefore the start of the program, you are welcome to start your run so that you can naturally run 4-8 km continuously at a leisurely pace when the program starts.\n\nThe program's basic speed for easy distance and long runs is 6.30-6.40 minutes per km. It is good but not necessary if your naturally calm running speed is in or close to this speed range.\n\nIf the 4.30 hour goal is to be realistic, it is good if you can do around 60 minutes on a fast 10 km run. During the course of the program, it is good if you can work 10 km time down to around 57-58 minutes if you want to meet the 4.30 time target.\n\nIf you have a slower time target than 4.30 then adapt the speed to your capacity, and then you can also remove some sessions sometimes when the body needs calmer than what the program indicates.\n\nThe program mostly has 3 training sessions a week, but some weeks there are extra sessions for those who want and have time. The weekly average per km turns out to be 37 km in 26 weeks, but don't let this scare you because it is above all the long runs a bit into the program that pull this average up.\n\nYou can modify the program if you have other training than that included in the program and meet the goal of 4.30 hours by following the program two basic sessions which are preferably on Thursday and Sunday supplemented with your \"own training\" of at least 1 session a week.\n\nIf you have a good training base, you can jump into the program later and use the last months' setup to sharpen your marathon form and meet the 4.30 goal.",
    "endPoint": 430
  },
  {
    "name": "5.00 hours",
    "image": "base",
    "session": 88,
    "distance": 850,
    "timeMin": 2,
    "timeMax": 7,
    "distancePerWeek": 32,
    "info": "adidas Stockholm Marathon - 5.00 hours\n\nHere you will find the program for the adidas Stockholm Marathon 2024 with the goal of running the race in around 5 hours.\n\nTo keep up with the 5.00 program, you don't need to have run far or much before, but can be a beginner in running but already know that you can manage to train a few sessions a week in some form. Of course, you can also already be used to running training, but now want a plan that inspires and provides guidance for structured marathon training.\n\nThe program begins with a few sessions where we mix running with walking, but relatively soon we only run continuous training, so if you have the opportunity, you are welcome to start your training with walking/running before the start of the program.\n\nIf you manage 5 km continuously at your leisurely pace, you can jump straight into the program.\n\nThe program's basic speed for easy distance and long runs is 6.50-7.10 minutes per km. It is good but not necessary if your naturally calm running speed is in or close to this speed range.\n\nIf the 5.00 hour goal is to be realistic, it is good if you can do around 65-67 minutes on a fast 10 km run. During the course of the program, the goal is that we can work 10 km time down to around 63-64 minutes if you want to meet the five hour goal.\n\nIf you have a slower time target than 5.00 then adjust the speed to your capacity, and then you can also remove some sessions sometimes when the body needs calmer than what the program indicates and also add more time to the long sessions in particular.\n\nThe program mostly has 3 training sessions a week, but some weeks there are extra sessions for those who want and have time. But 3 sessions are enough.\n\nYou can modify the program if you have other training than that included in the program and complete the goal in five hours by following the program two basic sessions which are preferably on Thursday and Sunday supplemented with your \"personal training\" of at least 1 session a week.\n\nIf you have a good training base, you can jump into the program later and use the last months' setup to sharpen your marathon form and meet the 5.00 goal.",
    "endPoint": 500
  },
  {
    "name": "6.00 hours",
    "image": "after",
    "session": 80,
    "distance": 679,
    "timeMin": 2,
    "timeMax": 7,
    "distancePerWeek": 28,
    "info": "adidas Stockholm Marathon - 6.00 hours\n\nThis program is for those who are beginners in long-distance running, and whose ambition is to get around the adidas Stockholm Marathon without time requirements. It is good if you already have some basic fitness through some form of training or are used to, for example, regular active walks.\n\nYou should ideally follow the program from the start if you have not run at all before so that you build up gently with running interspersed with walking. If you already have a certain running background, you can jump into the program even after the program has started.\n\nYou should preferably have time to train 2-3 sessions a week, and if you want and have the opportunity, the program will also have 4 sessions a week when we have laid a good foundation and we want extra training for the upcoming marathon.\n\nYou can modify the program if you have different training in your everyday life than that included in the program and manage to get around the marathon by following the program's long sessions on Sundays supplemented with one of the other running sessions of the week and then at least 1 session of your \"own training\".\n\nTraining speed is individual, and you must adapt your running speed to what feels natural to you. The program calculates at 7.00-7.30 min/km on the foundational distance run and on the long run. However, the average speed for you to complete the marathon's maximum time is 8.30 min/km, but we expect that you will mix both running and walking during the marathon.\n\nThe goal of this program is not for you to run the whole way, but to get around 42 km in a safe and good way.",
    "endPoint": 600
  }
]
