[
  {
    "weekDay": "Monday",
    "type": "Rest Day",
    "image": "rest",
    "description": "Real volume week with four training sessions for those who feel it works; with that, we can reach a magical 50 km in total in one week!\n\nThe long session continues to increase, and now we are up to about a \"half race\" and we are still not even halfway into the program; so you're good for that!!\n\nNew in this week's training are Thursday's long intervals. Drive that run by feel. If the weather, surface or your body is not 100%, you have to remember not to look too much at direction, but start from your feeling. A tough session, but you shouldn't be completely exhausted. The whole is more important than individual runes!"
  },
  {
    "weekDay": "Tuesday",
    "type": "Pace Run",
    "image": "pace",
    "distance": 11,
    "time": 108,
    "description": "Slightly longer distance sessions which, after a short warm-up, should be the marathon speed for the program's time goal. (or your time goal). Long session overall, but hopefully not a session where you are completely exhausted (because you shouldn't be) so you have the strength to supplement with strength, if you don't have your own strength.",
    "details": [
      {
        "name": "Warm Up",
        "distance": 1,
        "time": 6
      },
      {
        "name": "Dynamic Movement",
        "time": 5
      },
      {
        "name": "Marathon Pace Run",
        "distance": 9,
        "timeMin": 50,
        "timeMax": 52
      },
      {
        "name": "Cool Down",
        "distance": 1,
        "time": 6
      },
      {
        "name": "Strength Training",
        "timeMin": 15,
        "timeMax": 30
      },
      {
        "name": "Stretching",
        "time": 10
      }
    ]
  },
  {
    "weekDay": "Wednesday",
    "type": "Rest Day",
    "image": "rest"
  },
  {
    "weekDay": "Thursday",
    "type": "Interval Run",
    "image": "interval",
    "distance": 8.8,
    "time": 65,
    "description": "Today, the idea is that we will run long intervals. We warm up as usual with calm distance speed, easy mobility and coordination runs before the start of the interval. You then run on relatively flat ground either a measured distance of 800 meters or the time indicated on the watch or based on the watch's distance meter. The goal is to have clearly higher speed than during your distance running, and it should be a relatively tough session. It's important that you don't run too fast in the first intervals, because then it will easily become an inharmonious session with lactic acid in the legs right from the start. Start in time, and aim for the last intervals to be your fastest. We aim to complete a full 6 intervals, if it feels too much, take one or two intervals less. Rest 1 minute stationary between each interval. So the training in short; 6x800 meters or 6 x 3.45 with 1 minute rest. (guideline speed Around 4.45 min/km) We will increase the speed slightly on the intervals later in the program. Wind down with a leisurely run and then finish with a good stretch for the running muscles. The goal is to have clearly higher speed than during your distance running, and it should be a relatively tough session. It's important that you don't run too fast in the first intervals, because then it will easily become an inharmonious session with lactic acid in the legs right from the start. Start in time, and aim for the last intervals to be your fastest. We aim to complete a full 6 intervals, if it feels too much, take one or two intervals less. Rest 1 minute stationary between each interval. So the training in short; 6x800 meters or 5x3.45 with 1 minute rest. (guideline speed Around 4.45 min/km) We will increase the speed slightly on the intervals later in the program. Wind down with a leisurely run and then finish with a good stretch for the running muscles.",
    "details": [
      {
        "name": "Warm Up",
        "distance": 2,
        "timeMin": 11,
        "timeMax": 12
      },
      {
        "name": "Dynamic Movement",
        "time": 5
      },
      {
        "name": "Coordination Run",
        "distanceInfo": "2 x 80m",
        "time": 3
      },
      {
        "name": "Interval Run",
        "style": "Long interval",
        "distanceInfo": "6 x 800m",
        "time": 28
      },
      {
        "name": "Cool Down",
        "distance": 2,
        "time": 12
      },
      {
        "name": "Stretching",
        "time": 5
      }
    ]
  },
  {
    "weekDay": "Friday",
    "type": "Rest Day",
    "image": "rest"
  },
  {
    "weekDay": "Saturday",
    "type": "Easy Run",
    "image": "easy",
    "distance": 7,
    "time": 46,
    "description": "Light extra distance for a little more volume in your volume week and to get a really good muscular training effect on the weekend session.\n\nIf 4 sessions a week are too much, this is the session you remove, the same if you are tired. Then you rest today and focus on a good 23 km session tomorrow.",
    "details": [
      {
        "name": "Easy Run",
        "distance": 7,
        "timeMin": 40,
        "timeMax": 41
      },
      {
        "name": "Dynamic Movement",
        "time": 5
      }
    ]
  },
  {
    "weekDay": "Sunday",
    "type": "Long Run",
    "image": "long",
    "distance": 22,
    "time": 147,
    "description": "We increase the long run by 1 km. Take your leisurely pace, and walk or jog as you drink after about every 20 minutes. Stretch lightly after the session. If you are tired from the recent training, you can shorten it somewhat, but try to be out for at least 1 hour and 45 minutes and take a slightly slower pace instead.",
    "details": [
      {
        "name": "Long Run",
        "distance": 22,
        "timeMin": 130,
        "timeMax": 137
      },
      {
        "name": "Dynamic Stretch",
        "timeMin": 5,
        "timeMax": 10
      }
    ]
  }
]
