[
  {
    "id": 1,
    "session": 5,
    "goal": 57,
    "plan": "This week we start our training for the Stockholm Marathon.\n\nStart-up week in the four-hour program where we show a slightly tougher start with both short long runs directly and a distance run supplemented with some easy speed runs called coordination runs.\n\nBecause the program doesn't know how your training autumn looks like, the start can be a bit tough if it is the case that the start of the program is also the start of your running. If you feel that you have not practiced running before, start a little more calmly than indicated by running a little shorter on the Sunday session.\n\nThe basic speed of the program for easy distances is 5.40-5.50 min/km and is based on your goal of 4 hours. We simply run the distance almost at your marathon race pace.\n\nBut the pace is very individual, so your leisurely pace may not be at all on the program's leisurely distance pace of 5.40 min to 5.50 min per km, but it may be at 5.30 or 6.00 minutes per km so that the leisurely distance is calm and the running feels natural.\n\nTAKE YOUR leisurely pace and start from it in the program and follow the km instructions, thus modifying the time to your time over the distance.\n\nI hope the week is working well, and this feels like a fitting start to our 26 weeks together!"
  },
  {
    "id": 2,
    "session": 5,
    "goal": 60.3,
    "plan": "The training has started and we continue with 3 training sessions this week as well, but develop the training by adding a \"general strength session\" in connection with Tuesday's run.\n\nRegarding the strength, it is a session that will return regularly every week. Running is a bit one-sided, and partly to improve our performance during running and partly to prevent wear and tear injuries, it is good to have a general strength session every week to \"balance up\" the body's muscle groups.\n\nDo you have natural strength through something other own session in the week, you can count it \"as your strength\" and remove the program's strength.\n\nDeveloping the training, we also do it on Thursday where the goal is for you to run a threshold session. Comfortable fast running, slightly faster than your distance; but don't push even though we divide 30 minutes into 10 interval parts. So NOT intervals, but just a few notches faster than your distance pace with regular rest. So an EASY run :)\n\nWe add 1 km to the long run, so the target there is 18 km at your leisurely pace. But shorten this if it feels too mastic for you in your start-up!"
  },
  {
    "id": 3,
    "session": 4,
    "goal": 54,
    "plan": "Christmas week, but the program and your training roll on. - As usual, we start with distance and strength and then it will be threshold Thursday where the threshold develops a little bit. On Christmas Eve there is a chance for the \"best\" (well, almost anyway) Christmas present with a nice slightly longer morning jog. Finally, the Christmas week is rounded off with a long session with step activation if your winter conditions and temperature allow. Overall; adapt the arrangement here to your particular Christmas week and your mood"
  },
  {
    "id": 4,
    "session": 5,
    "goal": 52,
    "plan": "New Year's week where we break off everything \"long\" with a few short foundation building intervals. Then usual threshold Thursday followed by a quiet voluntary New Year's jog.\n\n(Are you running a New Year's race? yes, then you just remove the program's threshold run and run your race instead)\n\nOn New Year's Day, the long run continues and there we now start to be out for a really long time ; so make sure to be careful with energy and fluids in immediately after the workout and wear dry clothes. Then we fight all germs and optimize so that the recovery can start immediately!\n\n(Ok remove the New Year's long run if it doesn't work on your New Year's weekend!)​"
  },
  {
    "id": 5,
    "session": 4,
    "goal": 62,
    "plan": "The first week of new year and of course we are training as before precisely so that the new year will be a really good running year!\n\nNo news really but you recognize yourself; continuity is the watchword and for continuity both calmer and tougher are important. So this week a calm start followed by good threshold and long run again."
  },
  {
    "id": 6,
    "session": 5,
    "goal": 63,
    "plan": "A good week in terms of quantity and quality. The speed consists of basic building 200 meter intervals on feel and on the Thursday session you will work a little longer in your intended marathon. Instead of running a long Round at our long-run pace, we will accumulate long-run volume through different threshold sections. The goal is for the session to give the volume we had on the long session last week, but now split up but in return at a higher speed. This is a long-run variant that is in the setup of many elite runners, and which we are now testing here as well. The goal is that you will work on your oxygen uptake (fitness) in a gentle way, while you both physically and mentally train to hold on for a long time at a higher speed than long run pace. Keep in mind that all sessions outside must be adapted to the winter that prevails in your area. Dare to adapt if necessary so that the load is not too hard!​"
  },
  {
    "id": 7,
    "session": 4,
    "goal": 54,
    "plan": "The beginning of the week should be really calm, and the fartlek in particular is a good session to have in a week that should be calmer because your feeling and your body completely control how hard or how calm the session will be. But keep in mind that Monday to Saturday should be \"recovery\" but still maintain everything we built! Listen to your body, because programs unfortunately don't know how it feels to you. Keep in mind that a quiet week is now followed by tough training in the coming weeks!"
  },
  {
    "id": 8,
    "session": 5,
    "goal": 74,
    "plan": "Good three-session week where our short intervals return so that you can work with a different step than at distance/threshold and so that you can work a little on your fitness development. 12 x 200 meters straight will be this week's speed session.\n\nBut before that we run distance and strength on Tuesday and then we work up the long session to a half marathon on Sunday!\n\nSo really long on Sunday, but at exactly your leisurely long session pace. Hope everything feels good and you are charged for a new step in your training."
  },
  {
    "id": 9,
    "session": 4,
    "goal": 55,
    "plan": "Tough week again! Hope everything feels good, because the idea is now that we will take the next step in the training ladder and get around 40 km a week to be normal weeks, or at least almost normal weeks.\n\nProgressive or increased distance and strength as the start of the week. Then on Thursday we lighten up the pace with an interval ladder. Then there will be speed elements and step change even in the long session if the winter permits."
  },
  {
    "id": 10,
    "session": 5,
    "goal": 74,
    "plan": "Real volume week with four training sessions for those who feel it works; with that, we can reach a magical 50 km in total in one week!\n\nThe long session continues to increase, and now we are up to about a \"half race\" and we are still not even halfway into the program; so you're good for that!!\n\nNew in this week's training are Thursday's long intervals. Drive that run by feel. If the weather, surface or your body is not 100%, you have to remember not to look too much at direction, but start from your feeling. A tough session, but you shouldn't be completely exhausted. The whole is more important than individual runes!"
  },
  {
    "id": 11,
    "session": 5,
    "goal": 71,
    "plan": "This week is meant to be a slightly easier week, but I don't really know if almost 40 km is easier? Well now that's it!! So make sure that the first session of the week is really calm and adjust the threshold session according to how you feel in general and of course according to external circumstances. Sunday's long run is what pulls up the week's volume, as the run now stretches out to a full 24 km. If you fix it at a leisurely pace, I think you are well suited to the training plan for the Asics Stockholm Marathon! But if you are tired, shorten the threshold to 2 x 10 min or the long session to Around 20 km."
  },
  {
    "id": 12,
    "session": 5,
    "goal": 70,
    "plan": "We pulse up again to a very considerable amount and good training!! Introduction with the \"maradistan session\" and then on Thursday we start your and the program's hill running with running training in the warm-up!!\n\nIf the winter surface does not allow hill running/running training, then you convert the session into some fartlek. If you run the hill on a treadmill (which is perfectly fine), you can add the running training to another session that you run outside. (Tuesday or Saturday, because it's difficult to do running training on a treadmill)\n\nHope you find the right one, and don't be \"frightened\" by the slope. You will get tired, but certainly not exhausted. The hill gives the best effect if you run just right in the early period we are in now!! If you do everything on that run, it is easy to burn both the psyche and also physically. See the training as a big whole, and then no individual sessions must be too tough!\n\nOn Sunday, there will be an adjustment in the program with a brand new session that the coach calls marathon tweezers. The target image is that the session should provide long-distance volume, but that you collect the volume via 16 x 1 km at a slightly faster pace than your planned average speed on the marathon.\n\nThe goal of the session is that you will work on your oxygen uptake (fitness) in a gentle way at the same time that you are both physically and mentally training to hold on for a long time at a higher speed than a long session pace."
  },
  {
    "id": 13,
    "session": 4,
    "goal": 51,
    "plan": "Now we are almost halfway through the program towards the marathon. Hope everything feels ok, because here comes another tough week. TWO qualitative sessions and a record long session. If you are tired, you remove the Saturday session and if we are going to prioritize one of the quality sessions, this week will be the threshold session if you had a slope last week. If you remove the hill, make sure the running training is kept alive during one of the other sessions."
  },
  {
    "id": 14,
    "session": 5,
    "goal": 67,
    "plan": "5 sessions a week, which should be slightly easier, even if the amount is still good. \n\nHill and marathon this week and then the long run continues to a full 26 km now; assuming everything feels good to you. \n\nSo a very good week, even if for some of you it probably feels like a little bit.​"
  },
  {
    "id": 15,
    "session": 5,
    "goal": 80,
    "plan": "A somewhat adequate week, with 3-4 sessions depending on whether you want to go out for a quiet round on Saturday.\n\nWe start the week calmly with distance. On Thursday, there will be a threshold divided into 1 km sections and then we round off the week with a long long session again.\n\nIn the long session, add a speed increase part if everything feels good. Hopefully in some spring weather!"
  },
  {
    "id": 16,
    "session": 5,
    "goal": 70,
    "plan": "New week and new challenges, where the weekend will be really tough if you run according to the program to the fullest.\n\nCombining a fast distance (all Competition/Premiärmilen) with a long session the next day is tough and actually a bit \"over course\".\n\nSo don't hesitate to modify the plan, shorten Sunday's long session to around 70-90 minutes, you drive hard on Saturday. Tune in with both the feeling in your body and how you feel mentally about the challenge.\n\nIf the coach is to guide the weekend's setup a bit, it will be:\n\n1. Everything feels great and you are not tired; yes, test the program's layout!\n\n2. Have you driven well with long sessions during the year; yes then you can focus on fast distance/races and then take Sunday as it comes with rest or shorter long sessions.\n\n3. If you haven't gotten in as many long runs so far this year, then you prioritize running long distances for the weekend. Same if you like to really have regular long sessions; then of course you choose to run long this weekend as well!\n\nBut the training week doesn't just consist of the weekend, but work as well as you can in the week leading up to the weekend, and hopefully with a little spring in the air!"
  },
  {
    "id": 17,
    "session": 4,
    "goal": 60,
    "plan": "Hope the training goes smoothly and that it is now facilitated by the fact that it is a little spring!!\n\nA varied week in terms of training, as the coach includes, among other things, a hill run with different lengths where you can work with different speeds and range of motion in your run based on the length of the hill . Thursday features foundational short intervals where you run your for-the-season comfortably fast pace; whatever you do will be a good transition to everything else.\n\nFind your flow; and DO NOT push HARD on the short intervals.\n\nSunday the long session rolls on as usual and now with 28 km as the target; at your leisurely pace!"
  },
  {
    "id": 18,
    "session": 5,
    "goal": 78.5,
    "plan": "Tough week again, even if it is limited to 3 training sessions. However, the beginning of the week should be relatively easy, with the marathon session which, although it adds volume, should not be too tiring. The intervals can be a tough session, but remember not to go too hard there at the beginning.\n\nAt the weekend, the session returns with \"marathon tweeners\" where the target image is a full 18 x 1 km. If it feels too tough, then you can convert the session into a regular long session at your basic speed and aim to run 23-25 km in total."
  },
  {
    "id": 19,
    "session": 5,
    "goal": 81,
    "plan": "A slightly calmer start to the week may be needed, so take a maximum of 6 km there so you can bring home all the training done and to come. Because the rest of the week and the coming weeks are tough. Be responsive and remove/lighten trainings if you need to. The fast distance is long; and tough and late for the weekend, you skip the short downhill section if you are tired. More important to get the long run."
  },
  {
    "id": 20,
    "session": 5,
    "goal": 71,
    "plan": "A week where we focus on Thursday's interval training and then a slightly shorter long training session for the weekend to keep the long training feeling going and at the same time give the body a chance to absorb all the tough training - and be ready for the last really tough weeks of the program including our two longest training sessions. So shorter now - to be able to gear up a notch to later.\n\nAre you running the Premier Half on Saturday?, well then you change the week and skip the long session and take the race as your tough training this weekend!\n\nThursday's speed session would you be able to sleep on Tuesday, then you just go for a leisurely jog on Thursday before the race!"
  },
  {
    "id": 21,
    "session": 3,
    "goal": 45,
    "plan": "The training program continues, and if you are tired from the recent tough training, it may be time to \"pulse down this week\".\n\nTo make the week a little easier, you can remove or shorten sessions and then hopefully you are then both keen on and receptive to a really long session on Sunday - a session that is the week's focus session provided you are not \"too tired\".\n\nIf everything goes smoothly, then you can drive, of course you can drive the week in full; and then a good back run can be suitable for both running strength, running technique and cardio training!"
  },
  {
    "id": 22,
    "session": 4,
    "goal": 41,
    "plan": "Intermediate week with speed and recovery long session.\n\nFocus on giving the body a slightly calmer training and getting in short intervals (without speed that risks any damage). The feeling of long workouts is of course good to maintain - but the coach intends to make it shorter this year so you can recharge for the following week's longest long workouts​"
  },
  {
    "id": 23,
    "session": 4,
    "goal": 61,
    "plan": "A good week with a really tough finish. The goal is to squeeze in a 34 km round for the weekend.\n\n- Good for many mentally to take with you, but if you have done a good long session before, you absolutely do not stand and fall with Sunday's session, but if you are tired, it is completely ok to shorten. You can also skip Saturday's session if you want and feel it is necessary to work towards + 30k the next day.\n\nOther than that, we work with a little speed this week through Thursday's short hill and a marathon session as an introduction which you can shorten to 5-8 km if 10 km feels long just for the day."
  },
  {
    "id": 24,
    "session": 3,
    "goal": 39,
    "plan": "Now begins our tapering off for this year's ASICS Stockholm Marathon.\n\nNow it is more about starting to find flow and the rhythm than \"moving forward\" so much on the individual sessions.\n\nHave you managed to follow the program broadly, I think you're doing well and now you're making a lot of money by starting to reduce your training.\n\nStarting with some much-needed quiet days, after last week's tough overall and tough long sessions. If you want, you can shorten the Tuesday session to an even shorter leisurely jog.\n\nThis week's tough session will be the fast distance. There you can go hard if everything feels ok.\n\nLong session at a leisurely pace, but for those who feel that the body has responded well to recent training, you can add a good increase in speed to the session.\n\nLast chance also to in the long session moment try maran's sports drink. -So you haven't done it before; test now and see if it works; also applies to shoes and clothes. Try out what you'll wear on the maran!\n\nGood luck with the week!"
  },
  {
    "id": 25,
    "session": 4,
    "goal": 23.9,
    "plan": "One more step down in volume to give the body even more chance to create a top shape. Two of this week's sessions contain good quality aspects for the form.\n\nOxygen uptake, endurance at high speed and flow via short intervals on Thursday. Flexible and running technique via the hill and some short marathon flow there as well in the week's final session.\n\nTo keep the feeling going, we add two lighter distance sessions, where you can easily remove the Saturday session if you know that running rest usually gives a good effect directly to light legs. But if you feel; ok to jog on... Mentally; slowly begin to look forward to the goals of the entire training plan. Only one week away!!\n\nGood luck with the week, it's getting close!!"
  },
  {
    "id": 26,
    "session": 4,
    "goal": 59.1,
    "plan": "This week's training is completely aimed at optimizing you mentally and physically for Saturday. A few float intervals and easy entertaining distance. Both the intervals and Wednesday's distance workout can be included as a whole in your carbohydrate load. Carbohydrate loading may look a little different. The simplest is to \"just\" from Wednesday eat and drink extra carbohydrate-rich food/liquid up to and including Friday. A slightly more \"advanced\" variant is to lightly empty the body of carbohydrates on Tuesday and Wednesday morning before the actual storage starts on Wednesday. - It happens that on Tuesday you change your diet to include some carbohydrates (eat salad, protein and fat instead) while doing your interval training. The idea is then that the muscles are emptied of carbohydrates, and then you start Wednesday with a run before breakfast (morning jog) which also \"empties\". One theory is that the emptied muscles react to the emptying by being able to store some extra energy. I think the emptying itself also has a mental aspect by telling the body that you are approaching something special; MARAN! - After the Wednesday session, your charging starts by now starting to redirect your diet to contain a lot of carbohydrates. Eat a little extra at each meal, but don't overeat. Supplement with extra snacks on Wednesday, Thursday and Friday and treat yourself to some good carbohydrate content! Also supplement the \"eating\" with drinking all the time so that the extra energy can be stored in your muscles. Charging takes place on Wednesday, Thursday and Friday, then well on the day of the competition you must be fully charged. NOTE; do not drain if you have a cold or feel sensitive; then you just run the charging and don't risk getting sick because the emptying initially makes you more susceptible to bacteria etc) If you were able to follow the training plan decently, you should take with you that you are WELL prepared. - Good luck with the week and then of course with the race!! /coach Szalkai"
  }
]
