[
  {
    "weekDay": "Monday",
    "type": "Rest Day",
    "image": "rest",
    "description": "Now begins our tapering off for this year's ASICS Stockholm Marathon.\n\nNow it is more about starting to find flow and the rhythm than \"moving forward\" so much on the individual sessions.\n\nHave you managed to follow the program broadly, I think you're doing well and now you're making a lot of money by starting to reduce your training.\n\nStarting with some much-needed quiet days, after last week's tough overall and tough long sessions. If you want, you can shorten the Tuesday session to an even shorter leisurely jog.\n\nThis week's tough session will be the fast distance. There you can go hard if everything feels ok.\n\nLong session at a leisurely pace, but for those who feel that the body has responded well to recent training, you can add a good increase in speed to the session.\n\nLast chance also to in the long session moment try maran's sports drink. -So you haven't done it before; test now and see if it works; also applies to shoes and clothes. Try out what you'll wear on the maran!\n\nGood luck with the week!"
  },
  {
    "weekDay": "Tuesday",
    "type": "Morning Run",
    "image": "morning",
    "distance": 16,
    "time": 113,
    "description": "Calm distance of approx. 8 km to just keep feeling and volume in the training. Keep in mind that the end of the week will be tough, so a calm \"entertaining¨\" start to the week is good enough.",
    "details": [
      {
        "name": "Morning Run",
        "distance": 8,
        "timeMin": 38,
        "timeMax": 41
      },
      {
        "name": "Stretching",
        "time": 5
      },
      {
        "name": "Warm Up",
        "distance": 3,
        "timeMin": 14,
        "timeMax": 15
      },
      {
        "name": "Dynamic Movement",
        "time": 5
      },
      {
        "name": "Running Technique",
        "info": "2 x 30m"
      },
      {
        "name": "Short Hill Run",
        "info": "10 x 100m"
      },
      {
        "name": "Cool Down",
        "distance": 3,
        "time": 15
      },
      {
        "name": "Stretching",
        "timeMin": 5,
        "timeMax": 10
      }
    ]
  },
  {
    "weekDay": "Wednesday",
    "type": "Rest Day",
    "image": "rest"
  },
  {
    "weekDay": "Thursday",
    "type": "Fast Run",
    "image": "fast",
    "distance": 13,
    "time": 76,
    "description": "Fast distance of 8 km. It can be a tough, really tough session, but with a focus on fluidity in running. If you feel more like threshold speed, choose it. Marathon speed can also be enough...Let the day's form decide and keep in mind that we save the last bit to pick out the body for the marathon.\n\nThose of you who are part of TSM Running can run the fast distance on the \"Milspåret\", either 5 or 10 km which is the official test run for TSM Running.",
    "details": [
      {
        "name": "Warm up",
        "distance": 3,
        "timeMin": 14,
        "timeMax": 15
      },
      {
        "name": "Dynamic Movement",
        "time": 5
      },
      {
        "name": "Coordination Run",
        "info": "2 x 80m"
      },
      {
        "name": "Fast Distance Run",
        "distance": 8,
        "timeMin": 31,
        "timeMax": 33
      },
      {
        "name": "Cool Down",
        "distance": 2,
        "timeMin": 9,
        "timeMax": 10
      },
      {
        "name": "Stretching",
        "timeMin": 5,
        "timeMax": 10
      }
    ]
  },
  {
    "weekDay": "Friday",
    "type": "Easy Run",
    "image": "easy",
    "distance": 5,
    "time": 65,
    "description": "Easy distance and last strength fully; next week there will be less strength in your deceleration in terms of training and escalation in terms of form towards the marathon.",
    "details": [
      {
        "name": "Easy run",
        "distance": 5,
        "timeMin": 23,
        "timeMax": 25
      },
      {
        "name": "Strength Training",
        "timeMin": 15,
        "timeMax": 30
      },
      {
        "name": "Stretching",
        "timeMin": 5,
        "timeMax": 10
      }
    ]
  },
  {
    "weekDay": "Saturday",
    "type": "Rest Day",
    "image": "rest"
  },
  {
    "weekDay": "Sunday",
    "type": "Long Run",
    "image": "long",
    "distance": 26,
    "time": 156,
    "description": "The program's and perhaps your last long run before the marathon, will be a 24 km run at mostly calm long run speed. During a section over about 4 km, you can increase your speed to well below your intended marathon race speed to get a final test and push your long-run motor!\n\nEnter your speed increase after about 60 minutes of running and try to run faster for about 22 minutes . Finish image at a speed of around 5.30 min/km.\n\nIf you are tired and your body is not responding; run calmly all the way through.\n\nAs always important drink, and energy and more fluids even afterwards for good and important recovery!\n\nRegarding if this is your last long session before the marathon, you can actually if you missed many long sessions, put in a short leisurely long session with a week to go before the race instead of specified training. (Then removes Sunday's schedule where it is in the program).",
    "details": [
      {
        "name": "Progressive long run",
        "distance": 26,
        "timeMin": 116,
        "timeMax": 126
      },
      {
        "name": "Stretching",
        "timeMin": 5,
        "timeMax": 10
      }
    ]
  }
]
