[
  {
    "weekDay": "Monday",
    "type": "Rest Day",
    "image": "rest",
    "description": "This week's training is completely aimed at optimizing you mentally and physically for Saturday. A few float intervals and easy entertaining distance. Both the intervals and Wednesday's distance workout can be included as a whole in your carbohydrate load. Carbohydrate loading may look a little different. The simplest is to \"just\" from Wednesday eat and drink extra carbohydrate-rich food/liquid up to and including Friday. A slightly more \"advanced\" variant is to lightly empty the body of carbohydrates on Tuesday and Wednesday morning before the actual storage starts on Wednesday. - It happens that on Tuesday you change your diet to include some carbohydrates (eat salad, protein and fat instead) while doing your interval training. The idea is then that the muscles are emptied of carbohydrates, and then you start Wednesday with a run before breakfast (morning jog) which also \"empties\". One theory is that the emptied muscles react to the emptying by being able to store some extra energy. I think the emptying itself also has a mental aspect by telling the body that you are approaching something special; MARAN! - After the Wednesday session, your charging starts by now starting to redirect your diet to contain a lot of carbohydrates. Eat a little extra at each meal, but don't overeat. Supplement with extra snacks on Wednesday, Thursday and Friday and treat yourself to some good carbohydrate content! Also supplement the \"eating\" with drinking all the time so that the extra energy can be stored in your muscles. Charging takes place on Wednesday, Thursday and Friday, then well on the day of the competition you must be fully charged. NOTE; do not drain if you have a cold or feel sensitive; then you just run the charging and don't risk getting sick because the emptying initially makes you more susceptible to bacteria etc) If you were able to follow the training plan decently, you should take with you that you are WELL prepared. - Good luck with the week and then of course with the race!! /coach Szalkai"
  },
  {
    "weekDay": "Tuesday",
    "type": "Morning Run",
    "image": "morning",
    "distance": 16.5,
    "time": 106,
    "description": "A final speed session for body and bud. Can feel a bit tough, especially if today you \"walk around\" on a low-carbohydrate diet.\n\nTry to focus on the flow of your run, and run tired, but certainly not too hard. You must have resources saved after the session, you save these for Saturday.\n\nThe purpose of the session is to maintain the feeling of running and that the intervals give the body both muscularly and centrally (heart lungs) a good \"entertaining effect\".\n\nThe session then; Two series with 4 200m or 45 second intervals. 2x4x200m or 2x4x45-50 seconds. The rest is 45 seconds between the intervals and 90 seconds after the 4th interval.\n\nEasy, easy running training in your warm-up, with low skip, medium high skip and heel kick.\n\nIt is important that you cool down calmly, and stretch out the muscles.",
    "details": [
      {
        "name": "Morning Run",
        "distance": 8,
        "timeMin": 38,
        "timeMax": 41
      },
      {
        "name": "Stretching",
        "time": 5
      },
      {
        "name": "Warm Up",
        "distance": 3,
        "timeMin": 14,
        "timeMax": 15
      },
      {
        "name": "Dynamic Movement",
        "time": 5
      },
      {
        "name": "Coordination Run",
        "info": "2 x 80m"
      },
      {
        "name": "Interval Run",
        "info": "8 x 300m"
      },
      {
        "name": "Cool Down",
        "distance": 2.5,
        "time": 12
      },
      {
        "name": "Stretching",
        "timeMin": 5,
        "timeMax": 10
      }
    ]
  },
  {
    "weekDay": "Wednesday",
    "type": "Morning Run",
    "image": "morning",
    "distance": 15,
    "time": 81,
    "description": "Easy distance running 9km today, or if you follow the carbohydrate-loading scheme a \"morning jog\" of 9km. If you've never run before breakfast before and are trying it now, remember to take it really easy before you warm up your muscles and get started. It's perfectly fine to run the session later in the day, and then start your carbohydrate load towards the marathon!",
    "details": [
      {
        "name": "Morning Run",
        "distance": 15,
        "timeMin": 73,
        "timeMax": 76
      },
      {
        "name": "Stretching",
        "time": 5
      }
    ]
  },
  {
    "weekDay": "Thursday",
    "type": "Rest Day",
    "image": "rest"
  },
  {
    "weekDay": "Friday",
    "type": "Easy Run",
    "image": "easy",
    "distance": 4,
    "time": 28,
    "description": "Light jogging or complete rest. The jog is only for you who feel that the body and the bud need to air out a little. Not so great practical significance more than just for the feeling. You can feel a little heavy from the carbohydrate load and then a short jog can feel good, not least mentally. If you want, you add light mobility and two short movement coordinations at a comfortably fast speed.",
    "details": [
      {
        "name": "Easy Run",
        "distance": 4,
        "timeMin": 19,
        "timeMax": 20
      },
      {
        "name": "Dynamic Movement",
        "time": 5
      },
      {
        "name": "Coordination Run",
        "info": "2 x 80m"
      }
    ]
  },
  {
    "weekDay": "Saturday",
    "type": "Race Day",
    "image": "race",
    "distance": 43.7,
    "time": 196,
    "description": "Now we are at the final goal of the program.\n\nFinally you will get all the training you put in, and I absolutely believe that if you have followed the program properly it will go really well!!\n\nBut it is a tough job that must be done, and you are set for it!\n\nStart 12.00 or 12.10, so I think you eat your usual breakfast, but maybe not with so much fiber if you usually have fiber breakfast. No need for there to be lumps in the stomach!\n\nFeel free to supplement breakfast with some extra carbohydrate.\n\nMaybe a little sports drink including salt in the early morning, especially if it's hot!\n\nThen if you are used to eating close to the long run, you can also take something light extra at 10.00-10.30; then food energy can wait until after/during the race.\n\nMake sure everything is ready, with shoes, number tag etc.\n\nWarm up a little before the start in the place in your starting line or a short jog before entering the starting line. Feel free to drink water until just before the start, then when you're up and running you can take a sport drink if you know it works for your stomach.\n\nThe start goes; do not stress. You'll make it, stress kills energy!\n\nFind your slightly tougher long run pace (or medium hard distance pace), and break the race into smaller sections, both mentally and physically.\n\nBuildings and buddies can be the split or simply every fluid check !\n\nTake the liquid right from the first check.\n\nYOU WILL DO IT if you are whole and healthy and have managed to follow the program reasonably well.\n\nIf you have followed the time decently on the sessions, 3.59 or faster is also within you if they the external conditions for running are OK on the day of the competition.\n\nOf course it is tough, you have to be prepared that it does not come by itself but that you have to work when it takes.\n\nTake help from the audience, fellow competitors and defeat any slumps!! Change step; work extra with your arms if you get into a slump!!\n\nThink positively, and think that now is the time for all the training to \"get out\"!!\n\nSee you at the Stadium.\n\nGOOD LUCK from coach Anders Szalkai.",
    "details": [
      {
        "name": "Warm Up",
        "distance": 1.5,
        "timeMin": 5,
        "timeMax": 10
      },
      {
        "name": "Dynamic Movement",
        "time": 5
      },
      {
        "name": "Coordination Run",
        "info": "1 x 80m"
      },
      {
        "name": "Racing",
        "distance": 42.2,
        "time": 179
      }
    ]
  },
  {
    "weekDay": "Sunday",
    "type": "Easy Run",
    "image": "easy",
    "distance": 3,
    "time": 21,
    "details": [
      {
        "name": "Easy Run",
        "distance": 3,
        "timeMin": 15,
        "timeMax": 16
      },
      {
        "name": "Stretching",
        "time": 5
      }
    ]
  }
]
