[
  {
    "weekDay": "Monday",
    "type": "Rest Day",
    "image": "rest",
    "description": "A somewhat adequate week, with 3-4 sessions depending on whether you want to go out for a quiet round on Saturday.\n\nWe start the week calmly with distance. On Thursday, there will be a threshold divided into 1 km sections and then we round off the week with a long long session again.\n\nIn the long session, add a speed increase part if everything feels good. Hopefully in some spring weather!​"
  },
  {
    "weekDay": "Tuesday",
    "type": "Easy Run",
    "image": "easy",
    "distance": 8,
    "time": 88,
    "description": "Distance adjusted at speed according to how you feel today. No pressured session but a focus on supplementing the run with strength as usual for those of you who follow the program's strength.",
    "details": [
      {
        "name": "Easy Run",
        "distance": 8,
        "timeMin": 46,
        "timeMax": 48
      },
      {
        "name": "Strength Training",
        "timeMin": 15,
        "timeMax": 30
      },
      {
        "name": "Stretching",
        "time": 10
      }
    ]
  },
  {
    "weekDay": "Wednesday",
    "type": "Rest Day",
    "image": "rest"
  },
  {
    "weekDay": "Thursday",
    "type": "Threshold Run",
    "image": "threshold",
    "distance": 12.5,
    "time": 95,
    "description": "Today we return to our threshold session, but today we run a harmonious session divided into 1 km sections. So threshold-thousands simply.\n\nThen what is the difference to 1 km intervals? Well, the speed.\n\nIt shouldn't be a pressured session in terms of speed, but you should float along at a comfortable fast speed.\n\n45 seconds standing or light jogging rest between each \"threshold thumping\".\n\nBefore the threshold start, we run as usual a warm-up with calm warm-up distance, followed by mobility. Short effective running training and pulse-raising coordination.\n\nThen you start the threshold workout. Target image is 7 x 1 km and your target speed will be around 5.10-5.15 min/km at pace. Maybe start a little slower so you find harmony and then at the end you can push a little faster in return.\n\nUnwind with a leisurely jog followed by stretch/mobility.",
    "details": [
      {
        "name": "Warm Up",
        "distance": 2.5,
        "timeMin": 14,
        "timeMax": 15
      },
      {
        "name": "Dynamic Movement",
        "time": 5
      },
      {
        "name": "Running Technique",
        "distanceInfo": "2 x 30m",
        "time": 10
      },
      {
        "name": "Coordination Run",
        "distanceInfo": "1 x 80m"
      },
      {
        "name": "Threshold Run",
        "distanceInfo": "7 x 1 km"
      },
      {
        "name": "Cool Down",
        "distance": 2,
        "time": 12
      },
      {
        "name": "Stretching",
        "timeMin": 5,
        "timeMax": 10
      }
    ]
  },
  {
    "weekDay": "Friday",
    "type": "Rest Day",
    "image": "rest"
  },
  {
    "weekDay": "Saturday",
    "type": "Easy Run",
    "image": "easy",
    "distance": 5,
    "time": 35,
    "description": "This week's extra session. Prioritize the long session tomorrow if you think it will be too tough with two sessions in a row or if you cannot find training time on the weekend for both sessions. But if there is time, the body is ok; run a nice quiet half hour that builds further foundation towards your mara!​",
    "details": [
      {
        "name": "Easy Run",
        "distance": 5,
        "timeMin": 29,
        "timeMax": 30
      },
      {
        "name": "Dynamic Movement",
        "time": 5
      }
    ]
  },
  {
    "weekDay": "Sunday",
    "type": "Long Run",
    "image": "long",
    "distance": 22,
    "time": 146,
    "description": "Today we run a long session with an element of speed again. So no increase in time or kilometer length, but instead the focus is on getting in a speed section. If you already feel from the beginning of the session that it might be tough with speed today, then you skip the long speed section (the km parts) and only run the initial 30-45-60 seconds to change steps in your long session.\n\nStart up the long run at your usual speed and roll on to about half the distance of today's total distance goal. Decide where the speed element is based on where it fits into your round. The speed portion begins with 30 seconds of fast running, 1 minute easy, 45 seconds fast, 1 minute easy, 60 seconds fast and then 2 minutes easy. On these speed parts, the focus is that you should work with good technique and speed up your legs and get your heart rate up a bit. The layout should be your comfortably fast speed and no focus here to have any heading speed. Run with feeling, and run nicely. \n\nCome up to the step and try to run with a proud posture, and you will engage unused muscle power.\n\nAfter 2 minutes of calm basic speed after the 60 second speed increase comes the main speed part where there will be a few kilometer speed parts.\n\nThe speed parts will be 3 km1 km1 km.\n\nGuided speeds:\n\n3 km 5.30-5.35 min/km.\n\n1 km 5.10-5.15 min/km.\n\nBetween each km speed increase part, 2 minutes of calm long-run basic speed or even calmer applies . (If you need to, you can walk a little bit in the 2 minute \"rest part\") On the last speed increase part, you can increase it even harder in the last minute of the km speed part. But not so fast that you risk injury.\n\nAfter finishing the speed part, you take a 3-minute really calm jog or walk where you can take the opportunity to drink. However, do not stop for too long, but then start up again to your usual long-run base speed and then complete the long run so that you reach the day's distance goal.",
    "details": [
      {
        "name": "Long Run",
        "style": "Progressive",
        "distance": 22,
        "timeMin": 130,
        "timeMax": 136
      },
      {
        "name": "Dynamic Stretch",
        "timeMin": 5,
        "timeMax": 10
      }
    ]
  }
]
