[
  {
    "weekDay": "Monday",
    "type": "Rest Day",
    "image": "rest",
    "description": "Tough week again, even if it is limited to 3 training sessions. However, the beginning of the week should be relatively easy, with the marathon session which, although it adds volume, should not be too tiring. The intervals can be a tough session, but remember not to go too hard there at the beginning.\n\nAt the weekend, the session returns with \"marathon tweeners\" where the target image is a full 18 x 1 km. If it feels too tough, then you can convert the session into a regular long session at your basic speed and aim to run 23-25 km in total."
  },
  {
    "weekDay": "Tuesday",
    "type": "Pace Run",
    "image": "pace",
    "distance": 14,
    "time": 81,
    "details": [
      {
        "name": "Easy Run",
        "distance": 1,
        "timeMin": 5,
        "timeMax": 6
      },
      {
        "name": "Coordination Run",
        "distanceInfo": "1 x 80m"
      },
      {
        "name": "Marathon Pace Run",
        "distance": 12,
        "time": 59
      },
      {
        "name": "Cool Down",
        "distance": 1,
        "time": 6
      },
      {
        "name": "Stretching",
        "time": 5
      }
    ]
  },
  {
    "weekDay": "Wednesday",
    "type": "Rest Day",
    "image": "rest"
  },
  {
    "weekDay": "Thursday",
    "type": "Interval Run",
    "image": "interval",
    "distance": 12.1,
    "time": 96,
    "description": "Today we run here with the program a combination interval session with long and short intervals. We will repeat the interval series 2 x 3 minutes followed by 4 x 40 seconds As usual before the speed part of the session you start with a warm-up run. Let the warm-up take you to your inspiring interval stretch. You can run the intervals back and forth on the same distance, but of course you can also \"graze\" the intervals forward on your round. If you want, it is also very good to run the session on the treadmill, and then you can even start from a fixed distance on the intervals and let the time be around 3 minutes on \"your long\" and around 40 seconds on your short intervals. Regardless of where you run the intervals, however, the interval distance should not be too hilly; and there will be a hump; you adjust the speed and do not chase average speed. When you have warmed up with your leisurely run, do some dynamic mobility and preferably also some warm-up and running training exercises. Then you finish the warm-up part with a coordination run/increase run. Then you are ready for the intervals, where you can start from the \"guidelines\" but your feeling is most important and then it is important that you find a good flow in the \"long\" 3 minute intervals while at the same time allowing ourselves some fatigue. In the 40 second intervals, you can dare to step up even more and really work well with your speed. Rest is 1 minute standing/walking between and after the 3 minute intervals and then 40 seconds standing/walking after each 40 second interval. When you have run a full series of 2 x 3 minutes followed by 4 x 40 seconds, you take a series rest of around 1-1.5 minutes. Here you decide how long you need to recharge. The target image here with the program will be the following arrangement: 2 SERIES where each series contains 2 x 3 minutes followed by 4 x 40 seconds. 1 SET of 1 x 3 minutes followed by 2 x 40 seconds. (Total interval time 21:40 min) 3 minute target speed: 4.40 min/km. Gives about 640 meters per interval. 40 second target speed: 4.06 min/km. Gives about 165 meters per interval. Round off with a leisurely downhill jog!",
    "details": [
      {
        "name": "Warm Up",
        "distance": 3,
        "time": 16
      },
      {
        "name": "Dynamic Movement",
        "time": 5
      },
      {
        "name": "Running Technique",
        "distanceInfo": "2 x 30m"
      },
      {
        "name": "Interval Run",
        "style": "Long interval",
        "distanceInfo": "3 x (2 x 730m)",
        "timeInfo": "3 x (2 x 3 min)"
      },
      {
        "name": "Interval Run",
        "style": "Short interval",
        "distanceInfo": "3 x (4 x 185m)",
        "timeInfo": "3 x (4 x 40s)"
      },
      {
        "name": "Cool Down",
        "distance": 2.5,
        "time": 14
      },
      {
        "name": "Stretching",
        "timeMin": 5,
        "timeMax": 10
      }
    ]
  },
  {
    "weekDay": "Friday",
    "type": "Easy Run",
    "image": "easy",
    "distance": 8,
    "time": 78,
    "description": "This week's extra session. Prioritize the long session tomorrow if you think it will be too tough with two sessions in a row or if you cannot find training time on the weekend for both sessions. But if there is time, the body is ok; run a nice quiet half hour that builds further foundation towards your mara!​",
    "details": [
      {
        "name": "Easy Run",
        "distance": 8,
        "timeMin": 42,
        "timeMax": 43
      },
      {
        "name": "Strength Training",
        "timeMin": 15,
        "timeMax": 30
      },
      {
        "name": "Stretching",
        "time": 5
      }
    ]
  },
  {
    "weekDay": "Saturday",
    "type": "Rest Day",
    "image": "rest"
  },
  {
    "weekDay": "Sunday",
    "type": "Long Run",
    "image": "long",
    "distance": 26,
    "time": 158,
    "description": "Today, the session that the coach calls \"marathon thousand\" returns. We had it in the program at the end of February, and now we are running again and also adding two \"Marathon tweens\".\n\nThe run means that you must accumulate long-run volume by running many \"calm\" 1 km intervals. In the long-run volume that is created, we also include a warm-up of 2-3 km and a cool-down of 2-3 km.\n\nSo start the session with a leisurely run for a few kilometers. Stop and do some mobility for your joints/ligaments and running muscles. If you want, you can also include some simple and softening running training exercises. Then you're ready to start your 1 km intervals.\n\nThe goal is to run around 30-40 seconds faster in minutes per kilometer than your normal long run pace.\n\nOptimize your setup by starting the first 1 km intervals a little slower/calmer than the specified \"guide speed\", so that you can then increase the speed a little later and that the last 1 km interval will be the fastest - even though you then have the most volume in your legs.\n\nFor you with a fast 4:00 who time goal is the goal of 18 x 1 km and the target speed after you get started will be around 5:30-5:20 min/km if we start from 6:00 at a long run pace.\n\nThe rest between each \"Maraton tussing\" you take 60 seconds standing /walking rest.\n\nBring drinks out on the run, and maybe even some energy gel. (or anything else you like with energy)\n\nMental; think positively and that you actually get to rest, which you don't get during the long session as regularly as now. Take it one step at a time, and look forward to the feeling you get when you've done 18 reps!\n\nAfter the 18th interval, you exhale before finishing the session with a few kilometers of calm deceleration and finished easy mobility for the running muscles that have had to work!",
    "details": [
      {
        "name": "Warm Up",
        "distanceInfo": "2-3 km",
        "timeInfo": "11-16.5 min"
      },
      {
        "name": "Dynamic Movement",
        "time": 5
      },
      {
        "name": "Marathon Crunch Run",
        "distanceInfo": "20 x 1000 m"
      },
      {
        "name": "Cool Down",
        "distanceInfo": "2-3 km",
        "timeInfo": "11-17 min"
      }
    ]
  }
]
