[
  {
    "weekDay": "Monday",
    "type": "Rest Day",
    "image": "rest",
    "description": "Christmas week, but the program and your training roll on. - As usual, we start with distance and strength and then it will be threshold Thursday where the threshold develops a little bit. On Christmas Eve there is a chance for the \"best\" (well, almost anyway) Christmas present with a nice slightly longer morning jog. Finally, the Christmas week is rounded off with a long session with step activation if your winter conditions and temperature allow. Overall; adapt the arrangement here to your particular Christmas week and your mood​"
  },
  {
    "weekDay": "Tuesday",
    "type": "Pace Run",
    "image": "pace",
    "distance": 9,
    "time": 46,
    "description": "Calm speed and a Round of 6 km followed by the strength of the program if you do not have your own strength in connection with another session in your Training week",
    "details": [
      {
        "name": "Warm Up",
        "distance": 1,
        "timeMin": 5,
        "timeMax": 6
      },
      {
        "name": "Dynamic Movement",
        "time": 5
      },
      {
        "name": "Marathon Pace Run",
        "distance": 7,
        "timeMin": 34,
        "timeMax": 35
      },
      {
        "name": "Cool Down",
        "distance": 1,
        "timeMin": 5,
        "timeMax": 6
      }
    ]
  },
  {
    "weekDay": "Wednesday",
    "type": "Rest Day",
    "image": "rest"
  },
  {
    "weekDay": "Thursday",
    "type": "Threshold Run",
    "image": "threshold",
    "distance": 9,
    "time": 51,
    "description": "Just like last week, the program has a threshold run for you. If you didn't drive the run last week and feel unsure about the layout, go back and check the text there. How the layout will be a little different today compared to last week. Just like then, however, you start with a short distance warm-up and some mobility. If you want, you can also run a light pulse-raising coordination run, but make sure that the warm-up is just a warm-up. The structure of the threshold training today will be threshold runs with a slightly longer running time than last time. Run 6 x 5 minutes, and take a slightly longer jog/walk rest than last time with 45 seconds rest now between each threshold section. A total of 30 minutes threshold time, and target speed if you want it even if your feeling is most important (comfortably tired!) will be like last week Around 5.20-5.25 min/km which gives you Around 5.5 km in total and a little over 900 meters per 5 minute episode. If you don't have a speed indication or you drive by feel 6 x 5 minutes at your comfortable fast speed with a 45 second rest. Relax with a gentle jog and a little stretching, and you have another good basic workout!",
    "details": [
      {
        "name": "Warm Up",
        "distance": 1.5,
        "time": 8
      },
      {
        "name": "Dynamic Movement",
        "time": 5
      },
      {
        "name": "Coordination Run",
        "distanceInfo": "2 x 80m"
      },
      {
        "name": "Threshold Run",
        "distance": 6.5,
        "timeInfo": "6 x 5 min"
      },
      {
        "name": "Cool Down",
        "distance": 1,
        "timeMin": 5,
        "timeMax": 6
      }
    ]
  },
  {
    "weekDay": "Friday",
    "type": "Rest Day",
    "image": "rest"
  },
  {
    "weekDay": "Saturday",
    "type": "Morning Run",
    "image": "morning",
    "distance": 8,
    "time": 80,
    "description": "Voluntary Christmas gift with a morning jog starts Christmas Eve. It's a tradition here in the program. But don't feel pressure, if you don't get your training, you're just done. ...and of course Merry Christmas from Coach Szalkai​",
    "details": [
      {
        "name": "Morning Run",
        "style": "Jogging",
        "distance": 8,
        "timeMin": 42,
        "timeMax": 45
      },
      {
        "name": "Strength Training",
        "timeMin": 15,
        "timeMax": 30
      },
      {
        "name": "Dynamic Stretch",
        "timeMin": 10,
        "timeMax": 15
      }
    ]
  },
  {
    "weekDay": "Sunday",
    "type": "Long Run",
    "image": "long",
    "distance": 20,
    "time": 118,
    "description": "Today a nice Christmas long run with the goal of reaching the same distance length as last week on the long run with the addition of a small speed element to change the step during your long run.\n\nThis of course assumes that you have ok winter surfaces to be able to increase the speed and that the weather in general allows for a slightly higher heart rate and breathing.\n\nRide calmly for around an hour, and then you add 5 x 1 minute speed increases with 1 minute rest between each speed section.\n\nIt is not an interval, but the idea is to you increase the speed in your 1 minute by around 15-20 seconds faster in kilometer speed than the base speed you have on the rest of the session.\n\nIn the calm minute you have between each speed increase, you take a slightly slower speed than you normally have as your base speed on the long run.\n\nAfter the speed section, you return to your base speed and complete today's 18 km distance.\n\nIn addition, you should remember to bring fluids with you during the long run, even if it is winter. For \"short long sessions\" like this, water can be enough, but since we are going to drive a little faster, it can also feel good to get some energy via sports drink.\n\nAlso think about getting energy as soon as possible after the session so you speed up your recovery after the session. Grab a banana or maybe a recovery drink right after your workout.",
    "details": [
      {
        "name": "Long Run",
        "style": "Progressive",
        "distance": 20,
        "timeMin": 106,
        "timeMax": 108
      },
      {
        "name": "Dynamic Stretch",
        "timeMin": 5,
        "timeMax": 10
      }
    ]
  }
]
