[
  {
    "name": "Marathon Training Phase",
    "elements": [
      {
        "title": "Base Building",
        "headline": "Always lay the foundation first.\n\nWhether you are a brand new runner or a veteran returning from a break, all athletes should start their training at the foundational level.\n\nThe base building phase is the time to establish your weekly framework of running. Increase the frequency and distance of your runs during this phase. Get into a routine that is comfortable for you and that you can expand upon in the more demanding phases of training ahead.\n\nVirtually all of your running in the base building phase should be done at comfortable effort levels. Keep your runs easy. If you participate in any faster workouts during this phase they should be kept light, short, and run them by effort only, not for time.\n\nInclude a base building phase at the beginning of every marathon-training season. By laying a strong foundation at the beginning of every training cycle, you set yourself up for the best probability of success.",
        "image": "base"
      },
      {
        "title": "Speed Run",
        "headline": "What is speed development running?\n\nSpeed development running is running performed at a pace significantly faster than your marathon goal race pace. While any mileage covered faster than marathon pace can be considered speed work, speed development happens most rapidly at speeds two to three notches faster than goal pace.\n\nFor marathoners, speed work typically consists of runs performed at 5K to 10K race pace for durations of one to five minutes.\n\nWhy focus on speed development?\n\nEach phase of marathon training focuses on building one aspect of your skillset. After the base building phase, you will feel strong, resilient, and eager for faster running. The speed development phase comes second to capitalize on the foundation you have built over the previous phase.\n\nBy regularly running at racing speeds two to three notches faster than your goal marathon pace, you will rapidly develop your aerobic strength and top-end speed. Your goal marathon pace will feel significantly easier after you have run workouts at a much faster pace over four to six weeks.\n\nDuring the speed development phase, place the most emphasis on your weekly speed workout. This focus will allow you to gain the greatest physiological benefit from the work while giving you the confidence you need to run your marathon at your goal race pace.\n\nWhen you extend the length of your long runs in the next phase, the race-specific quality phase, you will already be fast enough to comfortably handle your goal marathon pace. Because you are fast enough already, you can then simply focus on covering the distance of the runs themselves, rather than having to get faster while simultaneously going further.\n\nSimply put, the purpose of this phase is to get fast before you have to go far.",
        "image": "speed"
      },
      {
        "title": "Race Specific",
        "headline": "What is race-specific running?\n\nRace-specific running is running that best prepares you for the specific demands of your race. To be successful at the marathon, you must develop not only a strong aerobic engine but also build an incredibly resilient skeletal-muscular system that can carry you for 26.2 miles at top speed.\n\nMarathon-specific training includes significant amounts of miles done in environments similar to that you will experience on race day. Conditions you should practice on include: flat vs. hilly routes, trying to match the weather, time of day, etc.\n\nThe race-specific quality phase combines long runs with workouts run at or near your goal marathon pace. Spending six to twelve weeks in this phase will condition your body to run your goal pace for 26.2 miles.\n\nWhy focus on race-specific training?\n\nMost marathoners simply do not have enough strength and resiliency in their bodies to go the full length of the marathon at the top speed their aerobic engine will allow.\n\nShorter events like 5K to Half Marathon rely heavily on your aerobic engine and natural talent, but in the marathon it is impossible to succeed without putting in race-specific work.\n\nThe marathon is a battle of attrition for most athletes. Your limiting factor is not how fast your legs can move or how fast you can process oxygen like in the shorter events. In the marathon, your limiting factor is most likely your resilience to sheer muscular fatigue and breakdown.\n\nIn the race-specific quality phase of training, you will focus on building your physical resilience so you can go the distance at your goal pace.",
        "image": "race_specific"
      },
      {
        "title": "Tapering",
        "headline": "What is a taper?\n\nThe taper is the name given to the period 10 to 21 days before your season’s goal marathon. During the taper, you should intentionally run less to allow yourself the opportunity to freshen up before race day. When done correctly, tapering will cause you to reach your peak level of fitness for a very short window of time. Your goal marathon is then run during this peak fitness window before any detraining effect from the reduction in mileage occurs.\n\nWhy taper before an important race?\n\nTapering for the marathon is essential to achieve optimal performance on race day.\n\nMarathon training works on the principle of cumulative fatigue.\n\nCumulative fatigue is the idea that throughout marathon training, you are never fully rested between runs. Each run and workout piles on additional stress which is managed but never relieved over the course of training. Every workout, every long run, and every recovery run is done on tired legs and is often started with depleted glycogen stores.\n\nThe taper allows you to fully relieve the weight of cumulative fatigue and completely top up your energy stores before race day. By reducing your daily mileage in the lead-up to your marathon, the fitness you have developed over the past several months can finally emerge and present itself for a peak performance on race day.\n\nAthletes who do not taper after months of diligent training will likely start their marathon fatigued and low on energy.",
        "image": "tapering"
      },
      {
        "title": "Race Day",
        "headline": "After a successful training season and a restful taper, your marathon will mostly run itself. Excellence on race day simply comes down to proper planning, believing in yourself, believing in your training, and running with smart tactics.\n\nSimple Mental Strategy for Racing – The Three C’s\n\nThree C’s... Comfortable, Confident, Compete\n\nRunning is physical, but success is mental. The difference between finishing a race strong and proud versus crumbling at the end rarely comes down to physical limitations, but instead lies in your mental game.\n\nIt is rare and arguably downright impossible to push yourself to your absolute limit in a race, so having a mental approach to racing and giving it equal weight to your physical preparation is of utmost importance.\n\nMy favorite mental strategy for most distance running events is to break the race down into three parts. In each part, your mental energy should be spent focusing on just one word: Comfortable, Confident, or Compete.",
        "image": "race_day"
      },
      {
        "title": "After Race",
        "headline": "After your goal race, take planned time off and truly shut down your season.\n\nAs competitive runners seeking personal bests, we are constantly looking for ways to improve. One easy way to get better in running that athletes often overlook and undervalue is to take a significant break after their season’s goal race.\n\nCompetitive adult runners, especially marathoners, typically divide their year into two main seasons. An example of this would be peaking for the Boston Marathon in April, followed by the Chicago Marathon in October. This hypothetical runner will try to be in top shape on the exact day of these two races. To reach this peak, they will go through three to six months of progressively harder training before each marathon.\n\nRunners aim to be in their top physical condition just before the end of a season, but this peak is delicate and can only be maintained for a short window of time. The excessive miles and intensity required to reach an athlete’s peak will place significant stress on them. While you must do your best to maintain your health with good recovery habits, the stress from running at your peak training can only be managed for so long. This high level of stress is ultimately relieved through the taper and only then can a top performance come out of you on race day.\n\nRegardless of the outcome of your season’s goal race, it is essential to take time off from running afterward. Taking significant rest after a peak performance allows the body to fully heal and benefit long-term from all of the hard work put in during the training season. Rushing too quickly back into running after a peak performance will likely result in performance stagnation, mental burnout, or injury.",
        "image": "after_race"
      }
    ]
  },
  {
    "name": "Weekly Training Program",
    "elements": [
      {
        "title": "Rest Day",
        "headline": "Rest Days Actually Boost Your Running.\n\nWhether you’re a recreational runner or regularly training, there’s value in taking at least one day off each week.\n\nTaking time off from running, even if it’s just one day, can be a lot tougher than it sounds. We tend to focus on the positive aspects of the sport, and rightfully so: Running allows us to get outside, bust stress, strengthen our muscles, fuel creativity, and be competitive—and all those endorphins help improve our moods and reign in our crankiness. But as much as those miles benefit us, they can also hurt us if we aren’t mindful about rest.\n\nTruth is, not running is just as important as fitting in that long run. Rest days help strengthen your body, sharpen your focus, and reinvigorate your spirit so that you actually want to keep training.\n\n“Rest is not a four-letter word to be ignored,” says Kevin Vincent, M.D., Ph.D., director of the University of Florida Running Medicine Clinic. “The big reason you need it is recovery and recuperation. Every time you run, your body has to adapt to get stronger.”\n\nThat’s because when you run, you aren’t just building stamina and strength, you’re also breaking your body down, causing a tiny amount of tissue damage. Allowing yourself time to recover afterward is what makes it possible for you to come back better next week, next month, next race.\n\n“As much as athletes focus on their volume of training and the speed at which they do workouts, what they do outside of running is equally important to becoming stronger and more resilient in the future,” says Adam Tenforde, M.D., assistant professor of physical medicine and rehab at Harvard University and former All-American distance runner at Stanford.\n\nBonnie Marks, Psy.D., staff psychologist at the NYU Sports Performance Center, agrees. “If you don’t have time to recharge, it can lead to staleness and general apathy about training.”\n\nIn other words, rest right, and you’ll run faster and be healthier. Skip it, and you might be forced to take time off due to an injury. Here’s exactly why you need to take a break sometimes to build a stronger—more rested—you.",
        "image": "rest"
      },
      {
        "title": "Easy Run",
        "headline": "Top coaches and exercise physiologists believe that most runners should do 80 to 90% of their weekly training at the easy run pace (this includes your long runs, done at approximately the same pace).\n\nEasy runs build your aerobic fitness, and your muscular and skeletal strength. They also help you burn more calories and recover for harder workouts.\n\nBase runs are short to medium length runs done at a comfortable pace. Over time, as you get more comfortable with higher paces, your base runs increase in time/pace. These are essential runs that build aerobic capacity and endurance.\n\nEndurance builds gradually over the course of your training, so it’s important to be patient during this process. “The biggest key is consistency,” says Ryan Warrenburg, a running coach for the Zap Fitness Foundation. “Being able to train regularly and methodically is crucial to success. If you are always looking for quick results, it’s easy to get impatient, build up too quickly and get sidelined by an injury. If you can slowly increase your training volume and be consistent month after month with your running, that is how you see consistent, lasting improvement.",
        "image": "easy"
      },
      {
        "title": "Recovery Run",
        "headline": "There are easy runs, and there are hard runs. We cannot go easy all the time, neither can we go hard all the time. We need recovery runs between the hard days. And that is how we actually can improve ourselves to become better runners, smarter runners and happier runners. \n\nAnd you do not need to go out for a run when you are on recovery mode, go meet some friends, watch a movie, have a nice dinner, and if you want you could of course do some cross training, like biking, swimming, or treat yourself a few more hours of sleep is also a great option.",
        "image": "recovery"
      },
      {
        "title": "Speed Run",
        "headline": "Speed workouts, also known as interval training, consists of short bursts of high-intensity running followed by periods of recovery jog or walk. They usually are not the most enjoyable type of run, but they are the most effective in building speed and running efficiency.\n\nHow fast you should run varies depending on your background and what you goals are. Here are some tips to consider.\n\nFocus on your breathing.\n\nIn your run, focus on how heavy your breathing feels. If your breathing feels too heavy to even speak, then it may be better to slow down.\n\nUse time, not miles.\n\nFocus on how long it takes your to finish a run rather than the distance. After doing this, you will notice that you will naturally get faster and be able to run more distance.\n\nListen to your body.\n\nIf you think that you are running too fast, then you most likely are. Pushing yourself too far, may lead to an injury. Don’t try to force yourself, and listen to what pace your body feels more comfortable with.\n\nHeart rate.\n\nIt is important to make sure that when you are running, your heart rate does not go above your normal threshold. Constantly going above your maximum heart rate can lead to a more difficult recovery if injured.",
        "image": "fast"
      },
      {
        "title": "Hill Run",
        "headline": "Hill repeats are a type of interval training where you constantly run up a hill and slowly jog or walk back down the hill. Normally, hill repeats can be done early int he season to build strength and power.\n\nA lot of runners dread running hills for multiple reasons. For some runners, it may be the increase of efforts needed, others may experience pain when running hills. It's important to know that running hills comes with both its benefits and drawbacks.\n\nHere are some tips on how to approach hills as a runner to maximise its benefits and minimise it risks.\n\nRun tall\n\nThis is achieved by maintaining the proper form that will then translate to when you run on a flat surface because of muscle memory. Things to keep in mind when running \"Tall\" are eyes looking straight forward, maintaining a straight back, and aligning hips and knees. This will put less stress on your lower body as aligning your hips and knees will lessen the impact there.\n\nIncrease cadence\n\nShorter faster steps are recommended when going up and down a hill. This will prevent over-striding by having you focus on quicker shorter steps instead of long strides. By not over-striding you are maintaining good form and decreasing the stress on your lower body muscles, not just when running on a hill but also when running on a flatter surface.\n\nLean into the hill\n\nThis applies to going uphill and downhill. Many people lose their form when going downhill as they lean back when instead they should be leaning forward, which allows the joints to not be overextend or forced to absorb more force than needed. it is also important to not lean excessively when going downhill as it will lead to imbalance. In addition, leaning excessively forward when going uphill will decrease the range of motion of your hip flexors.\n\nWear suitable footwear\n\nIt's important to run in proper shoes to prevent injury. Look for shoes that are lightweight, cushioned, offer ankle support and have plenty of grip.",
        "image": "hill"
      },
      {
        "title": "Long Run",
        "headline": "Long runs are runs done on a long distance at the pace of your base runs. Long runs are important to do if you're preparing for race day. At the same time, long runs help with improving your overall endurance and mental confidence.\n\nLong runs form the foundation of all marathon training programs - they build everything from your confidence to your discipline to your fat-burning. So, even when you're not training for a specific marathon, it's a good idea to do at least one semi-long run a week. Because long runs are done at a relaxed pace, there's great latitude in how fast you actually run.\n\nIn general, we believe that slower is better than faster. Let your long runs be your slow runs, and save your legs for other days of the week when you might do tempo runs or maximum-oxygen runs. But there are a thousand theories about how to do long runs, none of which have yet been proven superior to the others.\n\nThe important thing is building up the distance and training your body to keep going for 3, 4, 5 or however many hours it's going to take you.",
        "image": "long"
      }
    ]
  },
  {
    "name": "Nutrition & Hydration",
    "elements": [
      {
        "title": "Breakfast",
        "headline": "What to eat before a run is often the most important question for new runners. Your body requires different fuel depending on the type of training you're doing and your goals.\n\nThe most important thing is to adjust your fuel based on your training demands for that day. Every day won't look the same.\n\nDuring harder training sessions and races, your body uses carbohydrates (stored in the muscles as glycogen) as its main fuel (energy) source. You're only able to store a relatively small amount of carbohydrate, which is why keeping it topped up is so important.\n\nDuring low-intensity exercise, such as jogging or walking, the body burns fat as its main fuel for energy. Therefore, fuelling with carbohydrates pre-exercise isn’t as crucial, and these don't need to be added to your meal or snack.\n\nThe important thing is to plan which sessions require fuelling with carbs. Find recipe suggestions and more tips for low-intensity and high-intensity training days.\n\nYou should always eat before a harder training session, as the body will require fuel from carbohydrates. For lighter, low-intensity training, a protein-based breakfast or even a fasted training session is fine.",
        "image": "breakfast"
      },
      {
        "title": "Lunch",
        "headline": "A healthy, balanced athlete lunch will have all food groups present, with a large focus on carbohydrates and protein.\n\nThe exact macro breakdown may depend on an individual athlete’s needs, as well as when their workout is.\n\nBalance and variety are important in healthy lunches for runners because each macronutrient group has a purpose. Let’s review each group while making a healthy lunch plate.\n\nWhen making lunch, the breakdown may vary depending on when and how long the planned exercise is for.\n\nFor example, did you work out in the morning or just before lunch? If so, a post-run lunch will focus around carbs and protein for recovery.\n\nOn the flip side, if you’re planning a pre-run lunch, the focus will be on mostly low-fiber carbohydrates, with minimal fat and protein.\n\nEating high-fiber foods may contribute to runners gut symptoms and we don’t want to eat them before exercise.",
        "image": "lunch"
      },
      {
        "title": "Snack",
        "headline": "The more you run, the more food you need to eat to provide your body with adequate energy. Running can burn hundreds of calories in a single workout, and that deficit needs to be accounted for. Without enough calories, you won’t have the energy to support your running. You will likely feel very fatigued during runs, and your risk of injury may increase. It’s a surefire way to burn out.\n\nResearch shows that it’s not just total daily calories that matter—the distribution of energy throughout the day is important. For example, if you eat minimally all day and then have an enormous dinner, you’ll feel more fatigue than if you spread the calories out equally. The distribution of caloric intake throughout the day is called “within-day energy availability.” Resting metabolic rate tends to be lower with large windows of low energy availability. Athletic performance may suffer also. You can optimize your within-day energy availability by eating every 3–4 hours when awake. To achieve this, many people need one to three snacks per day.\n\nFinally, snacks can help you optimize your training adaptations. After a workout, your body needs protein to synthesize muscle repair and growth and carbohydrates to replenish glycogen stores. It’s best to eat something within an hour—whether that’s a full meal or a snack to hold you over until mealtime. ",
        "image": "snack"
      },
      {
        "title": "Dinner",
        "headline": "Runners should eat a balanced plate with protein, carbs, and healthy fats. In general, a runner’s plate should include: meat, fish, cheese, and/or beans, carbs such as pasta, rice, quinoa, potatoes, or couscous, veggies such as zucchini, spinach, broccoli, Brussel sprouts, and green beans, and healthy fats from oils such as avocado or olive oil.\n\nHere are 16 healthy dinner meal ideas for runners that your family will eat too!\n* Spaghetti and ground turkey meatballs and a side salad or vegetables\n* Chicken stir fry with veggies and rice\n* Make your own pizza with toppings such as cheese, pepperoni, onion, peppers, sausage, spinach, etc.\n* Sushi rolls including teriyaki chicken, salmon, or veggies with rice\n* Turkey burger (or black bean or Beyond Beef burger) with a baked potato and broccoli\n* Chicken kabobs over brown rice\n* Salmon (or any fish or meat) with French fries and roasted vegetables\n* Potato skins with toppings such as cheese, tomatoes, spinach, and sour cream\n* Avocado toast with pesto or hummus spread and a side salad\n* Salad with cooked tuna steak slathered with soy sauce and sesame seeds, sunflower seeds, almond slices, berries, feta cheese, and DIY dressing (oil and vinegar, mustard, lemon juice, salt and pepper)\n* Couscous salad with roasted veggies and feta cheese\n* Cucumbers with lime and grilled chicken\n* Chicken, roasted broccoli, and sweet potatoes\n* Salmon, sweet potatoes, and green beans with butter and garlic\n* Hearty pasta salad with veggies, beans, cheese, and vinaigrette\n* Breakfast burritos",
        "image": "dinner"
      }
    ]
  },
  {
    "name": "Gear Up For Success",
    "elements": [
      {
        "title": "Distance",
        "headline": "Why It’s Important to Have Good Long Distance Running Shoes?\n\nThe right running shoe matters so much because over the many, many miles you put in, it’s really easy to have issues like ankle pain while running or knee pain while running.\n\nNot simply from weak hips and glutes, but from shoes that aren’t right for you! In fact, wearing the wrong type of running shoes is the top cause of foot pain when running.\n\nA few of the common things we’re trying to find in a good distance shoe.\n- has enough room in the toe box for your feet to spread and potentially swell over the miles\n- allows you to change the lacing to provide more room or lock in your heel\n- keeps your arch from falling inward which places pressure on knees and ankles.\n\nWhat To Look For In Long Distance Running Shoes?\n\nWhen considering a pair of running shoes for 13.1 miles to over 26.2 there are a few key areas that you want to examine. The goal is to find a shoe that can take you through most of training, so then you can grab a new pair and flow easily in to race day.\n\n#1 Comfort\n\n#2 Cushioning\n\n#3 Base Level of Support\n\n#4 Durable Outsole\n\n#5 Breathability\n\n#6 Type of Feet\n\n#7 Toe box Room\n\n#8 Fits the Terrain",
        "image": "distance"
      },
      {
        "title": "Fast",
        "headline": "Each part of the running shoe has a specific purpose and is designed to fit the foot a certain way. Even the slightest differentiation may affect your experience.\n\nTips:\n\nGo to a specialty running shop, not a big-box or department store. A salesperson will observe your gait and bring a selection of shoes that they believe best fit your needs. They’ll let you try each one, and help you narrow it down to the right choice.\n\nGet your feet measured. You may think you know your size, but your feet change over time, and one model’s fit can be drastically different from another’s.\n\nWhen you go shopping, bring along the shoes, socks, and inserts you’ve been using. That way, when you try on a new shoe, you can compare it directly to your current experience.\n\nShoes should be replaced every 300 to 500 miles depending on the brand and model. Keep track of the date that you bought them in your training log and make note of when they start to feel worn down.",
        "image": "fast_shoe"
      },
      {
        "title": "Trail",
        "headline": "When you’re going off-road, your shoes need extra traction and durability.\n\nThe outsole of your running shoe is where the rubber meets the road. It is often made of a variety of rubber or foam compounds placed in strategic areas to increase wear life or enhance bounce or flexibility. Materials that provide traction and durability without adding excess weight or stiffness, and for a footprint shape that matches yours and gives you the desired level of stability underfoot.",
        "image": "trail"
      }
    ]
  },
  {
    "name": "Inspiration from the GOAT",
    "elements": [
      {
        "title": "Eliud Kipchoge",
        "headline": "Eliud Kipchoge EGH (born 5 November 1984) is a Kenyan long-distance runner who competes in the marathon and formerly specialized at the 5000 metre distance. Widely regarded as one of the greatest marathon runners of all time, he is the 2016 and 2020 Olympic marathon champion and the world record holder in the marathon with a time of 2:01:09 set at the 2022 Berlin Marathon. He has run four of the six fastest marathons in history.\n\nKipchoge claimed his first individual world championship title in 2003 by winning the junior race at the World Cross Country Championships and setting a world junior record over 5000 m on the track. At the age of eighteen, he became the senior 5000 m world champion at the 2003 World Championships with a championships record, then followed with an Olympic bronze for Kenya in 2004 and a bronze at the 2006 World Indoor Championships. A five-time World Championship 5000 m finalist, Kipchoge took silver medals at the 2007 World Championships, 2008 Beijing Olympics and 2010 Commonwealth Games.",
        "image": "eliud"
      },
      {
        "title": "Mo Farah",
        "headline": "Sir Mohamed Muktar Jama Farah CBE OLY (born Hussein Abdi Kahin; 23 March 1983) is a British long-distance runner. His ten global championship gold medals (four Olympic and six World titles) make him the most successful male track distance runner ever, and he is the most successful British track athlete in modern Olympic Games history.\n\nFarah is the 2012 and 2016 Olympic gold medallist in both the 5,000 m and 10,000 m. He is the second athlete, after Lasse Virén, to win both the 5,000 m and 10,000 m titles at successive Olympic Games. He also completed the 'distance double' at the 2013 and 2015 World Championships in Athletics. He was the first man to defend both distance titles in both major global competitions; a feat described as the 'quadruple-double'. After finishing second in the 10,000 metres at the 2011 World Championships, Farah had an unbroken streak of ten global final wins (the 5,000m in 2011, the double in 2012, 2013, 2015 and 2016, and the 10,000m in 2017). The streak ended in Farah's final championship track race, when he finished second to Ethiopia's Muktar Edris in the 2017 5,000 metres final.",
        "image": "mo"
      },
      {
        "title": "Kenenisa Bekele",
        "headline": "Kenenisa Bekele Beyecha (Oromo: Qananiisaa baqqalaa; born 13 June 1982) is an Ethiopian long-distance runner. He was the world record holder in both the 5000-metre and 10000-metre from 2004 (5,000m) and 2005 (10,000m) until 2020. He won the gold medal in both the 5000 m and 10,000 m events at the 2008 Summer Olympics. At the 2004 Olympics, he won the gold medal in the 10,000 m and the silver medal in the 5000 m.\n\nHe is the most successful runner in the history of the IAAF World Cross Country Championships, with six long (12 km) course and five short (4 km) course titles. He won the 10,000 m title at the World Championships in Athletics in 2003, 2005, 2007 and 2009 (matching Haile Gebrselassie's four in a row win streak). Kenenisa was unbeaten over 10,000 m from his debut in 2003 until 2011, when he failed to finish at the World Championships final.",
        "image": "bekele"
      },
      {
        "title": "Molly Seidel",
        "headline": "Molly Seidel (born July 12, 1994) is an American long distance runner. Seidel represented the United States at the Great Edinburgh Cross Country in 2012, 2013, and 2018. In her first-ever marathon, Seidel placed second at the 2020 U.S. Marathon Olympic Trials. Later, she went on to win the bronze medal in her third career marathon at the 2020 Summer Olympics in Tokyo. \n\nAt the University of Notre Dame, Seidel was a 4-time NCAA champion, 6-time NCAA All-American, 6-time Atlantic Coast Conference champion and 2016 female ACC Athlete of the Year.",
        "image": "molly"
      },
      {
        "title": "Keira D'Amato",
        "headline": "Keira D'Amato (born Keira Carlstrom on October 21, 1984) is an American distance runner. She held the American women's record in the marathon with her time of 2:19:12 at the 2022 Houston Marathon, until Emily Sisson set a new record time on October 9, 2022. \n\nShe is the world best holder for the women's-only 10 mile distance and a three-time USA Track & Field national champion.",
        "image": "keira"
      },
      {
        "title": "Shalane Flanagan",
        "headline": "Shalane Grace Flanagan (born July 8, 1981) is an American long-distance runner, Olympic medalist and New York City Marathon champion. She was the first American woman to win the New York City Marathon since 1977. She holds the NACAC area records in both the 10k and 15k road races.\n\nShe won the silver medal at the 2008 Olympics in the 10,000 m (upgraded from bronze following original silver medalist’s desqualification for doping) and the bronze medal at the 2011 IAAF World Cross Country Championships. She won the Women's 2017 New York City Marathon, the first American woman to do so since Miki Gorman in 1977.",
        "image": "shalane"
      }
    ]
  },
  {
    "name": "World Marathon Majors",
    "elements": [
      {
        "title": "New York",
        "headline": "The New York City Marathon (currently branded TCS New York City Marathon after its headline sponsor) is an annual marathon (42.195 km or 26.219 mi) that courses through the five boroughs of New York City. It is the largest marathon in the world, with 53,627 finishers in 2019 and 98,247 applicants for the 2017 race. Along with the Boston Marathon and Chicago Marathon, it is among the pre-eminent long-distance annual running events in the United States and is one of the World Marathon Majors.\n\nThe race is organized by New York Road Runners and has been run every year since 1970, with the exception of 2012, when it was cancelled due to the landfall of Hurricane Sandy, and 2020, when it was cancelled due to the COVID-19 pandemic. The race is held on the first Sunday of November and attracts professional competitors and amateurs from all over the world. Because of the popularity of the race, participation is chosen largely by a lottery system. Guaranteed entry to the marathon can be gained by satisfying the requirements of the 9+1 program or the 9+$1K program (where NYRR members run in nine sponsored races and either volunteer at another event or donate $1,000 to support NYRR programs for young athletes), having completed 15 or more previous NYC Marathons, or meeting time qualification standards. In addition, runners can gain an entry by joining a team to raise funds for one of a number of charities.",
        "image": "newyork"
      },
      {
        "title": "Boston",
        "headline": "The Boston Marathon is an annual marathon race hosted by several cities and towns in greater Boston in eastern Massachusetts, United States. It is traditionally held on Patriots' Day, the third Monday of April. Begun in 1897, the event was inspired by the success of the first marathon competition in the 1896 Summer Olympics. The Boston Marathon is the world's oldest annual marathon and ranks as one of the world's best-known road racing events. It is one of six World Marathon Majors. Its course runs from Hopkinton in southern Middlesex County to Copley Square in Boston.\n\nThe Boston Athletic Association (B.A.A.) has organized this event annually since 1897, except for 2020 when it was canceled due to the COVID-19 pandemic. In 2021, it was held later, in October. The race has been managed by DMSE Sports, Inc., since 1988. Amateur and professional runners from all over the world compete in the Boston Marathon each year, braving the hilly Massachusetts terrain and varying weather to take part in the race.\n\nThe event attracts 500,000 spectators each year, making it New England's most widely viewed sporting event. Starting with just 15 participants in 1897, the event now attracts an average of about 30,000 registered participants each year, with 30,251 people entering in 2015. The Centennial Boston Marathon in 1996 established a record as the world's largest marathon with 38,708 entrants, 36,748 starters, and 35,868 finishers.",
        "image": "boston"
      },
      {
        "title": "Chicago",
        "headline": "The Chicago Marathon is a marathon (long-distance foot race) held every October in Chicago, Illinois. It is one of the six World Marathon Majors. Thus, it is also a World Athletics Label Road Race. The Chicago Marathon is the fourth-largest race by number of finishers worldwide.\n\nAnnual Chicago marathons were held from 1905 to the 1920s, but the first race in the present series occurred on September 25, 1977, under the original name the Mayor Daley Marathon, which drew a field of 4,200 runners. The race has been held every year since, except in 1987 when only a half-marathon was run, and in 2020 as a result of the COVID-19 pandemic. It became among the fastest-growing modern-marathon road races in the world, due in part to its largely fast and flat course which facilitates the pursuit of personal records and world record performances. The race has achieved its elite status among marathons by developing relationships with sponsors who provide prize money to lure elite runners who have produced American and world record performances. Since 2008, the race has been owned and organized by Bank of America, and is officially known as the Bank of America Chicago Marathon.\n\nThe race is limited to 45,000 runners and only runners who finish within 61⁄2 hours are officially timed. Those wishing to participate can register after either meeting a time qualifying standard or being selected through a general lottery. Although the race has limited registration, exceptions include elite runners, legacy finishers, and charity representatives. Increasingly, local, national and global charities as well as humanitarian organizations encourage sponsored participation in the event as a means of fund raising.",
        "image": "chicago"
      },
      {
        "title": "London",
        "headline": "The London Marathon is an annual marathon held in London, United Kingdom, and is the 2nd largest annual road race in the UK, after the Great North Run in Newcastle. Founded by athletes Chris Brasher and John Disley in 1981, it is typically held in April but has moved to October for 2020 and 2021 due to the COVID-19 pandemic. The 2022 edition was also postponed to October with Hugh Brasher stating \"We believe that by moving the 2022 event to October we give ourselves the best chances of welcoming the world to the streets of London, enabling tens of millions to be raised for good causes and giving people the certainty that their hard work and training will allow them to experience the amazing crowds cheering them every step of the way from Greenwich to Westminster\". The largely flat course is set around the River Thames, starting in Blackheath and finishing at The Mall. Hugh Brasher (son of Chris) is the current Race Director and Nick Bitel its Chief Executive.\n\nThe race has several components: it has a mass race for the public, professional races for men and women long-distance runners, elite level wheelchair races for men and women, plus a 3-mile mini marathon event for under-17 athletes. The mass race is the largest marathon event in the United Kingdom and its third largest running event (after the Great North Run and Great Manchester Run). There is a significant charity running aspect to the marathon, with participants helping to raise over £1 billion since its founding, including £66.4 million at the 2019 London Marathon which was the highest amount for a single-day fund-raising event.\n\nSince 2006, the elite race has been part of the World Marathon Majors, which includes six of the world's top level marathon races. The London Marathon has seen the marathon world record broken on seven occasions: Khalid Khannouchi broke the men's record in 2002, while women's records have been broken by Grete Waitz (1983), Ingrid Kristiansen (1985), Paula Radcliffe (2002, 2003, 2005) and Mary Jepkosgei Keitany (2017). The current elite course records are held by Eliud Kipchoge (2:02:37 in 2019) and Paula Radcliffe (2:15:25 in 2003). The current wheelchair course records are held by Marcel Hug (1:24:38 in 2022) and Manuela Schär (1:39:52 in 2021).\n\nThe 2020 London Marathon was postponed and only allowed elite participants due to the COVID-19 outbreak. The race often has a title sponsorship, sponsored by Virgin Money for several years, it is branded the \"TCS London Marathon\" for 2022.\n\nThe 2023 London Marathon will revert to its traditional spring date which will be held on 23 April.",
        "image": "london"
      },
      {
        "title": "Berlin",
        "headline": "The Berlin Marathon is a marathon event held annually on the streets of Berlin, Germany on the last weekend of September. Held annually since 1974,[a] the event includes multiple races over the marathon distance of 42.195 kilometres (26.219 mi), including elite level road running competitions for men and women, a race for the public, an inline skating race, a wheelchair race, and a handcycle race.\n\nEvents are split over two days, with skaters competing on the marathon course on Saturday before the running events. Power walkers, hand-bikers, wheelchair riders, and a children's marathon (4.2195 kilometres (2.6219 mi), 1/10 of the regular distance) are also part of the marathon weekend, which is organised by SCC EVENTS. The elite running and wheelchair races are part of the World Marathon Majors, an annual series of top level races offering a $1 million prize purse. BMW is the current title sponsor for the race.\n\nThe city's flat course regularly produces fast performances and the marathon world record has been broken in Berlin on twelve occasions, particularly the most recent eight instances on the men's progression (as of September 2022). The current record was set at the 2022 edition, where Eliud Kipchoge won the men's race in 2:01:09. Tigist Assefa set a new women's course record that same year with 2:15:37.",
        "image": "berlin"
      },
      {
        "title": "Tokyo",
        "headline": "The first Tokyo Marathon was held on 18 February 2007. However, years prior to 2007, Tokyo Marathon actually consisted of two marathons - the Tokyo International Marathon which took place on even years, and Tokyo - New York Friendship International Marathon which took place on odd years. In the inaugural year, 1981, both marathons took place. However, because it was not possible to support two marathons a month apart in the same city, from 1982, the alternating format went into effect.\n\nThe 2007 marathon was also a representative selection race of the 2007 World Championships in Athletics in Osaka. The total number of participants was set at 30,000. Of that, 25,000 people signed up for the marathon, and 5,000 signed up for the 10K run.\n\nMasakazu Fujiwara became the race's first Japanese male winner at the fourth edition.\n\nIn February 2014, Dickson Chumba won in a record time of 2:05:42. This was only the second time a runner ran below 2h06 in Japan, after Tsegaye Kebede in Fukuoka Marathon (December 6, 2009). His runner-up, Tadese Tola did also run below 2:06, in a time of 2:05:57.\n\nIn January 2020, rock musician Hyde released the song \"Believing in Myself\" as a single inspired by the event. Due to the COVID-19 epidemic, only elite runners were invited to the 2020 Tokyo Marathon. All other participants were given a deferral to 2021.\n\nThe 2021 Tokyo Marathon was postponed to 17 October 2021 due to the pandemic. It was then postponed again to 6 March 2022; the event was still referred to as the 2021 Tokyo Marathon, and there was no 2022 Tokyo Marathon. Additionally, all overseas runners were barred from competing, with their entries automatically transferred to 2023.",
        "image": "tokyo"
      }
    ]
  }
]
