[
  {
    "name": "Marathon Training Phase",
    "elements": [
      {
        "title": "Base Building",
        "headline": "Rest well before running.",
        "image": "base"
      },
      {
        "title": "Speed Run",
        "headline": "Run easy, real easy.",
        "image": "speed"
      },
      {
        "title": "Race Specific",
        "headline": "Recovery between hard days.",
        "image": "race_specific"
      },
      {
        "title": "Tapering",
        "headline": "Fast runs, short breaks.",
        "image": "tapering"
      },
      {
        "title": "Race Day",
        "headline": "Run up the hill.",
        "image": "race_day"
      },
      {
        "title": "After Race",
        "headline": "Go far and beyond.",
        "image": "after_race"
      }
    ]
  },
  {
    "name": "Weekly Training Program",
    "elements": [
      {
        "title": "Rest Day",
        "headline": "Rest well before running.",
        "image": "rest"
      },
      {
        "title": "Easy Run",
        "headline": "Run easy, real easy.",
        "image": "easy"
      },
      {
        "title": "Recovery Run",
        "headline": "Recovery between hard days.",
        "image": "recovery"
      },
      {
        "title": "Interval Run",
        "headline": "Fast runs, short breaks.",
        "image": "fast"
      },
      {
        "title": "Hill Run",
        "headline": "Run up the hill.",
        "image": "hill"
      },
      {
        "title": "Long Run",
        "headline": "Go far and beyond.",
        "image": "long"
      }
    ]
  },
  {
    "name": "Nutrition & Hydration",
    "elements": [
      {
        "title": "Breakfast",
        "headline": "Rest well before running.",
        "image": "breakfast"
      },
      {
        "title": "Lunch",
        "headline": "Run easy, real easy.",
        "image": "lunch"
      },
      {
        "title": "Snack",
        "headline": "Recovery between hard days.",
        "image": "snack"
      },
      {
        "title": "Dinner",
        "headline": "Fast runs, short breaks.",
        "image": "dinner"
      }
    ]
  },
  {
    "name": "Gear Up For Success",
    "elements": [
      {
        "title": "Distance",
        "headline": "Rest well before running.",
        "image": "distance"
      },
      {
        "title": "Fast",
        "headline": "Run easy, real easy.",
        "image": "fast_shoe"
      },
      {
        "title": "Trail",
        "headline": "Recovery between hard days.",
        "image": "trail"
      }
    ]
  },
  {
    "name": "Inspiration from the GOAT",
    "elements": [
      {
        "title": "Eliud Kipchoge",
        "headline": "Eliud Kipchoge EGH (born 5 November 1984) is a Kenyan long-distance runner who competes in the marathon and formerly specialized at the 5000 metre distance. Widely regarded as one of the greatest marathon runners of all time, he is the 2016 and 2020 Olympic marathon champion and the world record holder in the marathon with a time of 2:01:09 set at the 2022 Berlin Marathon. He has run four of the six fastest marathons in history.\n\nKipchoge claimed his first individual world championship title in 2003 by winning the junior race at the World Cross Country Championships and setting a world junior record over 5000 m on the track. At the age of eighteen, he became the senior 5000 m world champion at the 2003 World Championships with a championships record, then followed with an Olympic bronze for Kenya in 2004 and a bronze at the 2006 World Indoor Championships. A five-time World Championship 5000 m finalist, Kipchoge took silver medals at the 2007 World Championships, 2008 Beijing Olympics and 2010 Commonwealth Games.",
        "image": "eliud"
      },
      {
        "title": "Mo Farah",
        "headline": "Sir Mohamed Muktar Jama Farah CBE OLY (born Hussein Abdi Kahin; 23 March 1983) is a British long-distance runner. His ten global championship gold medals (four Olympic and six World titles) make him the most successful male track distance runner ever, and he is the most successful British track athlete in modern Olympic Games history.\n\nFarah is the 2012 and 2016 Olympic gold medallist in both the 5,000 m and 10,000 m. He is the second athlete, after Lasse Virén, to win both the 5,000 m and 10,000 m titles at successive Olympic Games. He also completed the 'distance double' at the 2013 and 2015 World Championships in Athletics. He was the first man to defend both distance titles in both major global competitions; a feat described as the 'quadruple-double'. After finishing second in the 10,000 metres at the 2011 World Championships, Farah had an unbroken streak of ten global final wins (the 5,000m in 2011, the double in 2012, 2013, 2015 and 2016, and the 10,000m in 2017). The streak ended in Farah's final championship track race, when he finished second to Ethiopia's Muktar Edris in the 2017 5,000 metres final.",
        "image": "mo"
      },
      {
        "title": "Kenenisa Bekele",
        "headline": "Kenenisa Bekele Beyecha (Oromo: Qananiisaa baqqalaa; Amharic: ቀነኒሳ በቀለ; born 13 June 1982) is an Ethiopian long-distance runner. He was the world record holder in both the 5000-metre and 10000-metre from 2004 (5,000m) and 2005 (10,000m) until 2020. He won the gold medal in both the 5000 m and 10,000 m events at the 2008 Summer Olympics. At the 2004 Olympics, he won the gold medal in the 10,000 m and the silver medal in the 5000 m.\n\nHe is the most successful runner in the history of the IAAF World Cross Country Championships, with six long (12 km) course and five short (4 km) course titles. He won the 10,000 m title at the World Championships in Athletics in 2003, 2005, 2007 and 2009 (matching Haile Gebrselassie's four in a row win streak). Kenenisa was unbeaten over 10,000 m from his debut in 2003 until 2011, when he failed to finish at the World Championships final.",
        "image": "bekele"
      },
      {
        "title": "Molly Seidel",
        "headline": "Molly Seidel (born July 12, 1994) is an American long distance runner. Seidel represented the United States at the Great Edinburgh Cross Country in 2012, 2013, and 2018. In her first-ever marathon, Seidel placed second at the 2020 U.S. Marathon Olympic Trials. Later, she went on to win the bronze medal in her third career marathon at the 2020 Summer Olympics in Tokyo. At the University of Notre Dame, Seidel was a 4-time NCAA champion, 6-time NCAA All-American, 6-time Atlantic Coast Conference champion and 2016 female ACC Athlete of the Year.",
        "image": "molly"
      },
      {
        "title": "Keira D'Amato",
        "headline": "Keira D'Amato (born Keira Carlstrom on October 21, 1984) is an American distance runner. She held the American women's record in the marathon with her time of 2:19:12 at the 2022 Houston Marathon, until Emily Sisson set a new record time on October 9, 2022. She is the world best holder for the women's-only 10 mile distance and a three-time USA Track & Field national champion.",
        "image": "keira"
      },
      {
        "title": "Shalane flanagan",
        "headline": "Shalane Grace Flanagan (born July 8, 1981) is an American long-distance runner, Olympic medalist and New York City Marathon champion. She was the first American woman to win the New York City Marathon since 1977. She holds the NACAC area records in both the 10k and 15k road races.\n\nShe won the silver medal at the 2008 Olympics in the 10,000 m (upgraded from bronze following original silver medalist’s desqualification for doping) and the bronze medal at the 2011 IAAF World Cross Country Championships. She won the Women's 2017 New York City Marathon, the first American woman to do so since Miki Gorman in 1977.",
        "image": "shalane"
      }
    ]
  },
  {
    "name": "World Marathon Majors",
    "elements": [
      {
        "title": "New York",
        "headline": "The New York City Marathon (currently branded TCS New York City Marathon after its headline sponsor) is an annual marathon (42.195 km or 26.219 mi) that courses through the five boroughs of New York City. It is the largest marathon in the world, with 53,627 finishers in 2019 and 98,247 applicants for the 2017 race. Along with the Boston Marathon and Chicago Marathon, it is among the pre-eminent long-distance annual running events in the United States and is one of the World Marathon Majors.\n\nThe race is organized by New York Road Runners and has been run every year since 1970, with the exception of 2012, when it was cancelled due to the landfall of Hurricane Sandy, and 2020, when it was cancelled due to the COVID-19 pandemic. The race is held on the first Sunday of November and attracts professional competitors and amateurs from all over the world. Because of the popularity of the race, participation is chosen largely by a lottery system. Guaranteed entry to the marathon can be gained by satisfying the requirements of the 9+1 program or the 9+$1K program (where NYRR members run in nine sponsored races and either volunteer at another event or donate $1,000 to support NYRR programs for young athletes), having completed 15 or more previous NYC Marathons, or meeting time qualification standards. In addition, runners can gain an entry by joining a team to raise funds for one of a number of charities.",
        "image": "newyork"
      },
      {
        "title": "Boston",
        "headline": "The Boston Marathon is an annual marathon race hosted by several cities and towns in greater Boston in eastern Massachusetts, United States. It is traditionally held on Patriots' Day, the third Monday of April. Begun in 1897, the event was inspired by the success of the first marathon competition in the 1896 Summer Olympics. The Boston Marathon is the world's oldest annual marathon and ranks as one of the world's best-known road racing events. It is one of six World Marathon Majors. Its course runs from Hopkinton in southern Middlesex County to Copley Square in Boston.\n\nThe Boston Athletic Association (B.A.A.) has organized this event annually since 1897, except for 2020 when it was canceled due to the COVID-19 pandemic. In 2021, it was held later, in October. The race has been managed by DMSE Sports, Inc., since 1988. Amateur and professional runners from all over the world compete in the Boston Marathon each year, braving the hilly Massachusetts terrain and varying weather to take part in the race.\n\nThe event attracts 500,000 spectators each year, making it New England's most widely viewed sporting event. Starting with just 15 participants in 1897, the event now attracts an average of about 30,000 registered participants each year, with 30,251 people entering in 2015. The Centennial Boston Marathon in 1996 established a record as the world's largest marathon with 38,708 entrants, 36,748 starters, and 35,868 finishers.",
        "image": "boston"
      },
      {
        "title": "Chicago",
        "headline": "The Chicago Marathon is a marathon (long-distance foot race) held every October in Chicago, Illinois. It is one of the six World Marathon Majors. Thus, it is also a World Athletics Label Road Race. The Chicago Marathon is the fourth-largest race by number of finishers worldwide.\n\nAnnual Chicago marathons were held from 1905 to the 1920s, but the first race in the present series occurred on September 25, 1977, under the original name the Mayor Daley Marathon, which drew a field of 4,200 runners. The race has been held every year since, except in 1987 when only a half-marathon was run, and in 2020 as a result of the COVID-19 pandemic. It became among the fastest-growing modern-marathon road races in the world, due in part to its largely fast and flat course which facilitates the pursuit of personal records and world record performances. The race has achieved its elite status among marathons by developing relationships with sponsors who provide prize money to lure elite runners who have produced American and world record performances. Since 2008, the race has been owned and organized by Bank of America, and is officially known as the Bank of America Chicago Marathon.\n\nThe race is limited to 45,000 runners and only runners who finish within 61⁄2 hours are officially timed. Those wishing to participate can register after either meeting a time qualifying standard or being selected through a general lottery. Although the race has limited registration, exceptions include elite runners, legacy finishers, and charity representatives. Increasingly, local, national and global charities as well as humanitarian organizations encourage sponsored participation in the event as a means of fund raising.",
        "image": "chicago"
      },
      {
        "title": "London",
        "headline": "The London Marathon is an annual marathon held in London, United Kingdom, and is the 2nd largest annual road race in the UK, after the Great North Run in Newcastle. Founded by athletes Chris Brasher and John Disley in 1981, it is typically held in April but has moved to October for 2020 and 2021 due to the COVID-19 pandemic. The 2022 edition was also postponed to October with Hugh Brasher stating \"We believe that by moving the 2022 event to October we give ourselves the best chances of welcoming the world to the streets of London, enabling tens of millions to be raised for good causes and giving people the certainty that their hard work and training will allow them to experience the amazing crowds cheering them every step of the way from Greenwich to Westminster\". The largely flat course is set around the River Thames, starting in Blackheath and finishing at The Mall. Hugh Brasher (son of Chris) is the current Race Director and Nick Bitel its Chief Executive.\n\nThe race has several components: it has a mass race for the public, professional races for men and women long-distance runners, elite level wheelchair races for men and women, plus a 3-mile mini marathon event for under-17 athletes. The mass race is the largest marathon event in the United Kingdom and its third largest running event (after the Great North Run and Great Manchester Run). There is a significant charity running aspect to the marathon, with participants helping to raise over £1 billion since its founding, including £66.4 million at the 2019 London Marathon which was the highest amount for a single-day fund-raising event.\n\nSince 2006, the elite race has been part of the World Marathon Majors, which includes six of the world's top level marathon races. The London Marathon has seen the marathon world record broken on seven occasions: Khalid Khannouchi broke the men's record in 2002, while women's records have been broken by Grete Waitz (1983), Ingrid Kristiansen (1985), Paula Radcliffe (2002, 2003, 2005) and Mary Jepkosgei Keitany (2017). The current elite course records are held by Eliud Kipchoge (2:02:37 in 2019) and Paula Radcliffe (2:15:25 in 2003). The current wheelchair course records are held by Marcel Hug (1:24:38 in 2022) and Manuela Schär (1:39:52 in 2021).\n\nThe 2020 London Marathon was postponed and only allowed elite participants due to the COVID-19 outbreak. The race often has a title sponsorship, sponsored by Virgin Money for several years, it is branded the \"TCS London Marathon\" for 2022.\n\nThe 2023 London Marathon will revert to its traditional spring date which will be held on 23 April.",
        "image": "london"
      },
      {
        "title": "Berlin",
        "headline": "The Berlin Marathon (German: Berlin-Marathon, pronounced [bɛʁˈliːn ˈmaʁatɔn]) is a marathon event held annually on the streets of Berlin, Germany on the last weekend of September. Held annually since 1974,[a] the event includes multiple races over the marathon distance of 42.195 kilometres (26.219 mi), including elite level road running competitions for men and women, a race for the public, an inline skating race, a wheelchair race, and a handcycle race.\n\nEvents are split over two days, with skaters competing on the marathon course on Saturday before the running events. Power walkers, hand-bikers, wheelchair riders, and a children's marathon (4.2195 kilometres (2.6219 mi), 1/10 of the regular distance) are also part of the marathon weekend, which is organised by SCC EVENTS. The elite running and wheelchair races are part of the World Marathon Majors, an annual series of top level races offering a $1 million prize purse. BMW is the current title sponsor for the race.\n\nThe city's flat course regularly produces fast performances and the marathon world record has been broken in Berlin on twelve occasions, particularly the most recent eight instances on the men's progression (as of September 2022). The current record was set at the 2022 edition, where Eliud Kipchoge won the men's race in 2:01:09. Tigist Assefa set a new women's course record that same year with 2:15:37.",
        "image": "berlin"
      },
      {
        "title": "Tokyo",
        "headline": "The first Tokyo Marathon was held on 18 February 2007. However, years prior to 2007, Tokyo Marathon actually consisted of two marathons - the Tokyo International Marathon which took place on even years, and Tokyo - New York Friendship International Marathon which took place on odd years. In the inaugural year, 1981, both marathons took place. However, because it was not possible to support two marathons a month apart in the same city, from 1982, the alternating format went into effect.[citation needed]\n\nThe 2007 marathon was also a representative selection race of the 2007 World Championships in Athletics in Osaka. The total number of participants was set at 30,000. Of that, 25,000 people signed up for the marathon, and 5,000 signed up for the 10K run.\n\nMasakazu Fujiwara became the race's first Japanese male winner at the fourth edition.\n\nIn February 2014, Dickson Chumba won in a record time of 2:05:42. This was only the second time a runner ran below 2h06 in Japan, after Tsegaye Kebede in Fukuoka Marathon (December 6, 2009). His runner-up, Tadese Tola did also run below 2:06, in a time of 2:05:57.\n\nIn January 2020, rock musician Hyde released the song \"Believing in Myself\" as a single inspired by the event. Due to the COVID-19 epidemic, only elite runners were invited to the 2020 Tokyo Marathon. All other participants were given a deferral to 2021.\n\nThe 2021 Tokyo Marathon was postponed to 17 October 2021 due to the pandemic. It was then postponed again to 6 March 2022; the event was still referred to as the 2021 Tokyo Marathon, and there was no 2022 Tokyo Marathon. Additionally, all overseas runners were barred from competing, with their entries automatically transferred to 2023.",
        "image": "tokyo"
      }
    ]
  }
]

