[
  {
    "name": "Marathon Training Phase",
    "elements": [
      {
        "title": "Base Building",
        "headline": "Rest well before running.",
        "image": "base"
      },
      {
        "title": "Speed Run",
        "headline": "Run easy, real easy.",
        "image": "speed"
      },
      {
        "title": "Race Specific",
        "headline": "Recovery between hard days.",
        "image": "race_specific"
      },
      {
        "title": "Tapering",
        "headline": "Fast runs, short breaks.",
        "image": "tapering"
      },
      {
        "title": "Race Day",
        "headline": "Run up the hill.",
        "image": "race_day"
      },
      {
        "title": "After Race",
        "headline": "Go far and beyond.",
        "image": "after_race"
      }
    ]
  },
  {
    "name": "Weekly Training Program",
    "elements": [
      {
        "title": "Rest Day",
        "headline": "Rest well before running.",
        "image": "rest"
      },
      {
        "title": "Easy Run",
        "headline": "Run easy, real easy.",
        "image": "easy"
      },
      {
        "title": "Recovery Run",
        "headline": "Recovery between hard days.",
        "image": "recovery"
      },
      {
        "title": "Interval Run",
        "headline": "Fast runs, short breaks.",
        "image": "fast"
      },
      {
        "title": "Hill Run",
        "headline": "Run up the hill.",
        "image": "hill"
      },
      {
        "title": "Long Run",
        "headline": "Go far and beyond.",
        "image": "long"
      }
    ]
  },
  {
    "name": "Nutrition & Hydration",
    "elements": [
      {
        "title": "Breakfast",
        "headline": "Rest well before running.",
        "image": "breakfast"
      },
      {
        "title": "Lunch",
        "headline": "Run easy, real easy.",
        "image": "lunch"
      },
      {
        "title": "Snack",
        "headline": "Recovery between hard days.",
        "image": "snack"
      },
      {
        "title": "Dinner",
        "headline": "Fast runs, short breaks.",
        "image": "dinner"
      }
    ]
  },
  {
    "name": "Gear Up For Success",
    "elements": [
      {
        "title": "Distance",
        "headline": "Rest well before running.",
        "image": "distance"
      },
      {
        "title": "Fast",
        "headline": "Run easy, real easy.",
        "image": "fast_shoe"
      },
      {
        "title": "Trail",
        "headline": "Recovery between hard days.",
        "image": "trail"
      }
    ]
  },
  {
    "name": "Inspiration from the GOAT",
    "elements": [
      {
        "title": "Eliud Kipchoge",
        "headline": "Eliud Kipchoge EGH (born 5 November 1984) is a Kenyan long-distance runner who competes in the marathon and formerly specialized at the 5000 metre distance. Widely regarded as one of the greatest marathon runners of all time, he is the 2016 and 2020 Olympic marathon champion and the world record holder in the marathon with a time of 2:01:09 set at the 2022 Berlin Marathon. He has run four of the six fastest marathons in history.\nKipchoge claimed his first individual world championship title in 2003 by winning the junior race at the World Cross Country Championships and setting a world junior record over 5000 m on the track. At the age of eighteen, he became the senior 5000 m world champion at the 2003 World Championships with a championships record, then followed with an Olympic bronze for Kenya in 2004 and a bronze at the 2006 World Indoor Championships. A five-time World Championship 5000 m finalist, Kipchoge took silver medals at the 2007 World Championships, 2008 Beijing Olympics and 2010 Commonwealth Games.",
        "image": "eliud"
      },
      {
        "title": "Mo Farah",
        "headline": "Sir Mohamed Muktar Jama Farah CBE OLY (born Hussein Abdi Kahin; 23 March 1983) is a British long-distance runner. His ten global championship gold medals (four Olympic and six World titles) make him the most successful male track distance runner ever, and he is the most successful British track athlete in modern Olympic Games history.\nFarah is the 2012 and 2016 Olympic gold medallist in both the 5,000 m and 10,000 m. He is the second athlete, after Lasse Virén, to win both the 5,000 m and 10,000 m titles at successive Olympic Games. He also completed the 'distance double' at the 2013 and 2015 World Championships in Athletics. He was the first man to defend both distance titles in both major global competitions; a feat described as the 'quadruple-double'. After finishing second in the 10,000 metres at the 2011 World Championships, Farah had an unbroken streak of ten global final wins (the 5,000m in 2011, the double in 2012, 2013, 2015 and 2016, and the 10,000m in 2017). The streak ended in Farah's final championship track race, when he finished second to Ethiopia's Muktar Edris in the 2017 5,000 metres final.",
        "image": "mo"
      },
      {
        "title": "Kenenisa Bekele",
        "headline": "Kenenisa Bekele Beyecha (Oromo: Qananiisaa baqqalaa; Amharic: ቀነኒሳ በቀለ; born 13 June 1982) is an Ethiopian long-distance runner. He was the world record holder in both the 5000-metre and 10000-metre from 2004 (5,000m) and 2005 (10,000m) until 2020. He won the gold medal in both the 5000 m and 10,000 m events at the 2008 Summer Olympics. At the 2004 Olympics, he won the gold medal in the 10,000 m and the silver medal in the 5000 m.\nHe is the most successful runner in the history of the IAAF World Cross Country Championships, with six long (12 km) course and five short (4 km) course titles. He won the 10,000 m title at the World Championships in Athletics in 2003, 2005, 2007 and 2009 (matching Haile Gebrselassie's four in a row win streak). Kenenisa was unbeaten over 10,000 m from his debut in 2003 until 2011, when he failed to finish at the World Championships final.",
        "image": "bekele"
      },
      {
        "title": "Molly Seidel",
        "headline": "Molly Seidel (born July 12, 1994) is an American long distance runner. Seidel represented the United States at the Great Edinburgh Cross Country in 2012, 2013, and 2018. In her first-ever marathon,[4] Seidel placed second at the 2020 U.S. Marathon Olympic Trials. Later, she went on to win the bronze medal in her third career marathon at the 2020 Summer Olympics in Tokyo. At the University of Notre Dame, Seidel was a 4-time NCAA champion, 6-time NCAA All-American, 6-time Atlantic Coast Conference champion and 2016 female ACC Athlete of the Year.",
        "image": "molly"
      },
      {
        "title": "Keira D'Amato",
        "headline": "Keira D'Amato (born Keira Carlstrom on October 21, 1984) is an American distance runner. She held the American women's record in the marathon with her time of 2:19:12 at the 2022 Houston Marathon, until Emily Sisson set a new record time on October 9, 2022. She is the world best holder for the women's-only 10 mile distance and a three-time USA Track & Field national champion.",
        "image": "keira"
      },
      {
        "title": "Shalane flanagan",
        "headline": "Shalane Grace Flanagan (born July 8, 1981) is an American long-distance runner, Olympic medalist and New York City Marathon champion. She was the first American woman to win the New York City Marathon since 1977. She holds the NACAC area records in both the 10k and 15k road races.\nShe won the silver medal at the 2008 Olympics in the 10,000 m (upgraded from bronze following original silver medalist’s desqualification for doping) and the bronze medal at the 2011 IAAF World Cross Country Championships. She won the Women's 2017 New York City Marathon, the first American woman to do so since Miki Gorman in 1977.",
        "image": "shalane"
      }
    ]
  },
  {
    "name": "World Marathon Majors",
    "elements": [
      {
        "title": "New York",
        "headline": "Rest well before running.",
        "image": "newyork"
      },
      {
        "title": "Boston",
        "headline": "Run easy, real easy.",
        "image": "boston"
      },
      {
        "title": "Chicago",
        "headline": "Recovery between hard days.",
        "image": "chicago"
      },
      {
        "title": "London",
        "headline": "Fast runs, short breaks.",
        "image": "london"
      },
      {
        "title": "Berlin",
        "headline": "Run up the hill.",
        "image": "berlin"
      },
      {
        "title": "Tokyo",
        "headline": "Go far and beyond.",
        "image": "tokyo"
      }
    ]
  }
]

