[
  {
    "id": 1,
    "name": "Träningsvecka 1",
    "goal": "3 träningspass 29 km",
    "plan": "Den här veckan startar vi upp vår träningen mot Stockholm Marathon 2023.\n\nUppstartsvecka i fyratimmarsprogrammet där vi visar en lite tuffare uppstart med både kort långpass direkt och ett distanspass kompletterar med några lätta fartlopp kallade koordinationslopp.\n\nEftersom programmet inte vet hur din träningshöst sett ut, kan starten vara lite väl tuff om det är så att programstarten även är din löpstart. Om du känner med dig att du inte tränat löpning tidigare, startar du upp lite lugnare än angivet genom att du springer lite kortare på söndagspasset.\n\nProgrammets grundfart på lätt distans är 5.40-5.50 min/km och utgår från ditt mål på 4 timmar. Vi springer helt enkelt distansen nästan på din maraton-tävlingsfart.\n\n- Men farten är väldigt individuell, så din lugna fart kanske inte alls ligger på programmets lugna distansfart på 5.40 min till 5.50 min per kilometer, utan den kanske ligger på 5.30 eller 6.00 minuter per kilometer för att lugn distans ska vara lugn och löpningen känns naturlig.\n\n- TA DIN lugna fart och utgå från den i programmet och följ kilometeranvisningarna, och modifiera alltså tiden till din tid över sträckan.\n\nHoppas veckan funkar bra, och det här känns som en lagom start på våra 26 veckor tillsammans!",
    "trainingDays": [
      {
        "date": "2022-12-05",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "description": "Det var ju ett lätt program det här med vila direkt!!! \n\n- Nej, vi kommer att träna också, men eftersom programmet har tisdag/torsdag/söndag som huvud träningsdagar blir det vila idag. Faktum är dock att just vilan är ett viktigt moment i alla träningsplaner.\n\nVilan bygger upp mellan alla träningspassen, men för att bygga upp behöver vi givetvis träna också.\n\nMen idag blir din träningsuppgift bara att ställa in dig mentalt på att verkligen träna för MARAN 2022; och imorgon drar vi igång själva träningen!!",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2022-12-06",
        "weekDay": "Tuesday",
        "type": "Easy Run",
        "image": "easy",
        "description": "Programmets första träningsdag, blir en lätt distanslöpning. Vi siktar på 6km, i ditt lugna distanstempo. Spring som det känns naturligt för dig, blir det 33 eller 36 minuter så är det bra. Programmet anger dock 34-35 min som riktvärde, men alltså inget som du absolut måste hålla. Spring så att du skulle kunna prata under hela Rundan då har du rätt nivå! Efter löpningen, stretchar du ut löpmusklerna. Lika bra att få in stretchen som en rutin redan från träningsstart!",
        "details": [
          {
            "name": "Easy Run",
            "distance": "6 km",
            "time": "34-35 min"
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      },
      {
        "date": "2022-12-07",
        "weekDay": "Wednesday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2022-12-08",
        "weekDay": "Thursday",
        "type": "Easy Run",
        "image": "easy",
        "description": "Lugn distans som bygger grunden, men sen kompletterar vi även med något som kallas koordinationslopp; som jag vill ha med i för att enkelt utan press och stress aktivera dina löpmuskler något annorlunda än via distans och långpass löpningen. Koordinationsloppen är lite snabbare löpning över 60-100 meter, där vi springer med bra teknik, jobbar med snabbheten på ett mjukt sätt. Vi kommer ha momentet framöver, men oftast i uppvärmningen inför kvalitativ löpning. Försök ha med momentet, utan att pressa eller stressa och riskera sträckningar. Vilan mellan dina koordinationer är lugn gång tillbaks till startpunkten. Idag introducerar vi detta med 3 x 80-100 meter. Har du ingen sträcka tar du 5x20 sekunder för enkelhet skull (utan att det ska vara din fart) Kör gärna lite lätt rörlighet innan du kör igång koordinationsloppen. Spring fint och högt; se dig själv som en snyggt springande elitlöpare....med aktiv framfot. OBS; är det mycket vintrigt och halt avvaktar du att introducera koordinationsloppen.",
        "details": [
          {
            "name": "Easy Run",
            "distance": "6 km",
            "time": "34-35 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Coordination Run",
            "distance": "3 x 80-100 m"
          }
        ]
      },
      {
        "date": "2022-12-09",
        "weekDay": "Friday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2022-12-10",
        "weekDay": "Saturday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2022-12-11",
        "weekDay": "Sunday",
        "type": "Long Run",
        "image": "long",
        "description": "Programmet rivstartar med långpass direkt. Dagens pass förutsätter dock att du haft lite löpning tidigare i din höstträning och inte bara sedan programmet startade i tisdags. Om du känner med dig att 17km är för långt kortar du ner till så långt som känns bra.\n\nLugn fin fart, gärna snäppet lugnare än din distanslöpning. Riktfart ligger på 5.50-6.00 min per km, men du ska alltså ta din lugna fart och sen ger det just din tid över 17km. Stretcha ut lätt efter passet, och tänk gärna på att ta med dricka ut på passet redan nu, även om tiden ute just idag inte kräver vätska.\n\nOm du har med dig vätskan nu, sätter du direkt en bra rutin som du har nytta av när långpassen blir längre!",
        "details": [
          {
            "name": "Long Run",
            "distance": "17 km",
            "time": "100-104 min"
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      }
    ]
  },
  {
    "id": 2,
    "name": "Träningsvecka 2",
    "goal": "3 träningspass 34 km",
    "plan": "Träningen är igång och vi fortsätter med 3 träningspass även denna veckan, men utvecklar träningen genom att lägga på ett allmänt styrkepass i samband med tisdagens löpning.\n\nGällande styrkan, är det ett pass som kommer att återkomma regelbundet varje vecka. Löpning är lite ensidigt, och dels för att förbättra vår prestation under löpningen och dels för att förebygga förslitningsskador är det bra att ha ett allmänt styrkepass varje vecka för att balansera upp kroppens muskelgrupper.\n\nHar du naturligt styrka genom något annat eget pass i veckan, kan du räkna det som din styrka och ta bort programmets styrka.\n\nUtvecklar träningen gör vi även på torsdagen där målet är att du ska springa ett tröskelpass. Bekvämt snabb löpning, något snabbare än din distans; men inte pressa trots att vi delar upp 30 minuter i 10 intervalldelar. Så INTE intervall, utan bara några snäpp snabbare än din distansfart med regelbunden vila. Så ett LÄTT pass :)\n\nLångpasset lägger vi till 1 km så målbild där är 18 km i din lugna fart. Men korta detta om det känns för mastigt för dig i din uppstart!",
    "trainingDays": [
      {
        "date": "2022-12-12",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "description": "Träningen är igång och vi fortsätter med 3 träningspass även denna veckan, men utvecklar träningen genom att lägga på ett \"allmänt styrkepass\" i samband med tisdagens löpning.\n\nGällande styrkan, är det ett pass som kommer att återkomma regelbundet varje vecka. Löpning är lite ensidigt, och dels för att förbättra vår prestation under löpningen och dels för att förebygga förslitningsskador är det bra att ha ett allmänt styrkepass varje vecka för \"att balansera upp\" kroppens muskelgrupper.\n\nHar du naturligt styrka genom något annat eget pass i veckan, kan du räkna det \"som din styrka\" och ta bort programmets styrka.\n\nUtvecklar träningen gör vi även på torsdagen där målet är att du ska springa ett tröskelpass. Bekvämt snabb löpning, något snabbare än din distans; men inte pressa trots att vi delar upp 30 minuter i 10 intervalldelar. Så INTE intervall, utan bara några snäpp snabbare än din distansfart med regelbunden vila. Så ett LÄTT pass :)\n\nLångpasset lägger vi till 1 km så målbild där är 18 km i din lugna fart. Men korta detta om det känns för mastigt för dig i din uppstart!",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2022-12-13",
        "weekDay": "Tuesday",
        "type": "Easy Run",
        "image": "easy",
        "description": "6km i din lugna distansfart, kompletterat med styrketräning. Har du \"egen styrketräning\" i samband med något annat pass i veckan, tar du det som din styrka. Men har du inget styrkepass, tycker jag det vore bra om du kan få in programmets styrka en gång i veckan. Målet med styrkan är att den ska hjälpa dig få en bra hållning i din löpning och att den på sikt är skadeförebyggande. Ett förslag på ett enkelt styrkeupplägg som du kan köra hemma ger vi här. Men du kan givetvis komponera din egen styrka. Fokus blir att ha med övningar för bålen (mage/rygg).\n\nLöpstyrke-övningarna finns beskriva på länken \"Löpstyrka\" Avsluta styrkepasset med grundlig stretch. Bra att minst en gång i veckan ha en \"avsatt tid stretchingpass\".",
        "details": [
          {
            "name": "Easy Run",
            "distance": "6 km",
            "time": "34-35 min"
          },
          {
            "name": "Running Strength",
            "time": "15-30 min"
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      },
      {
        "date": "2022-12-14",
        "weekDay": "Wednesday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2022-12-15",
        "weekDay": "Thursday",
        "type": "Fast Run",
        "image": "fast",
        "description": "Det är långt kvar till vårt slutmål, så vi ska inte köra riktigt tuffa pass redan nu, men vi ska redan från start jobba med något som kallas tröskellöpning.\n\n\"Tröskelbegreppet\" innebär att du ska springa kring den högsta fart du kan över angiven sträcka utan att ansamla trötthetsämnen i musklerna. (Ofta kallat mjölksyra). Lite svårt att beskriva, men det kan om du är ovan bara vara några snäpp snabbare än din distanslöpning och ju mer van du är vid passet ju närmare kan du ligga just din gräns och våga trycka på något mer.\n\n- Så försök hitta läget där du ligger på lagom och blir sådär \"lagom trött\". Då kommer du flytta din tröskel ett litet snäpp med hjälp av passet.\n\nSå här i början får det gärna hellre gå lite för långsamt än fört fort. Så bekvämt trött!\n\nInnan du kör igång huvudmomentet tar du en kort lugn distansuppvärmning och lite rörlighet.\n\nSen är du redo för start och målet idag blir att köra 10 x 3 minuter tröskel. Totalt 30 minuters tröskellöpning. Ta 30 sekunders vila med lätt jogg eller gång mellan varje avsnitt.\n\nMärk väl att det är just TRÖSKEL och inte intervall, även om vi just idag delar upp det i så många kortare löpningar.\n\nVill du ha en riktfart och inte bara gå på känsla kan ett riktvärde vara Runt 5.20-5.25 min/km, så något snabbare än din tilltänkta mara-fart. Den farten kommer ge dig Runt 550 meter per varje 3 minuters avsnitt.\n\nVarva ner med lugn jogg som avslutning på passet och stretch kort ut löpmusklerna.",
        "details": [
          {
            "name": "Warm up",
            "distance": "2.5 km",
            "time": "15 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Threshold Run",
            "distance": "Ca 5.5 km",
            "time": "10x3min"
          },
          {
            "name": "CoolDown",
            "distance": "2 km",
            "time": "12 min"
          }
        ]
      },
      {
        "date": "2022-12-16",
        "weekDay": "Friday",
        "type": "Rest Day",
        "image": "recovery",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2022-12-17",
        "weekDay": "Saturday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2022-12-18",
        "weekDay": "Sunday",
        "type": "Long Run",
        "image": "long",
        "description": "Progressionen i ditt långpass har startat, och vi ökar på med 1 km jämfört med förra veckan. Som alltid \"riktfarter\" men du ska utgå från just din lugna fart. Om du körde kortare förra veckan, eller känner att uppstarten varit för tuff och du behöver lite mjukare start kortar du ner långpasset något. Lämpligt att öka 1,5-2 km jämfört med förra veckan, för dig som körde kortare då.\n\nOm du inte redan har skaffat ett vätskebälte, kan det vara läge nu; så att du redan vid \"våra korta\" långpass tar med vätska ut på passet. Vätskan förbättrar prestationen och orken under passen, och hjälper till så att din återhämtning blir snabbare tillsammans med ett bra intag med energi direkt efter avslutat pass. Vatten räcker dock bra under passet, men ju längre det blir desto mer nytta kan du, mentalt och fysiskt, ha av lite nytta svagt blandad sportdryck.\n\nStretcha ut löpmusklerna lätt efter ditt långa pass!",
        "details": [
          {
            "name": "Long Run",
            "distance": "18 km",
            "time": "106-109 min"
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      }
    ]
  },
  {
    "id": 3,
    "name": "Träningsvecka 3",
    "goal": "4 träningspass 44 km",
    "plan": "Julvecka men programmet och din träning rullar vidare.\n\n- Vi inleder som vanligt med distans och styrka och sen blir det tröskeltorsdag där tröskeln utvecklas ett litet snäpp. På julafton finns chans till \"bästa\" (ja i alla fall nästan) julklappen med en fin lite längre morgonjogg.\n\nSlutligen avrundas julveckan med ett långpass med stegaktivering om ditt vinterunderlag och temperatur tillåter.\n\nSom helhet; anpassa upplägget här till just din julvecka och din känsla",
    "trainingDays": [
      {
        "date": "2022-12-19",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "description": "Julvecka men programmet och din träning rullar vidare. - Vi inleder som vanligt med distans och styrka och sen blir det tröskeltorsdag där tröskeln utvecklas ett litet snäpp. På julafton finns chans till \"bästa\" (ja i alla fall nästan) julklappen med en fin lite längre morgonjogg. Slutligen avrundas julveckan med ett långpass med stegaktivering om ditt vinterunderlag och temperatur tillåter. Som helhet; anpassa upplägget här till just din julvecka och din känsla",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2022-12-20",
        "weekDay": "Tuesday",
        "type": "Easy Run",
        "image": "easy",
        "description": "Lugn fart och en Runda på 6 km följt av programmets styrka om du inte har egen styrka i samband med något annat pass i din träningsvecka",
        "details": [
          {
            "name": "Easy Run",
            "distance": "6 km",
            "time": "34-36 min"
          },
          {
            "name": "Running Strength",
            "time": "15-20 min"
          },
          {
            "name": "Stretching",
            "time": "10 min"
          }
        ]
      },
      {
        "date": "2022-12-21",
        "weekDay": "Wednesday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2022-12-22",
        "weekDay": "Thursday",
        "type": "Threshold Run",
        "image": "fast",
        "description": "Precis som förra veckan har programmet ett tröskelpass till dig. Körde du inte passet förra veckan och känner dig osäker på upplägget, gå tillbaks och kolla in texten där. Hur som blir upplägget lite annorlunda idag jämfört med förra veckan. Precis som då startar du dock med en kort distansuppvärmning och lite rörlighet. Vill du kan du även köra en lätt pulshöjande koordinationslöpning, men se till att ha uppvärmningen just bara uppvärmande. Upplägget på tröskelträningen idag blir tröskellöpningar med något längre löptid än sist. Kör 6 x 5 minuter, och ta något längre jogg/gångvila än förra gången med 45 sekunder vila nu mellan varje tröskelavsnitt. Totalt 30 minuters tröskeltid, och riktfart om du vill ha det även om din känsla är viktigast (bekvämt trött!) blir som förra veckan Runt 5.20-5.25 min/km vilket ger dig Runt 5,5 km totalt och lite drygt 900 meter per 5 minuters avsnitt. Har du ingen fartangivelse eller så kör du på känsla 6 x 5 minuter i din bekvämt snabba fart med 45 sekunders vila. Varva ner med lugn jogg och lite stretch, så har du ännu ett bra grundpass!",
        "details": [
          {
            "name": "Warm up",
            "distance": "2.5 km",
            "time": "15 min"
          },
          {
            "name": "DynamicMovement",
            "time": "5 min"
          },
          {
            "name": "DynamicMovement",
            "time": "5 min"
          },
          {
            "name": "Coordination Race",
            "distance": "1x80m"
          },
          {
            "name": "Threshold Run",
            "distance": "Ca 5.5 km",
            "time": "6x5min"
          },
          {
            "name": "CoolDown",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      },
      {
        "date": "2022-12-23",
        "weekDay": "Friday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2022-12-24",
        "weekDay": "Saturday",
        "type": "Morning Run",
        "image": "easy",
        "description": "Frivillig juklapp med en morgonjogg inleder julafton. Det är en tradition här i programmet. Men känn ingen press, får du inte in passet står du bara över. ...och såklart god jul från Coach Szalkai",
        "details": [
          {
            "name": "Morning Run",
            "distance": "10 km",
            "time": "58-62 min"
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      },
      {
        "date": "2022-12-25",
        "weekDay": "Sunday",
        "type": "Long Run",
        "image": "long",
        "description": "Idag ett fint jul-långpass med mål att få till samma distanslängd som förra veckan på långpasset med tillägget ett litet fartinslag för att ändra steget under ditt långpass.\n\nDetta utgår givetvis från att du har ok vinterunderlag för att kunna öka farten och att vädret i övrigt medger lite högre puls och andning.\n\nKör lugnt i Runt en timme, och sedan lägger du in 5 x 1 minut fartökning med 1 minut lugnt mellan varje fartdel.\n\nDet är inte intervall, utan tanken är att du höjer farten på dina 1 minuters med Runt 15-20 sekunder snabbare i kilometerfart än den grundfart du har på passet i övrigt.\n\nPå den lugna minuten du har mellan varje fartökning tar du något långsammare fart än du normalt har som din grundfart på långpasset.\n\nEfter fartinslaget återgår du till din grundfart och fullföljer dagens 18 km sträcka.\n\nI övrigt ska du tänka på att ta med vätska under långpasset även om det är vinter. Vid så här \"korta långpass\" kan vatten räcka bra, men eftersom vi ska köra lite fortare kan det även kännas bra att få lite energi via sportdryck.\n\nTänk också på att få i dig energi så fort som möjligt efter passet så påskyndar du din återhämtning efter passet. Ta en banan eller kanske en återhämtningsdryck direkt efter avslutat pass.",
        "details": [
          {
            "name": "Long Run",
            "distance": "18 km",
            "time": "105-109 min"
          },
          {
            "name": "Stretching",
            "time": "10 min"
          }
        ]
      }
    ]
  },
  {
    "id": 4,
    "name": "Träningsvecka 4",
    "goal": "4 träningspass 39 km",
    "plan": "Nyårsvecka där vi bryter av allt \"långt\" med ett pass korta grundbyggande intervaller. Därefter vanlig tröskeltorsdag följt av lugn frivillig nyårsjogg.\n\n(Kör du nyårslopp? ja då tar du bara bort programmets tröskelpass och kör ditt lopp istället)\n\nPå nyårsdagen kör långpasset vidare och där börjar vi nu vara ute riktigt lång tid; så se till att vara noga där med energi och vätska in direkt efter passet och på med torra kläder. Då motar vi alla baciller och optimerar så att återhämtningen kan starta direkt!\n\n(Ok ta bort nyårslångpasset om det inte funkar i din nyårshelg!)",
    "trainingDays": [
      {
        "date": "2022-12-26",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "description": "Nyårsvecka där vi bryter av allt \"långt\" med ett pass korta grundbyggande intervaller. Därefter vanlig tröskeltorsdag följt av lugn frivillig nyårsjogg.\n\n(Kör du nyårslopp? ja då tar du bara bort programmets tröskelpass och kör ditt lopp istället)\n\nPå nyårsdagen kör långpasset vidare och där börjar vi nu vara ute riktigt lång tid; så se till att vara noga där med energi och vätska in direkt efter passet och på med torra kläder. Då motar vi alla baciller och optimerar så att återhämtningen kan starta direkt!\n\n(Ok ta bort nyårslångpasset om det inte funkar i din nyårshelg!)",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2022-12-27",
        "weekDay": "Tuesday",
        "type": "Interval Run",
        "image": "fast",
        "description": "I den fas vi är i programmet nu ska du inte luras och skrämmas av korta intervaller. Det är och ska vara ett pass där du \"bara\" ska vara lagom trött. Ett \"enkelt sätt\" att jobba med din kondition och syreupptagning samtidigt som du muskulärt kommer jobba lite med dina snabbare muskelfibrer. Värm upp med lätt jogg, rörlighet och några koordinationslopp. Sedan vår kortintervall, där vi för att farten inte ska bli för hög kommer att ha riktigt kort vila. Vi springer 10 x 200 m eller om du springer på \"klocka\" tar du 10 x 50 sekunder. Vilan är stående 30 sekunder, vilket innebär att du inte ska springa för fort utan bara några snäpp snabbare än din distanslöpning. Hitta din rytm och om du känner att det känns bra kan du på dom 2-3 sista intervallerna pressa på lite mer om du känner för det, men totalt ett \"lagom pass\". Riktfart om du vill ha det kan vara att ligga en bit över 4.00 min/km i fart. Varva ner med lugn jogg och stretcha ut musklerna grundligt efter att du lagt in veckans löparstyrka. Så ett mastigt pass idag med många moment!",
        "details": [
          {
            "name": "Warm up",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Coordination Race",
            "distance": "1x80m"
          },
          {
            "name": "Interval Run",
            "distance": "10x200m",
            "time": "10x50s"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Running Strength",
            "time": "10-20 min"
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      },
      {
        "date": "2022-12-28",
        "weekDay": "Wednesday",
        "type": "Rest Day",
        "image": "recovery",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2022-12-29",
        "weekDay": "Thursday",
        "type": "Threshold Run",
        "image": "fast",
        "description": "Idag är målet att utveckla tröskelpasset ett snäpp för dig som kör!\n\n- Som tidigare ska du hitta farten mellan bekvämt och obekvämt fort, eller om vi utgår från prat-tempo ska du kunna säga en mening då och då, men inte prata hela tiden...\n\nVi siktar 3 x 10 minuter tröskel, eller om du utgår från sträcka blir det 3 x 1,8-1,9 km då riktfarten ligger på Runt 5,20-5.25 min/km.\n\nVi tar 60 sekunders gå/lätt joggvila mellan tröskelavsnitten. Vill/behöver du ta ståvila för att det ska kännas bekvämt tufft tar du helt stående vila.\n\nMen sänk hellre tempot så du orkar gå/småjogga mellan varje tröskelavsnitt.\n\nDå håller du dessutom värmen bättre :) Varva ner med lugn jogg.\n\nHar du ett nyårslopp i din plan? Ja då tar du såklart bort dagens tröskel och ersätter med loppet på nyårsafton!",
        "details": [
          {
            "name": "Warm up",
            "distance": "2.5 km",
            "time": "15 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Coordination Race",
            "distance": "1x80m"
          },
          {
            "name": "Threshold Run",
            "distance": "Ca 5.5 km",
            "time": "3x10min"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Stretching",
            "time": "5 min"
          }
        ]
      },
      {
        "date": "2022-12-30",
        "weekDay": "Friday",
        "type": "Rest Day",
        "image": "recovery",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2022-12-31",
        "weekDay": "Saturday",
        "type": "Morning Run",
        "image": "easy",
        "description": "Årets sista pass med programmet kan du kan ta bort om du vill ha löpfri dag. Kroppen kanske inte känner för löpning eller så är de kanske tight få in löpning just idag. Så frivilligt.... blir årets sista pass!",
        "details": [
          {
            "name": "Morning Run",
            "distance": "4 km",
            "time": "23-25 min"
          }
        ]
      },
      {
        "date": "2023-01-01",
        "weekDay": "Sunday",
        "type": "Long Run",
        "image": "long",
        "details": [
          {
            "name": "Long Run",
            "distance": "19 km",
            "time": "112-116 min"
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      }
    ]
  },
  {
    "id": 5,
    "name": "Träningsvecka 5",
    "goal": "4 träningspass 45 km",
    "plan": "2023 års första vecka och givetvis tränar vi på som tidigare just för att det nya året ska bli ett riktigt bra löparår!\n\nInga nyheter riktigt utan du känner igen dig; kontinuitet är ledordet och för kontinuitet är både lugnare och tuffare viktiga. Så denna veckan lugn inledning följt av bra tröskel och långpass igen.",
    "trainingDays": [
      {
        "date": "2023-01-02",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "description": "2023 års första vecka och givetvis tränar vi på som tidigare just för att det nya året ska bli ett riktigt bra löparår!\n\nInga nyheter riktigt utan du känner igen dig; kontinuitet är ledordet och för kontinuitet är både lugnare och tuffare viktiga. Så denna veckan lugn inledning följt av bra tröskel och långpass igen.",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-01-03",
        "weekDay": "Tuesday",
        "type": "Easy Run",
        "image": "easy",
        "details": [
          {
            "name": "Easy Run",
            "distance": "10 km",
            "time": "57-60 min"
          },
          {
            "name": "Stretching",
            "time": "10 min"
          }
        ]
      },
      {
        "date": "2023-01-04",
        "weekDay": "Wednesday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-01-05",
        "weekDay": "Thursday",
        "type": "Threshold Run",
        "image": "fast",
        "description": "Vi kör vidare med tröskeltorsdag, och utvecklar nu passet lite till med en ännu lite längre sammanhängande löpning. Totalt 30 minuter igen men fartbitarna blir enligt modellen 12-10-8 minuter eller om du kör på distansmätare ca 2 km- 1,85 km- 1,5 km. Vi tar 2 minuters gång eller viss del lugn jogg som vila mellan varje tröskelavsnitt.\n\nInled första 12 minuters tröskeln soft, för att sen jobba på lite tuffare. Målbild att du håller ungefär 5.25 min/km på 12 minutaren, 5.15-5.20 fart på 10 minuters tröskeln och sen kan du tillåta dig släppa tröskelfarten lite och snabbare än din tröskel på andra halvan av 8 minuters, så kanske ner mot 5.05-5.10 min/km på avslutningen av 8 minutaren.\n\nFarterna förutsätter att vintern är ok hos dig och om du utgår från ansträngning så ser du till att 12 minutaren känns lagom (lite snabbare än distanslöpning) och sen vågar du bli trött på avslutande 8 minuters.\n\nVarva sen ner som vanligt med lugn jogg och stretch.",
        "details": [
          {
            "name": "Warm up",
            "distance": "2 km",
            "time": "11-12 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Coordination Race",
            "distance": "2x80m"
          },
          {
            "name": "Threshold Run",
            "distance": "Ca 5.5 km",
            "time": "12-10-8 min"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Stretching",
            "time": "5 min"
          }
        ]
      },
      {
        "date": "2023-01-06",
        "weekDay": "Friday",
        "type": "Rest Day",
        "image": "recovery",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-01-07",
        "weekDay": "Saturday",
        "type": "Easy Run",
        "image": "easy",
        "description": "Extrapass erbjuds. Ta bort om det känns som det kan bli för mycket för dig eller om du inte har tiden.",
        "details": [
          {
            "name": "Easy Run",
            "distance": "6 km",
            "time": "34-35 min"
          },
          {
            "name": "Stretching",
            "time": "5 min"
          }
        ]
      },
      {
        "date": "2023-01-08",
        "weekDay": "Sunday",
        "type": "Long Run",
        "image": "long",
        "description": "Lugnt långpass där vi närmar oss halvmara-gränsen! Ta med dricka, och anpassa fart efter underlag och känsla i kroppen. Lugnt ska vara lugnt för just dig och just idag. Startade du upp med kortare långpass än vad programmet angav kan du fortsatt köra någon km kortare även nu.",
        "details": [
          {
            "name": "Long Run",
            "distance": "20 km",
            "time": "119-122 min"
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      }
    ]
  },
  {
    "id": 6,
    "name": "Träningsvecka 6",
    "goal": "4 träningspass 43 km",
    "plan": "En bra vecka mängdmässigt och kvalité mässigt.\n\nFarten består grundbyggande 200 meters intervaller på känsla och på torsdagspasset ska du jobba lite längre i din tilltänkta marafart\n\nMarafarten blir det även på långpasset som vi kör i ett för programmet nytt upplägg.\n\nIstället för att springa en lång Runda i vårt långpasstempo ska vi samla ihop långpassvolym genom olika tröskelavsnitt. Målbilden är att passet ska ge den volym som vi hade på långpasset förra veckan, men nu uppdelat men i gengäld högre fart. Detta är en långpass-variant som finns i många elitlöpares upplägg, och som vi nu testar på även här. Målet är att du kommer jobba med din syreupptagning (kondition) på ett skonsamt sätt samtidigt som du både fysiskt och mentalt tränar på att hålla på lång till i högre fart än långpass-tempo.\n\nTänk på att alla pass ute ska anpassas till vintern som råder hos dig. Våga anpassa om det behövs för att belastningen inte ska bli för tuff!",
    "trainingDays": [
      {
        "date": "2023-01-09",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "description": "En bra vecka mängdmässigt och kvalité mässigt. Farten består grundbyggande 200 meters intervaller på känsla och på torsdagspasset ska du jobba lite längre i din tilltänkta marafart Marafarten blir det även på långpasset som vi kör i ett för programmet nytt upplägg. Istället för att springa en lång Runda i vårt långpasstempo ska vi samla ihop långpassvolym genom olika tröskelavsnitt. Målbilden är att passet ska ge den volym som vi hade på långpasset förra veckan, men nu uppdelat men i gengäld högre fart. Detta är en långpass-variant som finns i många elitlöpares upplägg, och som vi nu testar på även här. Målet är att du kommer jobba med din syreupptagning (kondition) på ett skonsamt sätt samtidigt som du både fysiskt och mentalt tränar på att hålla på lång till i högre fart än långpass-tempo. Tänk på att alla pass ute ska anpassas till vintern som råder hos dig. Våga anpassa om det behövs för att belastningen inte ska bli för tuff!",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-01-10",
        "weekDay": "Tuesday",
        "type": "Interval Run",
        "image": "fast",
        "details": [
          {
            "name": "Warm up",
            "distance": "3 km",
            "time": "17-18 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Coordination Race",
            "distance": "3x80m"
          },
          {
            "name": "Interval Run",
            "distance": "2x5x200m",
            "time": ""
          },
          {
            "name": "Cool Down",
            "distance": "3 km",
            "time": "18 min"
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      },
      {
        "date": "2023-01-11",
        "weekDay": "Wednesday",
        "type": "Rest Day",
        "image": "recovery",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-01-12",
        "weekDay": "Thursday",
        "type": "Marathon Pace Run",
        "image": "fast",
        "details": [
          {
            "name": "Warm up",
            "distance": "1 km",
            "time": "6 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Coordination Race",
            "distance": "1x80m"
          },
          {
            "name": "Marathon Pace Run",
            "distance": "8 km",
            "time": "43-48 min"
          },
          {
            "name": "Cool Down",
            "distance": "1 km",
            "time": "7 min"
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      },
      {
        "date": "2023-01-13",
        "weekDay": "Friday",
        "type": "Rest Day",
        "image": "recovery",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-01-14",
        "weekDay": "Saturday",
        "type": "Easy Run",
        "image": "easy",
        "details": [
          {
            "name": "Easy Run",
            "distance": "5 km",
            "time": "28-29 min"
          },
          {
            "name": "Running Strength",
            "time": "15-30 min"
          },
          {
            "name": "Stretching",
            "time": "10 min"
          }
        ]
      },
      {
        "date": "2023-01-15",
        "weekDay": "Sunday",
        "type": "Long Run",
        "image": "long",
        "description": "Inget traditionellt långpass idag, utan målet är att via ”tröskelavsnitt” samla ihop den volymen som du hade på ditt långpass förra veckan. Ha med dig att om passet KÄNNS FÖR TUFFT, kan du enkelt omvandla det till ett ”vanligt” långpass i din lugna grundfart. Men coachen hoppas såklart att det känns bra och du vill testa på upplägget som har som mål puffa din kondition/tröskelfart och din mentala och fysiska styrka att springa lite snabbare även när vi springer långt!\n\nSom inledning och avslutning på passet ska du springa i din normala ”lugna” långpassfart. Det är pratfart som gäller, och känslan ska vara lugn. Både inledningen och avslutningen skapar lite av dagens ”km-volym”.\n\nMellan inledningen och avslutningen är tanken att du ska jobba med din maratonfart och din tröskelfart uppdelat i olika kilometeravsnitt med lugn löpvila (eller gåvila) mellan varje mara/tröskelfart del. Detta kommer bygga upp volymen på passet\n\nVårt volymmål med hela passet totalt är idag 20 km och både inledning, fartdelarna och avslutningen kan vara lite flexibla så du kan anpassa detta efter din Runda. Men ett förslag på upplägg ser du nedan inkl riktfarter som du givetvis anpassar till eventuellt vinterunderlag och kyligt väder.\n\nHar du ingen klocka som anger fart går du på känsla där du ska våga ”ligga på” lite mer under fartdelarna än vad du normalt har på ditt långpass och något mer fart på känsla ju kortare fartdel.\n\nInledning och avslutning i 6.00 tempo, och vilolöpningen mellan varje fart-del går i Runt 6.10-6.20 tempo.\n\nInledning ca 5 km. (Ok stanna till och köra några minuters effektiv rörlighet, efter distansinledningen)\n\nFartdelar 3 km - 2 km - 2 km - 1 km – 1 km – 1km (totalt 10 km fart och ca 2,5 km vila)\n\nMellan varje 3-4 minuters lugn löpning. Vill gruppen/coacherna köra på exakt längd på ”vilan” blir det ”jogg” 500 meter.\n\nAvslutning blir Runt 2,5 km förutsatt löpvila på ca 500 meter mellan varje fartdel. På avslutningen kan total distansen justeras så du når 20 km distansmålet.\n\nRiktfarterna:\n\n3 km – 5.41 min/km (maratonfart)\n\n2 km – 5.33 min/km\n\n1 km – 5.23 min/km där du får om du vill trycka på lite extra på sista 1 km ner till Runt 5.11 min/km.",
        "details": [
          {
            "name": "Long Run",
            "distance": "20 km",
            "time": ""
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      }
    ]
  },
  {
    "id": 7,
    "name": "Träningsvecka 7",
    "goal": "3 träningspass 37 km",
    "plan": "Inledningen på veckan ska vara riktigt lugn, och just fartleken är ett bra pass att ha i en vecka som ska vara lugnare eftersom din känsla och din kropp helt styr hur hårt eller hur lugnt det passet blir. Men ha med dig övergripande att måndag till lördag ska vara \"återhämtande\" men ändå underhålla allt vi byggt upp!\n\nLyssna på din kropp, eftersom program ju tyvärr inte känner av hur det känns för dig. Ha med dig att en lugn vecka nu följs av tuff träning kommande veckor!",
    "trainingDays": [
      {
        "date": "2023-01-16",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "description": "Inledningen på veckan ska vara riktigt lugn, och just fartleken är ett bra pass att ha i en vecka som ska vara lugnare eftersom din känsla och din kropp helt styr hur hårt eller hur lugnt det passet blir. Men ha med dig övergripande att måndag till lördag ska vara \"återhämtande\" men ändå underhålla allt vi byggt upp! Lyssna på din kropp, eftersom program ju tyvärr inte känner av hur det känns för dig. Ha med dig att en lugn vecka nu följs av tuff träning kommande veckor!",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-01-17",
        "weekDay": "Tuesday",
        "type": "Easy Run",
        "image": "easy",
        "description": "Lätt KORT distans, kompletterat med styrkan för dig som följer programmets styrka.",
        "details": [
          {
            "name": "Easy Run",
            "distance": "6 km",
            "time": "34-35 min"
          },
          {
            "name": "Running Strength",
            "time": "15-30 min"
          },
          {
            "name": "Stretching",
            "time": "10 min"
          }
        ]
      },
      {
        "date": "2023-01-18",
        "weekDay": "Wednesday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-01-19",
        "weekDay": "Thursday",
        "type": "FartlekRun",
        "image": "fast",
        "details": [
          {
            "name": "Warm up",
            "distance": "2 km",
            "time": "11-12 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Coordination Race",
            "distance": "3x80m"
          },
          {
            "name": "Fartlek Run",
            "distance": "6 km",
            "time": "33 min"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Stretching",
            "time": "5 min"
          }
        ]
      },
      {
        "date": "2023-01-20",
        "weekDay": "Friday",
        "type": "Rest Day",
        "image": "recovery",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-01-21",
        "weekDay": "Saturday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-01-22",
        "weekDay": "Sunday",
        "type": "Long Run",
        "image": "long",
        "description": "21 lugn km på långpasset idag. Hitta din fart och tänk på att tiden ute på passet är viktigare än att jaga snitt-fart. Hitta din rytm och drick regelbundet under hela passet!",
        "details": [
          {
            "name": "Long Run",
            "distance": "21 km",
            "time": "124-128 min"
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      }
    ]
  },
  {
    "id": 8,
    "name": "Träningsvecka 8",
    "goal": "3 träningspass 38.90 km",
    "plan": "Bra trepass vecka där våra korta intervaller återkommer för att du ska få jobba med ett annat steg än vid distans/Tröskel och för att du ska jobba lite med din konditionsutveckling.12 x 200 meter rakt av blir veckans fartpass.\n\n- Men innan dess kör vi distans och styrka på tisdagen och sen jobbar vi upp långpasset till en halvmara på söndag!\n\nSå riktigt långt på söndagen, men i just ditt lugna långpass tempo. Hoppas allt känns bra och du är laddad för ett nytt trappsteg i din träning.",
    "trainingDays": [
      {
        "date": "2023-01-23",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "description": "Bra trepass vecka där våra korta intervaller återkommer för att du ska få jobba med ett annat steg än vid distans/Tröskel och för att du ska jobba lite med din konditionsutveckling.12 x 200 meter rakt av blir veckans fartpass.\n\n- Men innan dess kör vi distans och styrka på tisdagen och sen jobbar vi upp långpasset till en halvmara på söndag!\n\nSå riktigt långt på söndagen, men i just ditt lugna långpass tempo. Hoppas allt känns bra och du är laddad för ett nytt trappsteg i din träning.",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-01-24",
        "weekDay": "Tuesday",
        "type": "Easy Run",
        "image": "easy",
        "details": [
          {
            "name": "Easy Run",
            "distance": "10 km",
            "time": "58-60 min"
          },
          {
            "name": "Running Strength",
            "time": "15-30 min"
          },
          {
            "name": "Stretching",
            "time": "10 min"
          }
        ]
      },
      {
        "date": "2023-01-25",
        "weekDay": "Wednesday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-01-26",
        "weekDay": "Thursday",
        "type": "Interval Run",
        "image": "fast",
        "description": "Våra korta intervaller återkommer; nu med 5 fler intervaller än senast vi körde passet och ingen serievila utan 12 x 200 meter rakt av. Värm upp med lätt jogg, rörlighet och några koordinationslopp.\n\nSedan kort intervallerna, där vi alltså springer 12 x 200 m eller om du springer på \"klocka\" tar du 12 x 50 sekunder.Vilan är stående/gående 40 sekunder, vilket ger att du kan komma upp i steget och hålla bra fart utan att för den skull pressa ur allt. Ha en växel sparad. Det är och ska vara ett pass där du \"bara\" ska vara lagom trött. Ett \"enkelt sätt\" att jobba med din kondition och syreupptagning samtidigt som du muskulärt kommer jobba lite med dina snabbare muskelfibrer.\n\nRiktfart om du vill ha det kan vara att ligga i 4.10-4.15 min/km i fart. (Ger 50-51 sekunder per 200 meter)\n\nVarva ner med lugn jogg och stretcha ut musklerna grundligt. Vader och baksidor lårmuskel brukar ansträngas lite extra av \"överfarten\".",
        "details": [
          {
            "name": "Warm up",
            "distance": "2.5 km",
            "time": "15 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Coordination Race",
            "distance": "2 x 80m"
          },
          {
            "name": "Interval Run",
            "distance": "12 x 200m",
            "time": "12 x 50s"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Stretching",
            "time": "10 min"
          }
        ]
      },
      {
        "date": "2023-01-27",
        "weekDay": "Friday",
        "type": "Rest Day",
        "image": "recovery",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-01-28",
        "weekDay": "Saturday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-01-29",
        "weekDay": "Sunday",
        "type": "Long Run",
        "image": "long",
        "description": "Ett steg upp...nu passerar vi ett halvt maraton med nästan 1 km extra!!\n\n- 22 km i din lugna fart. Ta gärna och lägg in kort promenadavsnitt i samband med att du dricker; för dricka måste du ha med dig ut på passet!\n\nÄr du inte riktigt redo eller vädret inte riktigt långpassvänligt är det förstås helt okej att du kortar ner något!",
        "details": [
          {
            "name": "Long Run",
            "distance": "22 km",
            "time": "128-134 min"
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      }
    ]
  },
  {
    "id": 9,
    "name": "Träningsvecka 9",
    "goal": "4 träningspass 44 km",
    "plan": "Tuff vecka igen! Hoppas allt känns bra för tanken är nu att vi ska ta nästa steg i träningstrappan och få till så att Runt 4 mil i veckan blir normalveckor, eller iallafall nästan normalveckor.\n\nProgressiv eller stegrad distans och styrka som inledning på veckan. Sen på torsdagen lättar vi upp steget med en intervallstege. Sen blir det fartinslag och stegväxling även i långpasset om vintern tillåter.",
    "trainingDays": [
      {
        "date": "2023-01-30",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-01-31",
        "weekDay": "Tuesday",
        "type": "Easy Run",
        "image": "easy",
        "description": "Uppvärmning och nedvarvning med 1km. Kör även lite rörlighet innan \"start\" på huvudmomentet som blir fortsatt distanslöpning men i progressivt ökande fart om allt känns ok.\n\nBörja i lite snabbare tempo än ditt lugna distanstempo och öka sedan upp efterhand på känsla så att du under de två sista kilometrarna springer \"riktigt fort\".\n\nEtt tufft pass, men du ska alltså bara vara trött på slutet, så ändå skonsamt för psyket. Gå på känsla, och målbilden blir att ha klart under din maratävlingsfart över dina 6km. (Programmet räknar på 5.20 i snitt, med 5.40 första km och sen ner till 5.00/5.10 på slutet)",
        "details": [
          {
            "name": "Warm up",
            "distance": "1 km",
            "time": "6 min"
          },
          {
            "name": "Easy Run",
            "distance": "6 km",
            "time": "32 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Cool Down",
            "distance": "1 km",
            "time": "6 min"
          },
          {
            "name": "Running Strength",
            "time": "15-30 min"
          },
          {
            "name": "Stretching",
            "time": "10 min"
          }
        ]
      },
      {
        "date": "2023-02-01",
        "weekDay": "Wednesday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-02-02",
        "weekDay": "Thursday",
        "type": "Interval Run",
        "image": "fast",
        "description": "Idag ska vi köra en intervallsteg som först \"går uppåt\" och sedan vänder Runt och \"går nedåt igen\". Totalt 16 minuters intervalltid. Först som vanligt en bra uppvärmning. Sedan när du är redo för stegen som innebär 1-2-3-4-3-2-1 minuters intervall med 1 minuts gång/ståvila mellan varje intervall. Målbilden är att få lite fartvariation, så ju kortare intervall ju snabbare fart och gärna också att dom avslutande 3-2-1 minuters blir snabbare än dina inledande 1-2-3. Så gå ut lugnt och ha fin harmoni upp till 4 minuters intervallen; och sen när det blir kortare och kortare intervall kan du gå på igen.\n\n- 1 minuter; Runt 4.20 min/km i fart\n\n- 2 minuters Runt 4.30-4.35 min/km i fart\n\n- 3 minuters Runt 4.45 min/km\n\n- 4 minuters Runt 4.50-5.00 min/km\n\nSen alltså snäppet snabbare på avslutande 3-2-1 min än dina inledande motsvarande intervallsträckor räknat i tid.\n\nObservera att din känsla dock är viktigare än riktfart! Hitta din hitta på passet.\n\nPusta ut och varva ner med någon kilometers lugn löpning och lite stretch för dina löparmuskler.",
        "details": [
          {
            "name": "Warm up",
            "distance": "2.5 km",
            "time": "14-15 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Coordination Race",
            "distance": "2x80m"
          },
          {
            "name": "Interval Run",
            "time": "1-2-3-4-3-2-1 min"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Stretching",
            "time": "5 min"
          }
        ]
      },
      {
        "date": "2023-02-03",
        "weekDay": "Friday",
        "type": "Rest Day",
        "image": "recovery",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-02-04",
        "weekDay": "Saturday",
        "type": "Easy Run",
        "image": "easy",
        "description": "Extrapasset, för volym och bra muskulär effekt i kombination med morgondagens långpass. Passa på att ta ett rörlighetsinslag för att just bevara din rörlighet.",
        "details": [
          {
            "name": "Easy Run",
            "distance": "6 km",
            "time": "35 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          }
        ]
      },
      {
        "date": "2023-02-05",
        "weekDay": "Sunday",
        "type": "Rest Day",
        "image": "rest",
        "description": "LIngen ökning i distanslängd idag men i gengäld är målet ett långpass med fartökning inlagt - förutsatt att det funkar med vintern hos dig.\n\nTanken är att du idag lägger in 3 x 5 minuter fartökningar med 2 minuters lugn löpning mellan varje fartdel. Låt fartdelen komma Runt halvvägs in i passet, men viktigare än \"när farten kommer\" är att just fatinslaget passar in på din Runda.\n\nFör att få en bra känsla på denna fartdel kan du lägga in en 1 minuters \"växla steget fartdel\" innan du kör igång 5 minuters fartdelarna. Kör \"minuten\" i din bekvämt snabba fart, och låt den få upp benens fart/steg och pulsen.\n\nTa 1-2 minuter lugn löpning efter denna \"uppvärmande\" fartdel, innan du sedan inleder dina 5 minuters fartdelar.\n\nMålbilden i fart på dina \"5 minuters\" är att hålla din maratonsnittfart för att nå tidsmålet eller till och med något snabbare. Så konkret kan din målbild vara 5.30-5.40 i minuter per kilometer.\n\nVi sätter 2 minuters som lugn fart mellan fartdelarna men denna del kan vara lite flexibel, så du kan få till dina 5 minuters fartdelar på en relativt flack sträcka. Farten på den lugnare delan kan vara Runt 10-15 sekunder långsammare i min/km än din normala långpassfart.\n\nEfter fartinslaget tar du några minuter riktigt lugnt innan du sedan hittar in till din normala långpassfart och fullföljer passet så du når dagens distansmål.\n\nGlöm inte ta med dricka ut på passet, och ta gärna något me energi innan du kör igång fartdelen!\n\nOBS; skulle vintern inte \"tillåta\" fartinslag idag, ja då kör du ett vanligt långpass och skippar fartdelarna.",
        "details": [
          {
            "name": "Long Run",
            "distance": "22 km"
          },
          {
            "name": "Dynamic Movement",
            "time": "5-10 min"
          }
        ]
      }
    ]
  },
  {
    "id": 10,
    "name": "Träningsvecka 10",
    "goal": "4 träningspass 49.80 km",
    "plan": "Riktig mängdvecka med fyra träningspass för dom som känner att det fungerar; med det kan vi totalt nå lite magiska 5 mil på en vecka!\n\nLångpasset fortsätter öka, och nu är vi uppe i drygt ett \"halvt lopp\" och vi är ändå inte ens halvvägs in i programmet; så där ligger du bra till!!\n\nNytt i veckans träning är torsdagens långintervaller. Kör det passet på känsla. Om väder, underlag eller din kropp inte är 100% måste du tänka på att inte titta för mycket på riktfart, utan utgå från din känsla. Ett tufft pass, men du ska inte vara helt slut. Helheten är viktigare än enskilda pass!",
    "trainingDays": [
      {
        "date": "2023-02-06",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "description": "Riktig mängdvecka med fyra träningspass för dom som känner att det fungerar; med det kan vi totalt nå lite magiska 5 mil på en vecka!\n\nLångpasset fortsätter öka, och nu är vi uppe i drygt ett \"halvt lopp\" och vi är ändå inte ens halvvägs in i programmet; så där ligger du bra till!!\n\nNytt i veckans träning är torsdagens långintervaller. Kör det passet på känsla. Om väder, underlag eller din kropp inte är 100% måste du tänka på att inte titta för mycket på riktfart, utan utgå från din känsla. Ett tufft pass, men du ska inte vara helt slut. Helheten är viktigare än enskilda pass!",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-02-07",
        "weekDay": "Tuesday",
        "type": "Easy Run",
        "image": "easy",
        "description": "Lite längre distanspass som efter en kort uppvärmning ska vara maratonfarten för programmets tidsmål. (eller ditt tidsmål). Långt pass totalt sätt, men förhoppningsvis inte ett pass där du är helt slut (för det ska du inte vara) så du orkar komplettera med styrkan, om du inte har egenstyrka.",
        "details": [
          {
            "name": "Warm up",
            "distance": "1 km",
            "time": "6 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Marathon Pace Run",
            "distance": "9 km",
            "time": "50-52 min"
          },
          {
            "name": "Cool Down",
            "distance": "1 km",
            "time": "6 min"
          },
          {
            "name": "Running Strength",
            "time": "15-30 min"
          },
          {
            "name": "Stretching",
            "time": "10 min"
          }
        ]
      },
      {
        "date": "2023-02-08",
        "weekDay": "Wednesday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-02-09",
        "weekDay": "Thursday",
        "type": "Interval Run",
        "image": "fast",
        "description": "Idag är tanken att vi ska köra långintervaller. Vi värmer upp som vanligt med lugn distansfart, lätt rörlighet och koordinationslopp innan intervallstart. Därefter springer du på relativt flackt underlag antingen en uppmätt 800 meters sträcka eller på klockan angiven tid eller utifrån klockans distansmätare. Målet är att ha klart högre fart än vid din distanslöpning, och det ska vara ett relativt tufft pass. Viktigt att du inte springer på för fort på första intervallen, eftersom det då lätt blir ett oharmoniskt pass med mjölksyra i benen redan från början. Starta lagom, och ha som mål att sista intervallen ska vara din snabbaste. Vi siktar in oss på att klara hela 6 intervaller, känns det för mycket tar du en eller två intervaller mindre. Vila 1 minut stillastående mellan varje intervall. Så passet i förkortning; 6x800 meter eller 6 x 3.45 med 1 minuts vila. (riktfart Runt 4.45 min/km) Vi kommer öka farten något på intervallerna längre fram i programmet. Varva ner med lugn löpning och sen avslutande bra stretch för löpmusklerna. Målet är att ha klart högre fart än vid din distanslöpning, och det ska vara ett relativt tufft pass. Viktigt att du inte springer på för fort på första intervallen, eftersom det då lätt blir ett oharmoniskt pass med mjölksyra i benen redan från början. Starta lagom, och ha som mål att sista intervallen ska vara din snabbaste. Vi siktar in oss på att klara hela 6 intervaller, känns det för mycket tar du en eller två intervaller mindre. Vila 1 minut stillastående mellan varje intervall. Så passet i förkortning; 6x800 meter eller 5x3.45 med 1 minuts vila. (riktfart Runt 4.45 min/km) Vi kommer öka farten något på intervallerna längre fram i programmet. Varva ner med lugn löpning och sen avslutande bra stretch för löpmusklerna.",
        "details": []
      },
      {
        "date": "2023-02-10",
        "weekDay": "Friday",
        "type": "Rest Day",
        "image": "recovery",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-02-11",
        "weekDay": "Saturday",
        "type": "Easy Run",
        "image": "easy",
        "description": "Lätt extradistans för lite mer volym i din mängdvecka och för att få en riktigt bra muskulär träningseffekt på helgens pass.\n\nÄr 4 pass på veckan för mycket är det detta pass du tar bort, samma om du är sliten. Då vilar du idag och fokuserar på ett bra 23 km pass imorgon.",
        "details": [
          {
            "name": "Easy Run",
            "distance": "7 km",
            "time": "40-41 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          }
        ]
      },
      {
        "date": "2023-02-12",
        "weekDay": "Sunday",
        "type": "Easy Run",
        "image": "easy",
        "description": "Vi ökar på långpasset med 1 km. Ta din lugna fart, och gå eller kör det små joggandes när du dricker efter ungefär var 20:e minut. Stretcha ut lätt efter passet. Är du sliten av den senaste tidens träning kan du korta ner något, men försök vara ute över minst 1 timme och 45 minuter och ta lite lugnare fart istället.",
        "details": [
          {
            "name": "Long Run",
            "distance": "23 km",
            "time": "134-140 min"
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      }
    ]
  },
  {
    "id": 11,
    "name": "Träningsvecka 11",
    "goal": "3 träningspass 39.90 km",
    "plan": "Veckan är tänkt som en lite lättare vecka, men jag vet inte riktigt om nästan 4 mil är lättare? Jo nu är det det!! Så se till att veckan första pass blir riktigt lugnt och anpassa tröskelpasset efter hur du känner dig allmänt och givetvis efter yttre omständigheter.\n\nSöndagens långpass är det som drar upp veckans volym, då passet nu sticker iväg till hela 24 km. Fixar du det i lugn fart, tycker jag du ligger bra till i träningsplanen mot Asics Stockholm Marathon!\n\nMen om du är sliten kortar du ner tröskeln till 2 x 10 min eller långpasset till Runt 2 mil.",
    "trainingDays": [
      {
        "date": "2023-02-13",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "description": "Veckan är tänkt som en lite lättare vecka, men jag vet inte riktigt om nästan 4 mil är lättare? Jo nu är det det!! Så se till att veckan första pass blir riktigt lugnt och anpassa tröskelpasset efter hur du känner dig allmänt och givetvis efter yttre omständigheter. Söndagens långpass är det som drar upp veckans volym, då passet nu sticker iväg till hela 24 km. Fixar du det i lugn fart, tycker jag du ligger bra till i träningsplanen mot Asics Stockholm Marathon! Men om du är sliten kortar du ner tröskeln till 2 x 10 min eller långpasset till Runt 2 mil.",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-02-14",
        "weekDay": "Tuesday",
        "type": "Easy Run",
        "image": "easy",
        "description": "Lätt distanslöpning kompletterat styrka!\n\nStyrkan med samma upplägg som förra veckan för er som inte kör egen styrka.",
        "details": [
          {
            "name": "Easy Run",
            "distance": "6 km",
            "time": "34-35 min"
          },
          {
            "name": "Running Strength",
            "time": "15-30 min"
          },
          {
            "name": "Stretching",
            "time": "10 min"
          }
        ]
      },
      {
        "date": "2023-02-15",
        "weekDay": "Wednesday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-02-16",
        "weekDay": "Thursday",
        "type": "Threshold Run",
        "image": "fast",
        "description": "30 minuters tröskellöpning uppdelat i 3x10 minuter med 1,5 minuters stå/lätt joggvila. Riktfart Runt 5.25 min/km och då ger 10 minuter Runt 1,8 km.\n\nHitta farten där du ligger på eller strax under den fart där kroppen börjar ansamla mjölksyra.\n\nTanken är alltså att du ska hitta ett tempo som du klarar hålla utan att ta ut dig fullständigt. Som alltid är känslan viktigare än riktfarten, speciellt om väder/underlag inte är gynnsamt och eftersom veckan ska vara något \"lugnare\" är det också viktigt att passet inte blir för hårt just för dig i fart och ansträngning.",
        "details": [
          {
            "name": "Warm up",
            "distance": "2.5 km",
            "time": "14-15 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Coordination Race",
            "distance": "2x80m",
            "time": "3 min"
          },
          {
            "name": "Threshold Run",
            "distance": "3x1.8 km",
            "time": "3x10 min"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Stretching",
            "time": "10 min"
          }
        ]
      },
      {
        "date": "2023-02-17",
        "weekDay": "Friday",
        "type": "Rest Day",
        "image": "recovery",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-02-18",
        "weekDay": "Saturday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-02-19",
        "weekDay": "Sunday",
        "type": "Long Run",
        "image": "long",
        "description": "Riktigt långt idag. Lugn fart som du anpassar efter underlag och väder, så att det känns lugnt för just dig. Ok att korta ner 1-2 km utan att det påverkar \"att du skulle komma efter\". Ta med dricka ut på passet, och var noga med torra kläder och snabb energi/vätskeintag efter att du är klar med passet.",
        "details": [
          {
            "name": "Long Run",
            "distance": "24 km",
            "time": "140-147 min"
          },
          {
            "name": "Stretching",
            "time": "10 min"
          }
        ]
      }
    ]
  },
  {
    "id": 12,
    "name": "Träningsvecka 12",
    "goal": "4 träningspass 48 km",
    "plan": "Vi pulserar upp igen till mycket ansenlig mängd och bra träning!! Inledning med \"maradistanspasset\" och sen på torsdagen drar vi igång din och programmets backlöpning med löpskolning i uppvärmningen!!\n\nMedger inte vinterunderlaget backlöpning/löpskolning, så omvandlar du passet till någon fartlek. Kör du backen på löpband (vilket är helt ok) så kan du lägga på löpskolningen vid något annat pass som du kör ute. (tisdag eller lördag, för det är svårt köra löpskolning på band)\n\nHoppas du hittar rätt, och \"skräms\" inte av momentet backe. Du ska bli trött, men absolut inte slut. Backen ger bra bäst effekt om du just springer lagom i den tidiga period vi är i nu!!Kör du ut allt på det passet är det lätt att du både bränner psyket och även fysiskt. Se träningen som en stor helhet, och då får inga enskilda pass bli för tuffa!\n\nPå söndag kommer en justering i programmet med ett helt nytt pass som coachen kallar maratontusingar. Målbilden är att passet ska ge långpassvolym, men att du samlar ihop volymen via 16 x 1 km i något snabbare än din planerade snittfart på maran.\n\nMålet med passet är att du kommer jobba med din syreupptagning (kondition) på ett skonsamt sätt samtidigt som du både fysiskt och mentalt tränar på att hålla på lång tid i högre fart än långpasstempo.",
    "trainingDays": [
      {
        "date": "2023-02-20",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "description": "Vi pulserar upp igen till mycket ansenlig mängd och bra träning!! Inledning med \"maradistanspasset\" och sen på torsdagen drar vi igång din och programmets backlöpning med löpskolning i uppvärmningen!!\n\nMedger inte vinterunderlaget backlöpning/löpskolning, så omvandlar du passet till någon fartlek. Kör du backen på löpband (vilket är helt ok) så kan du lägga på löpskolningen vid något annat pass som du kör ute. (tisdag eller lördag, för det är svårt köra löpskolning på band)\n\nHoppas du hittar rätt, och \"skräms\" inte av momentet backe. Du ska bli trött, men absolut inte slut. Backen ger bra bäst effekt om du just springer lagom i den tidiga period vi är i nu!!Kör du ut allt på det passet är det lätt att du både bränner psyket och även fysiskt. Se träningen som en stor helhet, och då får inga enskilda pass bli för tuffa!\n\nPå söndag kommer en justering i programmet med ett helt nytt pass som coachen kallar maratontusingar. Målbilden är att passet ska ge långpassvolym, men att du samlar ihop volymen via 16 x 1 km i något snabbare än din planerade snittfart på maran.\n\nMålet med passet är att du kommer jobba med din syreupptagning (kondition) på ett skonsamt sätt samtidigt som du både fysiskt och mentalt tränar på att hålla på lång tid i högre fart än långpasstempo.",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-02-21",
        "weekDay": "Tuesday",
        "type": "Marathon Pace Run",
        "image": "fast",
        "description": "Känna in din marafart i distanspasset idag. 1 km lugnt först och sen är målet hela 10 km i din tilltänkta marafart; om allt känns ok och underlaget/temperaturen är löpvänlig.\n\nVill inte kroppen; då tar du en 10-12 km i din för dagen lugna fart.",
        "details": [
          {
            "name": "Warm up",
            "distance": "1 km",
            "time": "6 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Marathon Pace Run",
            "distance": "10 km",
            "time": "56 min"
          },
          {
            "name": "Cool Down",
            "distance": "1 km",
            "time": "6 min"
          },
          {
            "name": "Running Strength",
            "time": "15-30 min"
          },
          {
            "name": "Stretching",
            "time": "10 min"
          }
        ]
      },
      {
        "date": "2023-02-22",
        "weekDay": "Wednesday",
        "type": "Rest Day",
        "image": "recovery",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-02-23",
        "weekDay": "Thursday",
        "type": "Hill Run",
        "image": "hill",
        "description": "Två nya moment i träningsprogrammet i dagens pass.\n\n- Huvudmomentet \"Lång backe\"\n\n- Löpstyrke och teknikmomentet löpskolning.\n\nVärm upp med distansjogg till någon backe du känner till. Backen ska inte vara \"alltför brant\" utan fint löpbar hela vägen. Är det \"vintrigt underlag\" får du anpassa efter det och springa lugnt och även köra löpskolningen lugnt.\n\nEfter uppjoggen, kör du lite lätt rörlighet och sen i början av \"din backe\" kör du löpskolning innan själva backpasset.\n\nLöpskolningsövningar kör du på en 20 meters sträck upp i din backe. Vila gång ner. Vi börjar med att köra en omgång av varje övning, och \"bara introducerar\" rörelsemönstret.\n\n1x20m av:\n\n1. Låg Skip\n\n2. Hög Skip\n\n3. Sprettsteg\n\n4. Mångsteg\n\n5. Hälkick varje\n\n(se video för utförandet)\n\nEfter hälkicken har du fått upp pulsen lite och kan starta din \"backe\".\n\nFokus att hitta rätt i passet och springa \"lagom i backen\".\n\nMålbilden är att ha ungefär 60 sekunder i uppförslöpningen. (50-70 sekunder ok). Du springer fint och kontrollerat uppför, och blir lite lagom strött. Stanna och vila några sekunder på \"toppen\" eller där du vänder, och jogga sedan ner lugnt till starten. Upprepa och spring totalt 17-19 minuter i backen. I \"totaltiden\" räknar du in både löpningen uppför och joggen utför och även lilla vilotiden på toppen. (ha klockan rullande).\n\nVarva ner som vanligt lugnt och stretcha ut musklerna grundligt eftersom löpskolningen och backen säker har \"dragit ihop\" dina muskler lite extra.",
        "details": [
          {
            "name": "Warm up",
            "distance": "3 km",
            "time": "17-18 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Running Drill",
            "distance": "1x20m",
            "time": "5 min"
          },
          {
            "name": "Hill Run",
            "distance": "3 km",
            "time": "17-19 min"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Stretching",
            "time": "10 min"
          }
        ]
      },
      {
        "date": "2023-02-24",
        "weekDay": "Friday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-02-25",
        "weekDay": "Saturday",
        "type": "Easy Run",
        "image": "easy",
        "description": "Extrapasset för volym till veckans träning. Ok att skippa detta pass för vila eller för ev andra träningsaktiviteter du har. Målet 4.00 är \"uppnåligt\" även utan lördagspassen även om det vissa veckor är bra att ha helgens dubbelpass kombinationseffekt!\n\nMen som sagt lyssna till din kropp, och anpassa efter vad du har tid till!Prio att vara sugen på för programmet nya \"maratontusingar\" imorgon - fysiskt och mentalt!",
        "details": [
          {
            "name": "Easy Run",
            "distance": "6 km",
            "time": "34-35 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          }
        ]
      },
      {
        "date": "2023-02-26",
        "weekDay": "Sunday",
        "type": "Marathon Pace Run",
        "image": "fast",
        "description": "Idag ska vi köra ett nytt inslag i programmet som coachen kallar ”maratontusingar”, och det innebär helt enkelt att du i stället för ett vanligt långpass ska samla ihop långpassvolym genom att springa många ”lugna” 1 km intervaller.\n\nI långpassvolymen som skapas räknar vi även in upp och nedvarvning med 2-3km.\n\nSå inled passet med lugn löpning några kilometrar. Stanna till och kör lite rörlighet för dina leder/ligament och löpmuskler. Vill du kan du även lägga in någon enkel och uppmjukande löpskolningsövning. Sedan är du redo starta dina 1 km intervaller.\n\nEn målbild gällande fart kan vara att springa Runt 25-35 sekunder snabbare i minuter per kilometer än ditt normala långpasstempo. För att få optimalt upplägg kan du med fördel starta de första 1 km intervallerna lite långsammare/lugnare än angiven ”riktfart”, så kanske ”bara” 20 sekunder snabbare än långpasstempot, för att sedan ha kapacitet att öka farten lite efterhand och att den sista 1 km intervallen blir den snabbaste – trots att du då har som mest volym i benen.\n\nAntalet intervaller anpassar vi utifrån hur lång tid intervallerna tar, så ju snabbare löpare desto fler intervaller.\n\nSå för dig med 4:00 som tidsmål siktar vi idag på att springa 16 x 1 km och riktfarten efter att du kommit igång blir Runt 5:35 ner till 5:25 min/km om vi utgår från 6:00 min/km i långpasstempo.\n\nVilan mellan varje ”maratontusing” tar du 45-60 sekunders stående/gående vila.\n\nÄven om det inte är ett långpass, kommer du med upp och nedvarvning vara ute länge, så ta gärna med dricka ut på passet, och just idag när du ska springa fortare kan det vara läge att dryck med energi på några av vilorna eller någon energigel. (eller annat du gillar)\n\nMentalt; tänk inte på hur många du har kvar i början utan fokusera på din löpteknik, att springa avslappnat men ändå ”aktivt”, för nu ska du ju ha lite mer aktivt steg än ditt normala långpass-steg. Efter ett tag är det ”bara” några intervaller kvar, och då kan du börja räkna ner!\n\nEfter sista intervallen pustar du ut innan du avslutar passet med några kilometers lugn nedvarvning och avslutade lätt rörlighet för löpmusklerna som fått jobba!",
        "details": [
          {
            "name": "Warm up",
            "distance": "3 km",
            "time": "ca 18 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Marathon Pace Run",
            "distance": "16 x 1 km",
            "time": "Runt 100 min"
          },
          {
            "name": "Cool Down",
            "distance": "3 km",
            "time": "ca 18 min"
          }
        ]
      }
    ]
  },
  {
    "id": 13,
    "name": "Träningsvecka 13",
    "goal": "4 träningspass 48.90 km",
    "plan": "Nu är vi snart halvvägs i programmet mot maran. Hoppas allt känns ok, för här kommer en tuff vecka igen. TVÅ kvalitativa pass och rekordlångt långpass. Är du sliten tar du bort lördagspasset och om vi ska prioritera ett av de kvalitativa passen blir denna veckan tröskelpasset om du hade backe förra veckan. Om du tar bort backen, se till att löpskolningen hålls vid liv vid något av de andra passen.",
    "trainingDays": [
      {
        "date": "2023-02-27",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "description": "Nu är vi snart halvvägs i programmet mot maran. Hoppas allt känns ok, för här kommer en tuff vecka igen. TVÅ kvalitativa pass och rekordlångt långpass. Är du sliten tar du bort lördagspasset och om vi ska prioritera ett av de kvalitativa passen blir denna veckan tröskelpasset om du hade backe förra veckan. Om du tar bort backen, se till att löpskolningen hålls vid liv vid något av de andra passen.",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-02-28",
        "weekDay": "Tuesday",
        "type": "Threshold Run",
        "image": "fast",
        "description": "3x10 minuter med 1,5 minuters stå/lätt joggvila. Riktfart som tidigare Runt 5.25 min/km och då ger 10 minuter Runt 1,8 km. Du behöver inte pressa hårdare än tidigare, utan träningsenheten är den som kommer utveckla dig!\n\nSom alltid är känslan viktigare än riktfarten så hitta din fart mellan bekvämt och obekvämt snabbt!!",
        "details": [
          {
            "name": "Warm up",
            "distance": "2.5 km",
            "time": "14-15 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Coordination Race",
            "distance": "2x80m",
            "time": "3 min"
          },
          {
            "name": "Threshold Run",
            "distance": "3x1,8km",
            "time": "3x10 min"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Stretching",
            "time": "5 min"
          }
        ]
      },
      {
        "date": "2023-03-01",
        "weekDay": "Wednesday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-03-02",
        "weekDay": "Thursday",
        "type": "Hill Run",
        "image": "hill",
        "description": "Långbacke och löpskolning som du har känslan kvar för upplägget från förra veckan?!\n\nVärm upp med distansjogg till någon backe du känner till. Backen ska inte vara \"alltför brant\" utan fint löpbar hela vägen.\n\nEfter uppjoggen, kör du lite lätt rörlighet och sen i början av \"din backe\" kör du löpskolning innan själva backpasset.\n\nLöpskolningsövningar kör du på en 20 meters sträck upp i din backe. Vila gång ner. Vi ökar på till 2x20 meter av alla övningarna eller om du tycker det är mycket väljer du övning 2-4-5.\n\n1x20m av:\n\n1. Låg Skip\n\n2. Hög Skip\n\n3. Sprettsteg\n\n4. Mångsteg\n\n5. Hälkick varje\n\nEfter hälkicken har du fått upp pulsen lite och kan starta din \"backe\".\n\nFokus att hitta rätt i passet och springa \"lagom i backen\".\n\nMålbilden är att ha ungefär 60 sekunder i uppförslöpningen. (50-70 sekunder ok). Du springer fint och kontrollerat uppför, och blir lite lagom strött. Stanna och vila några sekunder på \"toppen\" eller där du vänder, och jogga sedan ner lugnt till starten. Upprepa och spring totalt 17-19 minuter i backen. I \"totaltiden\" räknar du in både löpningen uppför och joggen utför och även lilla vilotiden på toppen. (ha klockan rullande).",
        "details": [
          {
            "name": "Warm up",
            "distance": "3 km",
            "time": "17-18 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Running Drill",
            "distance": "2x20m"
          },
          {
            "name": "Hill Run",
            "distance": "3 km",
            "time": "17-19 min"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Stretching",
            "time": "5 min"
          }
        ]
      },
      {
        "date": "2023-03-03",
        "weekDay": "Friday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-03-04",
        "weekDay": "Saturday",
        "type": "Easy Run",
        "image": "easy",
        "description": "Lätt distans och veckans styrka här.",
        "details": [
          {
            "name": "Easy Run",
            "distance": "6 km",
            "time": "34-35 min"
          },
          {
            "name": "Running Strength",
            "time": "15-30 min"
          },
          {
            "name": "Stretching",
            "time": "10 min"
          }
        ]
      },
      {
        "date": "2023-03-05",
        "weekDay": "Sunday",
        "type": "Long Run",
        "image": "long",
        "description": "Långpasset tuffar på med \"pers\" igen. 25km idag om allt känns bra. Din lugna fart, så inga konstigheter. Dricka under/efter och energi efter. Bra att nu ev även ha med lite \"energi ut på passet\". Antingen i form av sportdryck om du inte redan kör det, eller i form av något \"sött\" som kan höja blodsockret lite på slutet av passet!",
        "details": [
          {
            "name": "Long Run",
            "distance": "25 km",
            "time": "149-152 min"
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      }
    ]
  },
  {
    "id": 14,
    "name": "Träningsvecka 14",
    "goal": "3 träningspass 47 km",
    "plan": "3 pass vecka, som ska vara något lättare även om mängden ändå är bra. \n\nBacke och marafart i veckan och sen trummar långpasset vidare till hela 26 km nu; förutsatt att allt känns bra för dig. \n\n- Så en mkt bra vecka även om det för en del av er säkert känns som lite lite.",
    "trainingDays": [
      {
        "date": "2023-03-06",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "description": "3 pass vecka, som ska vara något lättare även om mängden ändå är bra.\n\nBacke och marafart i veckan och sen trummar långpasset vidare till hela 26 km nu; förutsatt att allt känns bra för dig.\n\n- Så en mkt bra vecka även om det för en del av er säkert känns som lite lite..",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-03-07",
        "weekDay": "Tuesday",
        "type": "Hill Run",
        "image": "hill",
        "description": "Långbackpasset återkommer med samma upplägg som förra veckan men vi ökar på med 5 min till i själva backen.\n\nUppvärmningsjogg, rörlighet och sen löpskolningen över 2x20m innan backpass-start;\n\n1. Låg Skip\n\n2. Hög Skip\n\n3. Sprettsteg\n\n4. Mångsteg\n\n5. Hälkick varje\n\nI backen fokus på bra steg; driv med hela steget och frånskjut ända från \"tårna\". SPRING \"FINT\", som om någon drar din kropp \"uppåt i ett snöre\" utan att tappa kraften framåt...Svårt, men spring!!\n\nBacken ger oavsett steg, teknik en bra träning för just ditt steg och teknik och därtill bra konditionsträning!",
        "details": [
          {
            "name": "Warm up",
            "distance": "3 km",
            "time": "17-18 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Running Drill",
            "distance": "2x30m",
            "time": "10 min"
          },
          {
            "name": "Hill Run",
            "distance": "4 km",
            "time": "23-25 min"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Stretching",
            "time": "5 min"
          }
        ]
      },
      {
        "date": "2023-03-08",
        "weekDay": "Wednesday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-03-09",
        "weekDay": "Thursday",
        "type": "Marathon Pace Run",
        "image": "fast",
        "description": "Marafartpass och styrkan känner du igen. Snäppet snabbare än distansen och din rytm till maran!",
        "details": [
          {
            "name": "Warm up",
            "distance": "1 km",
            "time": "6 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Marathon Pace Run",
            "distance": "10 km",
            "time": "56 min"
          },
          {
            "name": "Cool Down",
            "distance": "1 km",
            "time": "6 min"
          },
          {
            "name": "Running Strength",
            "time": "15-30 min"
          },
          {
            "name": "Stretching",
            "time": "10 min"
          }
        ]
      },
      {
        "date": "2023-03-10",
        "weekDay": "Friday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-03-11",
        "weekDay": "Saturday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-03-12",
        "weekDay": "Sunday",
        "type": "Long Run",
        "image": "long",
        "description": "26 km i din för dagen lugna fart. Distansen och tiden ute är det tuffa, och inte farten. Dricka med och energi och vätska in efter dina dryga 2,5 timmar idag.",
        "details": [
          {
            "name": "Long Run",
            "distance": "26 km",
            "time": "155-157 min"
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      }
    ]
  },
  {
    "id": 15,
    "name": "Träningsvecka 15",
    "goal": "4 träningspass 51.50 km",
    "plan": "En lite lagom vecka, med 3-4 pass beroende på om du vill komma ut på en lugn runda på lördagen.\n\n- Vi inleder veckan lugnt med distans. På torsdag blir det tröskel uppdelad i 1 km avsnitt och sen avrundar vi veckan med ett långt långpass igen.\n\nI långpasset lägger du in en fartökningsdel om allt känns bra. Förhoppningsvis i lite vårväder!",
    "trainingDays": [
      {
        "date": "2023-03-13",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "description": "En lite lagom vecka, med 3-4 pass beroende på om du vill komma ut på en lugn runda på lördagen.\n\n- Vi inleder veckan lugnt med distans. På torsdag blir det tröskel uppdelad i 1 km avsnitt och sen avrundar vi veckan med ett långt långpass igen.\n\nI långpasset lägger du in en fartökningsdel om allt känns bra. Förhoppningsvis i lite vårväder!",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-03-14",
        "weekDay": "Tuesday",
        "type": "Easy Run",
        "image": "easy",
        "description": "Distans anpassat i fart efter hur känslan för dig just idag. Inget pressat pass utan fokus på att komplettera löpningen med styrkan som vanligt för er som följer programmets styrka.",
        "details": [
          {
            "name": "Easy Run",
            "distance": "8 km",
            "time": "46-48 min"
          },
          {
            "name": "Running Strength",
            "time": "15-30 min"
          },
          {
            "name": "Stretching",
            "time": "10 min"
          }
        ]
      },
      {
        "date": "2023-03-15",
        "weekDay": "Wednesday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-03-16",
        "weekDay": "Thursday",
        "type": "Threshold Run",
        "image": "fast",
        "description": "Idag återkommer vårt tröskelpass, men idag kör vi ett harmoniskt pass uppdelat i 1 km avsnitt. Så tröskel-tusingar helt enkelt.\n\nVad är då skillnaden mot 1 km intervaller? Jo, farten.\n\n- Det ska inte vara ett pressat pass fartmässigt utan du ska flyta på i bekvämt snabb fart.\n\n45 sekunders stående eller lätt joggande vila mellan varje \"tröskeltusing\".\n\nInnan tröskelstart kör vi som vanligt en uppvärmning med lugn uppvärmande distans, följt av rörlighet. Kort effektiv löpskolning och en pulshöjande koordination.\n\nSen kör du igång tröskelpasset. Målbild är 7 x 1 km och din riktfart blir runt 5.10-5.15 min/km i tempo. Inled kanske något långsammare så du hittar harmoni och sen på sista kan du trycka på något snabbare I gengäld.\n\nVarva ner med lugn jogg följt av stretch/rörlighet.",
        "details": [
          {
            "name": "Warm up",
            "distance": "2.5 km",
            "time": "14-15 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Running Technique",
            "distance": "2x30m",
            "time": "10 min"
          },
          {
            "name": "Coordination Race",
            "distance": "1x80m"
          },
          {
            "name": "Threshold Run",
            "distance": "7x1 km"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      },
      {
        "date": "2023-03-17",
        "weekDay": "Friday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-03-18",
        "weekDay": "Saturday",
        "type": "Easy Run",
        "image": "easy",
        "description": "Veckans extrapass. Prioritera långpasset imorgon om du tycker det blir för tufft med två pass i rad eller om du inte hittar träningstid på helgen till båda passen.Men om tid finns, kroppen är ok; kör en lugn fin halvtimme som bygger ytterligare grund mot din mara!",
        "details": [
          {
            "name": "Easy Run",
            "distance": "5 km",
            "time": "29-30 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          }
        ]
      },
      {
        "date": "2023-03-19",
        "weekDay": "Sunday",
        "type": "Long Run",
        "image": "long",
        "description": "Idag kör vi långpass med ett fartinslag igen. Så ingen ökning i tid eller kilometerlängd, utan istället ligger fokus på att få in en fartdel. Känner du redan från början på passet att det kan bli tufft med fart idag, då skippar du det långa fartinslaget (km-delarna) och kör bara inledande 30-45-60 sekunder för att få växla steg i ditt långpass.\n\nStarta upp långpasset i din vanliga fart och kör rulla på till ungefär halva sträckan av dagens totala distansmål. Bestäm vart fartinslaget utifrån var det passar in på din runda. Fartdelen inleds med 30 sekunders snabb löpning, 1 minut lugnt, 45 sekunder snabbt, 1 minut lugnt, 60 sekunder snabbt och därefter 2 minuter lugnt. På dessa fartdelar är fokus att du ska jobba med bra teknik och få fart på benen och få upp pulsen lite. Upplägget ska vara din bekvämt snabba farten och ingen fokus här att ha någon riktfart. Spring på känsla, och spring snyggt. \n\nKom upp i steget och försöka spring med stolt hållning, så kommer du koppla in outnyttjad muskelkraft.\n\nEfter 2 minuter lugn grundfart efter 60 sekunders fartökningen kommer huvudfartdelen där det blir några kilometerfartdelar.\n\nFartdelarna blir 3 km- 1 km- 1 km.\n\nRiktfarter:\n\n3 km 5.30-5.35 min/km.\n\n1 km 5.10-5.15 min/km.\n\nMellan varje km-fartökningsdel är det 2 minuters lugn långpassgrundfart eller ännu lugnare som gäller. (Behöver du kan du gå en liten bit på 2 minuters ”vilodelen”) På sista fartökningsdelen kan du öka på ännu tuffare på sista minuten av km-fartdelen. Men inte så fort så du riskerar att skadas.\n\nEfter avslutad fart-del tar du 3 minuters riktigt lugn jogg eller gång där du kan passa på att dricka. Stanna dock inte till för länge, utan starta sedan upp igen till din vanliga långpassgrundfart och fullfölj sedan långpasset så du när dagens distansmål.",
        "details": [
          {
            "name": "Long Run",
            "distance": "26 km",
            "time": "154-158 min"
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      }
    ]
  },
  {
    "id": 16,
    "name": "Träningsvecka 16",
    "goal": "4 träningspass 51.60 km",
    "plan": "Ny vecka och nya utmaningar, där helgen blir riktigt tuff om du kör enligt programmet full ut.\n\nAtt kombinera snabbdistans (alt Tävling/Premiärmilen) med långpass dagen efter är tufft och faktiskt lite \"överkurs\".\n\n- Så tveka inte modifiera upplägget, korta ner söndagens långpass till runt 70-90 minuter du kör tufft på lördag. Stäm av med både känslan i kroppen och hur du känner mentalt för utmaningen.\n\nSka coachen guida lite helgens upplägg blir det:\n\n1. Allt känns jättebra och du inte är sliten; ja testa programmets upplägg!\n\n2. Har du kört bra med långpass under året; ja då kan du sätta snabbdistans/lopp i fokus och sen ta söndagen som den kommer med vila eller kortare långpass.\n\n3. Har du inte fått in så många långpass hittills i år, ja då prioriterar du att springa långt till helgen. Samma om du gillar att verkligen ha regelbundna långpass; då väljer du så klart att springa långt även denna helg!\n\nMen träningsveckan består ju inte bara av helgen, utan jobba på så bra du kan även i veckan fram till helgen, och det förhoppningsvis med lite vår i luften!",
    "trainingDays": [
      {
        "date": "2023-03-20",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "description": "Ny vecka och nya utmaningar, där helgen blir riktigt tuff om du kör enligt programmet full ut.\n\nAtt kombinera snabbdistans (alt Tävling/Premiärmilen) med långpass dagen efter är tufft och faktiskt lite \"överkurs\".\n\n- Så tveka inte modifiera upplägget, korta ner söndagens långpass till runt 70-90 minuter du kör tufft på lördag. Stäm av med både känslan i kroppen och hur du känner mentalt för utmaningen.\n\nSka coachen guida lite helgens upplägg blir det:\n\n1. Allt känns jättebra och du inte är sliten; ja testa programmets upplägg!\n\n2. Har du kört bra med långpass under året; ja då kan du sätta snabbdistans/lopp i fokus och sen ta söndagen som den kommer med vila eller kortare långpass.\n\n3. Har du inte fått in så många långpass hittills i år, ja då prioriterar du att springa långt till helgen. Samma om du gillar att verkligen ha regelbundna långpass; då väljer du så klart att springa långt även denna helg!\n\nMen träningsveckan består ju inte bara av helgen, utan jobba på så bra du kan även i veckan fram till helgen, och det förhoppningsvis med lite vår i luften!",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-03-21",
        "weekDay": "Tuesday",
        "type": "Fartlek Run",
        "image": "fast",
        "description": "Fartleken låter du kroppen styra och helt ok att låta passet bli lätt.\n\nDu får gärna \"fuska lite\" med farten, och bara flyta igenom med små fartvariationer. Sikta på att ha lite kortare fartbitar, från 30 sekunders upp till 2 minuters, men pressa alltså inte så hårt. Ibland kan det vara skönt att bara flyta, och nu känns som ett bra läge iallafall ur programmets perspektiv. Komplettera med full omgång styrka efter löpningen.",
        "details": [
          {
            "name": "Warm up",
            "distance": "2 km",
            "time": "11-12 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Coordination Race",
            "distance": "2x80m",
            "time": "3 min"
          },
          {
            "name": "Fartlek Run",
            "distance": "6 km",
            "time": "33 min"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Running Strength",
            "time": "15-30 min"
          },
          {
            "name": "Stretching",
            "time": "10 min"
          }
        ]
      },
      {
        "date": "2023-03-22",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-03-23",
        "weekDay": "Thursday",
        "type": "Hill Run",
        "image": "hill",
        "description": "Ett kort backpass som avbrott från alla distans/mängd.\n\n– Bra att skifta steget lite och nå muskler du kanske inte alltid aktiverar så bra i din löpning men som är bra att hålla igång så dom kan aktiveras när tröttheten sätter in på längre lopp!!\n\nUppvärmning med lugn distanslöpning till din kortbacke.\n\nBacken ska ge ett fint motlut, men inte brantare än att du kan springa på med bra steg uppför i 20-30 sekunder.\n\nLite uppmjukande rörlighet när du är framme vid backen. Lätt löpskolning gärna i motlutet på backen.\n\nKortbacken innebär att du springer fort 20-30 sekunder uppför backen. Vilan mellan backarna är lugn jogg ner, kombinerat med några sekunders ståvila på toppen/vändningen och nedanför backen innan start på nästa backe.\n\nSpring med bra tryck och försök hålla en bra teknisk löpning. Kör på såpass tufft att du precis känner lite mjölksyra på toppen. Viktigt dock att du springer första backen uppför lite lugnare, så du inte startar med chockmjölksyra i benen. Se första backen som en del i uppvärmningen. Hittat ditt tempo och din rytm uppför. Spring på med en totaltid på runt 15 minuter i backen, all tid inräknad både löpning uppför/nerför och den stående korta vilan.\n\nEfter backlöpningen är det som vanligt viktigt att du varvar ner med lugn jogg följt av stretching.\n\nKör du ASICS Premiärmilen eller satsar på en riktigt tuff träningshelg; då kortar du ner dagens till 5-8 korta 20-30 s backar med bra steg!",
        "details": [
          {
            "name": "Warm up",
            "distance": "3 km",
            "time": "18-19 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Running Technique",
            "distance": "2x20m"
          },
          {
            "name": "Hill Run",
            "time": "15 min"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "14-15 min"
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      },
      {
        "date": "2023-03-24",
        "weekDay": "Friday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-03-25",
        "weekDay": "Saturday",
        "type": "Fast Distance Run",
        "image": "fast",
        "description": "Snabbdistans på schemat idag, och för er som bor i Stockholmsområdet kan ni använda ett virtuellt Premiärmilen som ert pass.\n\n- Om du inte kör loppet \"räcker det\" att du springer 8km snabbdistans, och du får gärna använda din testloppsrunda som du haft tidigare i programmet och se vad du har \"över dina test 5km\" och sedan lägga på 3km direkt på din 5:a.\n\nMålbild ner mot 5.05-5.10 fart, något lugnare om kroppen inte riktigt vill. Hur som helst som alltid harmonisk start, men sen får du gärna mobilisera mental kraft till att springa på riktigt tufft.",
        "details": [
          {
            "name": "Warm up",
            "distance": "2 km",
            "time": "11-12 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Coordination Race",
            "distance": "2x80m",
            "time": "3 min"
          },
          {
            "name": "Fast Distance Run",
            "distance": "8 km",
            "time": "41-42 min"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Stretching",
            "time": "5 min"
          }
        ]
      },
      {
        "date": "2023-03-26",
        "weekDay": "Sunday",
        "type": "Long Run",
        "image": "long",
        "description": "Någon kortare långpass idag, eftersom programmets upplägg utgår från att tanken dagens långpass ska komma i kombination med en tuffare snabbdistans igår.\n\nSprang du inte lite tuffare igår, och allt känns ok idag kan du såklart förlänga ut passet något om du vill; eller så tar du ändå \"bara\" 22 km och ger kroppen en något lugnare helg!",
        "details": [
          {
            "name": "Long Run",
            "distance": "22 km",
            "time": "132-136 min"
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      }
    ]
  },
  {
    "id": 17,
    "name": "Träningsvecka 17",
    "goal": "4 träningspass 42.20 km",
    "plan": "Hoppas träningen flyter på och att den nu underlättas av att det våras lite!!\n\nEn variationsrik vecka träningsmässigt genom att coachen bland annat lägger in ett backpass med olika längd där du kan jobba med olika fart och rörelseuttag i din löpning utifrån backens längd. Torsdag har grundbyggande korta intervaller där du springer din för säsongen bekvämt snabba fart; kommer hur du än gör bli bra överfart till allt annat.\n\nHitta ditt flyt; och pressa INTE INTE TUFFT på de korta intervallerna.\n\nSöndagen rullar långpasset på som vanligt och nu med 28 km som målbild; i din lugna fart!",
    "trainingDays": [
      {
        "date": "2023-03-27",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "description": "Hoppas träningen flyter på och att den nu underlättas av att det våras lite!!\n\nEn variationsrik vecka träningsmässigt genom att coachen bland annat lägger in ett backpass med olika längd där du kan jobba med olika fart och rörelseuttag i din löpning utifrån backens längd. Torsdag har grundbyggande korta intervaller där du springer din för säsongen bekvämt snabba fart; kommer hur du än gör bli bra överfart till allt annat.\n\nHitta ditt flyt; och pressa INTE INTE TUFFT på de korta intervallerna.\n\nSöndagen rullar långpasset på som vanligt och nu med 28 km som målbild; i din lugna fart!",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-03-28",
        "weekDay": "Tuesday",
        "type": "Hill Run",
        "image": "hill",
        "description": "Idag blir det backe! Först uppvärmning med distansjogg som tar dig till en backe som helst ska vara så lång så att du kan få in upp till 60 sekunders löpning uppför i en bekvämt snabb fart. Lagom brant så du kan springa hela 60 sekunders sträckan uppför i ok fart.\n\nVäl på plats vid backen kör du lite rörlighet och löpskolning.\n\nLöpskolningen; 2 x 20 meter i backens nedersta motlut.\n\nGrundövningar; låg skipp - höga knälyft- hälkick och sedan kan du om du vill addera någon övning till (kolla in videon). Gångvila ner löpskolningssträckan. Tänk på bra hållning och aktivt steg.\n\nSen startar vi själva backpasset, och det blir ett pass där vi kommer jobba med både med längre och kortare backar.\n\nSyftet med passet blir att jobba med löpteknik, löpstyrka och kondition men även lite olika ”tryck i steget” under passet.\n\nVi inleder med några 60 sekunders (tar ca 60 sekunder uppför) långbackar där vi jobbar med bra teknik men utan att trycka på alltför mycket. Vi springer ”fint och kontrollerat” uppför.\n\nBra att ta första långbacken som en del i uppvärmningen.\n\nNär vi sen övergår till en mellanvariant i tiden uppför blir det 40 sekunders löptid uppför och nu försöker du öka på trycket i steget ett snäpp men inte tuffare än att vi på passets avslutande korta \"20 sekunder backar\" kan öka tryck, rörelseomfång och hållning ännu ett snäpp.\n\nVilan mellan backarna blir att du stannar till och vilar några sekunder där vi vänder, och sedan joggar vi ner till starten och tar några sekunders vila innan vi startar på nytt.\n\nPå de längre backarna får joggen ner gärna vara lite fortare, men på de kortare backarna kan joggen ner vara riktigt lugn och gärna även lite gång i början och slutet av ”nerförs transporten”.\n\nMellan växlingarna av backlängden kan du även ta några sekunders extra ståvila nedanför backen så du är redo trycka på ett snäpp mer på nästa variant backlängd.\n\nDin målbild idag blir att köra följande antal backar i respektive tidslängd uppför:\n\n4 x 60 sekunder\n\n5 x 40 sekunder\n\n5 x 20 sekunder\n\nEfter backlöpningen varvar du ner med lugn jogg följt av stretch i någon form.",
        "details": [
          {
            "name": "Warm up",
            "distance": "3 km",
            "time": "17-18 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Coordination Race",
            "distance": "2x20m"
          },
          {
            "name": "Hill Run",
            "distance": "6 km",
            "time": "4x60-5x40-5x20 second"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Stretching",
            "time": "5 min"
          }
        ]
      },
      {
        "date": "2023-03-29",
        "weekDay": "Wednesday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-03-30",
        "weekDay": "Thursday",
        "type": "Interval Run",
        "image": "fast",
        "description": "Starta dagens pass med en uppvärmningsdistans i lugn fart i runt 2,5 km, följt av kort uppmjukande rörlighet. Därefter ett löpskolningsinslag med några övningar över 2 x 30 meter. Kör även gärna någon koordination för att få upp puls och fart innan intervall-delen startar.\n\nUpplägget på intervallpasset blir 200 meters intervaller, uppdelat i serier med 4 intervaller i varje serie. Vilan är 30 sekunders ”ståvila” mellan intervallerna, och sedan tar du 60 sekunder stå/gå vila mellan varje serie. Målbilden blir 16 intervaller totalt, så 4 x 4 x 200 meter.\n\n- Så riktigt kort vila idag, vilket innebär att farten inte ska vara pressad eller hög utan den korta vilan borgar för bra konditionseffekt och överfart till ditt maratempo blir det ju med supermarginal :)\n\nProgrammet (och du) ska ha grundbyggande konditionsträning fortsatt i fokus men målet är givetvis också att få igång farten i benen utan att riskera skador genom för snabb löpning.\n\nSpring igenom passet med ”en växel kvar”, och ha fokus på din teknik. Bra ståtlig hållning och aktivt steg. Låt armarnas driv hjälpa till med farten utan att för den skull lockas att sprinta!\n\nRiktfart runt 4.10-4.15 min/km, vilket ger runt 50-51 sekunder per 200 meter.\n\nAvsluta som vanligt passet med nedjogg rörlighet.",

        "details": [
          {
            "name": "Warm up",
            "distance": "2.5 km",
            "time": "14-15 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Coordination Race",
            "distance": "1x80m",
            "time": "3 min"
          },
          {
            "name": "Interval Run",
            "distance": "4 x 4 x 200m"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Stretching",
            "time": "5 min"
          }
        ]
      },
      {
        "date": "2023-03-31",
        "weekDay": "Friday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-04-01",
        "weekDay": "Saturday",
        "type": "Cross training",
        "image": "rest",
        "description": "För att få in veckans styrka, kör vi ett separat hemmapass utan löpning. Lätt lätt uppvärmning \"runt huset\", cykel eller annat, och sen lite lättare styrka än vanligt bara för att hålla igång musklerna och inte tappa den kontinuitet vi byggt upp via styrka varje vecka.",
        "details": [
          {
            "name": "Running Strength",
            "time": "15-30 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "10 min"
          }
        ]
      },
      {
        "date": "2023-04-02",
        "weekDay": "Sunday",
        "type": "Long Run",
        "image": "long",
        "description": "26 km långpass. Långt men ändå inte maxat i distans och bara din för dagen relativt \"lugna\" långpassfart. Korta ner om kroppen är sliten. Helheten är viktigast - och vi har ju flera helger till att jobba med långpassgrunden på inför maran.",
        "details": [
          {
            "name": "Long Run",
            "distance": "26 km",
            "time": "156-160 min"
          },
          {
            "name": "Stretching",
            "time": "5 min"
          }
        ]
      }
    ]
  },
  {
    "id": 18,
    "name": "Träningsvecka 18",
    "goal": "3 träningspass 45.40 km",
    "plan": "Tuff vecka igen, även om den begränsar sig till 3 träningspass. Inledningen på veckan ska dock vara relativt lätt, med marafartpasset som även om det ger volym inte ska slita så mycket. Intervallerna får vara ett tufft pass, men tänk på att inte på för hårt inledningsvis där.\n\nTill helgen återkommer passet med \"maratontusingar\" där målbilden är hela 18 x 1 km. Känns det för tufft, ja då kan du omvandla passet till ett vanligt långpass i din grundfart och a som mål att springa 23-25 km totalt.",
    "trainingDays": [
      {
        "date": "2023-04-03",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "description": "Tuff vecka igen, även om den begränsar sig till 3 träningspass. Inledningen på veckan ska dock vara relativt lätt, med marafartpasset som även om det ger volym inte ska slita så mycket. Intervallerna får vara ett tufft pass, men tänk på att inte på för hårt inledningsvis där.\n\nTill helgen återkommer passet med \"maratontusingar\" där målbilden är hela 18 x 1 km. Känns det för tufft, ja då kan du omvandla passet till ett vanligt långpass i din grundfart och a som mål att springa 23-25 km totalt.",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-04-04",
        "weekDay": "Tuesday",
        "type": "Marathon Pace Run",
        "image": "fast",
        "description": "Efter kort uppvärmning; lite snabbare än distansen och din rytmen till maran!",
        "details": [
          {
            "name": "Warm up",
            "distance": "1 km",
            "time": "6 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Marathon Pace Run",
            "distance": "10 km",
            "time": "56 min"
          },
          {
            "name": "Cool Down",
            "distance": "1 km",
            "time": "6 min"
          },
          {
            "name": "Running Strength",
            "time": "15-30 min"
          },
          {
            "name": "Stretching",
            "time": "10 min"
          }
        ]
      },
      {
        "date": "2023-04-05",
        "weekDay": "Wednesday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-04-06",
        "weekDay": "Thursday",
        "type": "Interval Run",
        "image": "fast",
        "description": "Idag springer vi här med programmet ett kombinations intervallpass med långa och korta intervaller. Vi ska upprepa intervallserien 2 x 3 minuter följt av 4 x 40 sekunder Som vanligt inför fartdelen i passet inleder du med en uppvärmningslöpning. Låt uppvärmningen ta dig till din inspirerande intervallsträcka. Du kan springa intervallerna fram och tillbaka på samma sträcka, men du kan såklart även ”beta” av intervallerna framåt på din runda. Vill du går det även mycket bra att springa passet på löparbana och då kan du till och med utgå från en fast sträcka på intervallerna och låta tiden blir runt 3 minuter på ”din långa” och runt 40 sekunder på dian korta intervaller. Oavsett vart du springer intervallerna bör dock intervallsträckan inte vara alltför kuperad; och kommer det en kupering; anpassar du farten och jagar inte snittfart. När du värmt upp med din lugna löpning, kör du lite dynamisk rörlighet och gärna även några uppvärmande och löpstyrkegivande löpskolningsövningar. Sedan avslutar du uppvärmningsdelen med något koordinationslopp/stegringslopp. Sen är du redo för intervallerna, där du kan utgå från ”riktfarterna” men din känsla är viktigast och då gäller att du på ”långa” 3 minuters intervallen hittar ett bra flyt samtidigt som vi ska tillåta oss viss trötthet. På 40 sekunders intervallerna kan du våga ta ut steget ännu mer och verkligen jobba bra med din fart. Vilan är 1 minuts stående/gående mellan och efter 3 minuters intervallerna och sedan 40 sekunders stående/gående efter varje 40 sekunders intervall. När du kört en hel serie 2 x 3 minuter följt av 4 x 40 sekunder tar du en serievila på runt 1-1,5 minuter. Här avgör du hur lång tid du behöver för att ladda om. Målbilden här med programmet blir följande upplägg: 2 SERIER där varje serie innehåller 2 x 3 minuter följt av 4 x 40 sekunder. 1 SERIE med 1 x 3 minuter följt av 2 x 40 sekunder. (Total intervalltid 21:40 min) 3 minuters riktfart: 4.40 min/km. Ger ca 640 meter per intervall. 40 sekunders riktfart: 4.06 min/km. Ger ca 165 meter per intervall. Avrunda med lugn nedjogg!",
        "details": [
          {
            "name": "Warm up",
            "distance": "2.5 km",
            "time": "14-15 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Running Technique",
            "distance": "2x20m"
          },
          {
            "name": "Interval Run",
            "distance": "2 x (2x640m) + 1x640m",
            "time": "2 x (2x3 min) + 1x3 min"
          },
          {
            "name": "Interval Run",
            "distance": "2 x (4x165m) + 2x165m",
            "time": "2 x (4x40s) + 2x40 s"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      },
      {
        "date": "2023-04-07",
        "weekDay": "Friday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-04-08",
        "weekDay": "Saturday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-04-09",
        "weekDay": "Sunday",
        "type": "Long Run",
        "image": "long",
        "description": "Idag återkommer passet som coachen kallar ”maratontusingar”. Vi hade det i programmet i slutet av februari och nu kör vi alltså igen och lägger dessutom på två \"Marathontusingar\".\n\nPasset innebär att du ska samla ihop långpassvolym genom att springa många ”lugna” 1 km intervaller. I långpassvolymen som skapas räknar vi även in uppvärmning 2-3 km och nedvarvning 2-3km.\n\nSå inled passet med lugn löpning några kilometrar. Stanna till och kör lite rörlighet för dina leder/ligament och löpmuskler. Vill du kan du även lägga in någon enkel och uppmjukande löpskolningsövning. Sedan är du redo starta dina 1 km intervaller.\n\nMålbild blir att springa runt 30-40 sekunder snabbare i minuter per kilometer än ditt normala långpasstempo.\n\nOptimera ditt upplägg med att starta de första 1 km intervallerna lite långsammare/lugnare än angiven ”riktfart”, så att för att du sedan kan öka farten lite efterhand och att den sista 1 km intervallen blir den snabbaste – trots att du då har som mest volym i benen.\n\nFör dig med snabba 4:00 som tidsmål är målet 18 x 1 km och riktfarten efter att du kommit igång blir runt 5:30-5:20 min/km om vi utgår från 6:00 i långpasstempo.\n\nVilan mellan varje ”Maratontusing” tar du 60 sekunders stående/gående vila.\n\nTa med dricka ut på passet, och kanske även någon energigel. (eller annat du gillar med energi)\n\nMentalt; tänk positivt och att du ju faktiskt får vila, vilket du inte får under långpasset så regelbundet som nu. Beta av tusing för tusing, och se fram mot att känslan då får när du kört 18 st!\n\nEfter 18:e intervallen pustar du ut innan du avslutar passet med några kilometers lugn nedvarvning och avslutade lätt rörlighet för löpmusklerna som fått jobba!",

        "details": [
          {
            "name": "Warm up",
            "distance": "2-3 km",
            "time": "12-18 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Marathon Pace Run",
            "distance": "18 x 1 km"
          },
          {
            "name": "Cool Down",
            "distance": "2-3 km",
            "time": "12-18 min"
          }
        ]
      }
    ]
  },
  {
    "id": 19,
    "name": "Träningsvecka 19",
    "goal": "4 träningspass 54 km",
    "plan": "Lite lugnare inledning på veckan kan behövas, så ta högst 6 km där så du kan hämta hem all gjord och kommande träning. För resten av veckan och kommande veckor är tuffa. Var lyhörd och plocka bort/lätta upp pass om du behöver. Snabbdistansen är lång; och tuff och sen till helgen skippar du det korta backinslaget om du är sliten. Viktigare att få in långpasset.",
    "trainingDays": [
      {
        "date": "2023-04-10",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "description": "Lite lugnare inledning på veckan kan behövas, så ta högst 6 km där så du kan hämta hem all gjord och kommande träning. För resten av veckan och kommande veckor är tuffa. Var lyhörd och plocka bort/lätta upp pass om du behöver. Snabbdistansen är lång; och tuff och sen till helgen skippar du det korta backinslaget om du är sliten. Viktigare att få in långpasset.",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-04-11",
        "weekDay": "Tuesday",
        "type": "Easy Run",
        "image": "easy",
        "description": "Lugn distans!",
        "details": [
          {
            "name": "Easy run",
            "distance": "6 km",
            "time": "34-35 min"
          },
          {
            "name": "Running Strength",
            "time": "15-30 min"
          },
          {
            "name": "Stretching",
            "time": "10 min"
          }
        ]
      },
      {
        "date": "2023-04-12",
        "weekDay": "Wednesday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-04-13",
        "weekDay": "Thursday",
        "type": "Interval Run",
        "image": "fast",
        "description": "Snabbdistanspass. Känns allt bra, kan du sporrars av att pressa tiden, och förhoppningsvis går det lite snabbare nu än i början på vårt träningsprogram. Målbild runt 5.00 min/km i fart.\n\nTänk dock på helheten i din träning där inget enskilt pass får bli för hårt. Sliten; Spring igenom utan tidsambition, och framförallt låt kroppen komma in i passet genom en lite softare inledning på din 7 km snabbdistans.",
        "details": [
          {
            "name": "Warm up",
            "distance": "2 km",
            "time": "11-12 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Running Technique",
            "distance": "2x30m",
            "time": "10 min"
          },
          {
            "name": "Coordination Race",
            "distance": "2x80m",
            "time": "3 min"
          },
          {
            "name": "Fast Distance Run",
            "distance": "7 km",
            "time": "35-37 min"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Stretching",
            "time": "5 min"
          }
        ]
      },
      {
        "date": "2023-04-14",
        "weekDay": "Friday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-04-15",
        "weekDay": "Saturday",
        "type": "Easy Run",
        "image": "easy",
        "description": "Extrapass som du bara lägger in i din helhet om du känner dig pigg, och du känner att du svarat bra på programmets träning. Lugn distans på 3+3 km där du stannar till under rundan (i förslaget efter 3 km och distansen skriven som uppvämning och nedjogg) ) och lägger in 5x100 meters kort backe med spänstigt steg.\n\nTa lite vila uppe/nere (5-10 s) och ha lugn jogg nerför också som din vila.\n\nFokus att få till lite tryck uppför utan att bli riktigt trött!\n\nBra kombo med långpasset OM du är pigg i kroppen i övrigt!",
        "details": [
          {
            "name": "Warm up",
            "distance": "3 km",
            "time": "17-18 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Short Slope Run",
            "distance": "5x100m",
            "time": "10 min"
          },
          {
            "name": "Cool Down",
            "distance": "3 km",
            "time": "18 min"
          },
          {
            "name": "Stretching",
            "time": "5-10 min"
          }
        ]
      },
      {
        "date": "2023-04-16",
        "weekDay": "Sunday",
        "type": "Long Run",
        "image": "long",
        "description": "Rekordlångt för programmet. Anpassa till din känsla! Korta ner om dt känns för tufft.\n\nTa med dricka; och läge börja testa in din energiplan för maran!",
        "details": [
          {
            "name": "Long Run",
            "distance": "30 km",
            "time": "180-185 min"
          },
          {
            "name": "Dynamic Stretch",
            "time": "5-10 min"
          }
        ]
      }
    ]
  },
  {
    "id": 20,
    "name": "Träningsvecka 20",
    "goal": "4 träningspass 48.50 km",
    "plan": "En vecka där vi sätter fokus på torsdagens intervallpass och men sen lite kortare långpass till helgen för att hålla igång långpasskänslan och samtidigt ge kroppen chans att ta till sig all tuff träning - och vara redo för programmets sista riktigt tuffa veckor inkl våra två längsta långpass. Så kortare nu - för att kunna växla upp ett snäpp till sen.\n\nSpringer du Premiärhalvan på lördag?, ja då gör du om veckan och skippar långpasset och tar loppet som din tuffa träning denna helg!\n\nTorsdagens fartpass skulle du kunna lägga på tisdag, så kör du bara lugn jogg på torsdagen inför loppet!",
    "trainingDays": [
      {
        "date": "2023-04-17",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "description": "En vecka där vi sätter fokus på torsdagens intervallpass och men sen lite kortare långpass till helgen för att hålla igång långpasskänslan och samtidigt ge kroppen chans att ta till sig all tuff träning - och vara redo för programmets sista riktigt tuffa veckor inkl våra två längsta långpass. Så kortare nu - för att kunna växla upp ett snäpp till sen.\n\nSpringer du Premiärhalvan på lördag?, ja då gör du om veckan och skippar långpasset och tar loppet som din tuffa träning denna helg!\n\nTorsdagens fartpass skulle du kunna lägga på tisdag, så kör du bara lugn jogg på torsdagen inför loppet!",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-04-18",
        "weekDay": "Tuesday",
        "type": "Easy Run",
        "image": "easy",
        "description": "Lugn distans på ca 8km för att bara hålla känsla och volym i träningen. Ha med dig att veckans avslutning kommer bli tuff, så en lugn \"underhållande¨\" start på veckan räcker bra.",
        "details": [
          {
            "name": "Easy run",
            "distance": "8 km",
            "time": "46-48 min"
          },
          {
            "name": "Running Strength",
            "time": "15-30 min"
          },
          {
            "name": "Stretching",
            "time": "10 min"
          }
        ]
      },
      {
        "date": "2023-04-19",
        "weekDay": "Wednesday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-04-20",
        "weekDay": "Thursday",
        "type": "Interval Run",
        "image": "fast",
        "description": "Idag ska vi springa en intervallstege där vi ökar på farten ju kortare intervallen blir. Först värmer vi upp som vanligt med lugn distansjogg som tar dig till din intervallsträcka. Ha som mål ta dig till en sträcka/runda där du kan få in 3 minuters löpning i intervallfart utan alltför stor kupering.\n\nEfter den uppvärmande lugna löpningen kör du först lite rörlighet och därefter lägger vi in veckans löpskolning. Kör dina övningar som du gillar, och med ett rörelseuttag anpassat till dig och din vana vid löpskolningen. Avrunda sedan uppvärmningen med två pulshöjande koordinationslopp och sen 1-2 minuters vila innan start på intervalldelen.\n\nVi kör ett intervall-upplägg lite anpassat så du skulle kunna köra detta tillsammans med någon/några löpkompisar även om ni är på olika nivå. För då kan du/ni springa ”fram/tillbaks” på samma sträcka då intervallstegen vi ska köra hela tiden upprepar en intervallängd två gånger.(Fram + tillbaks kommer göra att ni hela tiden hamnar på samma ställe efter varannan intervall oavsett nivå)\n\nKör du själv eller med en kompis du är jämn med gällande fart kan du/ni givetvis köra passet framåt på en runda om det känns mer stimulerande än fram/tillbaks upplägget.\n\nOavsett upplägg, är målbilden att du jobbar med högre fart ju kortare intervalltid/sträcka. Ha dock med dig att du på den inledande 3 minuters tar det ”lagom” så du hittar rätt i passet.\n\nVi samma vila genom hela passet på 1 minuts stående/gående mellan varje intervall.\n\nUpplägget på intervallstegen blir:\n\nIntervallstegen: 2 x 3 min – 2 x 2 min – 2 x 1 min följt av 2 x 2 min – 2 x 1 min\n\n12 + 6 minuter, totalt 18 minuters intervalltid. (Hinner ca 4 km)\n\nRiktfarter:\n\n3 minuters: 4.39 min/km hinner ca 645m\n\n2 minuters: 4.25 min/km hinner ca 450m\n\n1 minuters: 4.15 min/km hinner ca 235m\n\nEfter intervalldelen avrundar du som vanligt med nedjogg och stretch.",
        "details": [
          {
            "name": "Warm up",
            "distance": "2.5 km",
            "time": "14-15 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Running Technique",
            "distance": "2x30m"
          },
          {
            "name": "Coordination Race",
            "distance": "2x80m",
            "time": "3 min"
          },
          {
            "name": "Interval Run",
            "distance": "Totalt ca 4 km",
            "time": "2x3-2x2-2x1-2x2-2x1 min"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Stretching",
            "time": "5 min"
          }
        ]
      },
      {
        "date": "2023-04-21",
        "weekDay": "Friday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-04-22",
        "weekDay": "Saturday",
        "type": "Easy Run",
        "image": "easy",
        "description": "Lugn bara komma ut och springa pass. Egentid eller en pratstund med någon kompis.",
        "details": [
          {
            "name": "Easy Run",
            "distance": "6 km",
            "time": "35-36 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          }
        ]
      },
      {
        "date": "2023-04-23",
        "weekDay": "Sunday",
        "type": "Long Run",
        "image": "long",
        "description": "Lugnt långpass - med lite kortare distans för att ge lite andrum innan vi går vidare med två till riktigt långa långpass i slutfasen in mot maran.\n\n26 km i din för dagen bekväma långpassfart - håller igång allt - och ger kroppen chans suga upp all tuff träning!\n\nTa med drick ut på passet, och har du möjlighet - testa av att ta energi någon gång under passet för att \"träna\" på det inför maran och för att ha bra energinivå under passet!",
        "details": [
          {
            "name": "Long Run",
            "distance": "26 km",
            "time": "156-162 min"
          },
          {
            "name": "Dynamic Stretch",
            "time": "5-10 min"
          }
        ]
      }
    ]
  },
  {
    "id": 21,
    "name": "Träningsvecka 21",
    "goal": "3 träningspass 45 km",
    "plan": "Träningsprogrammet kör vidare, och om du är sliten sedan senaste tidens tuffa träning, kan det vara läge \"pulsera ner denna veckan\".\n\nFör att göra veckan något lättare kan du ta bort eller korta ner pass i och sen förhoppningsvis blir du då både sugen på och mottaglig för ett riktigt långt pass på söndag - ett pass som är veckans fokuspass förutsatt att du inte är \"för sliten\".\n\nOm allt flyter på, ja då kör du får du såklart köra på veckan fullt ut; och då kan ett bra backpass passa in för både löpstyrkan, löptekniken och konditionsträningen!",
    "trainingDays": [
      {
        "date": "2023-04-24",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "description": "Träningsprogrammet kör vidare, och om du är sliten sedan senaste tidens tuffa träning, kan det vara läge \"pulsera ner denna veckan\".\n\nFör att göra veckan något lättare kan du ta bort eller korta ner pass i och sen förhoppningsvis blir du då både sugen på och mottaglig för ett riktigt långt pass på söndag - ett pass som är veckans fokuspass förutsatt att du inte är \"för sliten\".\n\nOm allt flyter på, ja då kör du får du såklart köra på veckan fullt ut; och då kan ett bra backpass passa in för både löpstyrkan, löptekniken och konditionsträningen!",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-04-25",
        "weekDay": "Tuesday",
        "type": "Interval Run",
        "image": "fast",
        "description": "Uppvärmning följt av fem serier med femton/femton som vi haft en gång tidigare. Löpning i snabb men kontrollerad fart 15 sekunder och sedan vila 15 sekunder. Detta upprepar du alltså 5 gånger i varje serie.\n\nTotalt 5 serier i dagens pass och vilan mellan varje serie är på 1-2 minuters stå/går-runt vila. Troligen får du ihop runt 1,5 km men det viktiga är som tidigare INTE volymen utan att du jobbar med fart och steget som är fokus. Spring så fort du kan med tanke på att du ska starta direkt efter 15 sekunder igen. Kör fram/tillbaks eller framåt på en sträcka.\n\nAvrunda dagens pass med veckan styrka och grundlig rörlighet.",
        "details": [
          {
            "name": "Warm up",
            "distance": "2.5 km",
            "time": "14-15 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Coordination Race",
            "distance": "1x80m",
            "time": "3 min"
          },
          {
            "name": "Short Interval Run",
            "time": "5x15/15"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Running Strength",
            "time": "15 min"
          },
          {
            "name": "Stretching",
            "time": "5 min"
          }
        ]
      },
      {
        "date": "2023-04-26",
        "weekDay": "Wednesday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-04-27",
        "weekDay": "Thursday",
        "type": "Hill Run",
        "image": "hill",
        "description": "Idag är planen att vi ska springa en kombinationsvariant med både några långa men även korta backar. För volym till passet tar vi en distansuppvärmning på 3 km. Sen löpskolningen innan backstart. I backen kör vi på antal istället för tid men gör ett kort överslag att det tar runt 17-18 minuter och blir minst 2 km totalt. Upplägget blir 3x60 sekunders backar, följt av 4x40 sekunders och avslut i backen med 4x20 sekunders backar. Tiden angiven i uppförslöpningen och vilan mellan varje backe är lätt jogg ner för backen och 5-10 sekunders ståvila vid vändningarna \"uppe\" och \"nere\". Försök få till ett upplägg där de långa backarna går i i en fart där du kan springa \"fint\" och utan att du blir helt slut. Jobba tuffare på 40 sekunders backen och sen på 20 sekunders hoppas jag backen är såpass kort att du kan spänsta uppför med bra tryck. Valet av backe utgår från att du ska klara lutningen på långbacken, så välj inte \"för brant\" backe.",
        "details": [
          {
            "name": "Warm up",
            "distance": "3 km",
            "time": "17-18 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Running Technique",
            "distance": "2x30m",
            "time": "5 min"
          },
          {
            "name": "Hill Run",
            "distance": "3 km",
            "time": "17-18 min"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Stretching",
            "time": "5 min"
          }
        ]
      },
      {
        "date": "2023-04-28",
        "weekDay": "Friday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-04-29",
        "weekDay": "Saturday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-04-30",
        "weekDay": "Sunday",
        "type": "Long Run",
        "image": "long",
        "description": "Rekordlångt långpass. 31 km om allt flyter på\n\n- Viktigt att vara lyhörd på signalerna; sliten ja då kortar du ner dagens långpass. Dricka, under och efter och energi under och efter passet!!",
        "details": [
          {
            "name": "Long Run",
            "distance": "31 km",
            "time": "181-190 min"
          },
          {
            "name": "Dynamic Stretch",
            "time": "5-10 min"
          }
        ]
      }
    ]
  },
  {
    "id": 22,
    "name": "Träningsvecka 22",
    "goal": "4 träningspass 41 km",
    "plan": "Mellanvecka med fart och återhämtande (?) långpass.\n\nFokus ge kroppen något lugnare träning och att få in korta intervaller (utan fart som riskerar någon skavank). Långpasskänslan är såklart bra att behålla - men coachen tänker att det år vara kortare så du kan ladda för efterföljande veckas längsta långpass",
    "trainingDays": [
      {
        "date": "2023-05-01",
        "weekDay": "Monday",
        "type": "Rest Day",
        "image": "rest",
        "description": "Mellanvecka med fart och återhämtande (?) långpass.\n\nFokus ge kroppen något lugnare träning och att få in korta intervaller (utan fart som riskerar någon skavank). Långpasskänslan är såklart bra att behålla - men coachen tänker att det år vara kortare så du kan ladda för efterföljande veckas längsta långpass",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-05-02",
        "weekDay": "Tuesday",
        "type": "Easy Run",
        "image": "easy",
        "description": "Kort lugn distans och styrka får inleda veckan. Du kommer ju få långt på söndag; så nöj dig med 5 km idag!!",
        "details": [
          {
            "name": "Easy Run",
            "distance": "5 km",
            "time": "29-30 min"
          },
          {
            "name": "Running Strength",
            "time": "15-30 min"
          },
          {
            "name": "Stretching",
            "time": "10 min"
          }
        ]
      },
      {
        "date": "2023-05-03",
        "weekDay": "Wednesday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-05-04",
        "weekDay": "Thursday",
        "type": "Interval Run",
        "image": "fast",
        "description": "Kortintervallerna känner du igen. Sista gången där du kör 15 stycken 200 meters.\n\nMålbild snäppet snabbare än senast om du har en bra dag. Så en bit under 4.00 tempo och alltså under 48 sekunder per 200 meter.\n\nVilan håller vi kvar vid 45 s mellan intervallerna och 90 s mellan serierna.\n\nFlyt, men ändå lite tryck i steget på sista serien. Tillåt dig bli trött....om du har en ok dag!",
        "details": [
          {
            "name": "Warm up",
            "distance": "2 km",
            "time": "11-12 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Running Technique",
            "distance": "2x30m",
            "time": "10 min"
          },
          {
            "name": "Coordination Run",
            "distance": "2x80m",
            "time": "3 min"
          },
          {
            "name": "Interval Run",
            "distance": "3x5x200m",
            "time": "22 min"
          },
          {
            "name": "Cool Down",
            "distance": "2 km",
            "time": "12 min"
          },
          {
            "name": "Stretching",
            "time": "5 min"
          }
        ]
      },
      {
        "date": "2023-05-05",
        "weekDay": "Friday",
        "type": "Rest Day",
        "image": "rest",
        "details": [
          {
            "name": "Rest Day"
          }
        ]
      },
      {
        "date": "2023-05-06",
        "weekDay": "Saturday",
        "type": "Easy Run",
        "image": "easy",
        "description": "Testa maraupplägget, med en kort jogg, rörlighet och två lätta koordinationer dagen innan långt pass! Se om detta känns bra eller om tex helvilan dagen som du haft vid andra långpass gav/ger dig bättre effekt! Då vet du hur du ska göra när det är dags...",
        "details": [
          {
            "name": "Easy Run",
            "distance": "3 km",
            "time": "17-18 min"
          },
          {
            "name": "Dynamic Movement",
            "time": "5 min"
          },
          {
            "name": "Coordination Run",
            "distance": "2x50m",
            "time": "3 min"
          },
        ]
      },
      {
        "date": "2023-05-07",
        "weekDay": "Sunday",
        "type": "Long Run",
        "image": "long",
        "description": "Programmet bryter av med ett lite kortare långpass. Om du ett långpass kan kännas kort?\n\nPasset underhåller din långpass känsla, men ger förhoppningsvis kroppen chans ta till sig all träning.\n\nCoach Szalkai vill att detta lite kortare långpass nu ger dig en liten \"buffert\" både mentalt och fysisk inför programmets kommande sista tuffa del - innan nedtrappningen börjar mot maran som nu bara är mindre än 4 veckor bort.\n\nSå lugn grundfart och lite kortare, men såklart med vanliga långpass-råden där dricka/energi ingår och att du är noga efter passet med torra kläder och ny energi in så du inte öppnar upp för att dra på dig någon onödig förkylning nu!",
        "details": [
          {
            "name": "Long Run",
            "distance": "26 km",
            "time": "156-160 min"
          },
          {
            "name": "Dynamic Stretch",
            "time": "5-10 min"
          }
        ]
      }
    ]
  }
]
